{
  "title": "Active listening",
  "content": "Active listening is the practice of preparing to listen, observing what verbal and non-verbal messages are being sent, and then providing appropriate feedback for the sake of showing attentiveness to the message being presented.\nActive listening is listening to understand. This form of listening conveys a mutual understanding between speaker and listener. Speakers receive confirmation their point is coming across and listeners absorb more content and understanding by being consciously engaged. The overall goal of active listening is to eliminate any misunderstandings and establish clear communication of thoughts and ideas between the speaker and listener.  By actively listening to another person, a sense of belonging and mutual understanding between the two individuals is created.\nThe term \"active listening\" was introduced in 1957 by Carl Rogers and Richard Farson. It may also be referred to as reflective listening. Active listening encloses the communication attribute characterized by paying attention to a speaker for better comprehension, both in word and emotion. It is the opposite of passive listening, where a listener may be distracted or note critical points to develop a response. It calls for an attentive mind and empathetic concern for the speaker's perspective. The concept was developed in the 1950s by Carl Rogers and Richard Farson. Active listening encloses the communication attribute characterized by paying attention to a speaker for better comprehension, both in word and emotion. It is the opposite of passive listening, where a listener may be distracted or note critical points to develop a response. It calls for an attentive mind and empathetic concern for the speaker's perspective. Active listening is a communication technique designed to foster understanding and strengthen interpersonal relationships by intentionally focusing on the speaker's verbal and non-verbal cues. Unlike passive listening, which involves simply hearing words, active listening requires deliberate engagement to fully comprehend the speaker's intended message. Research has demonstrated that active listening promotes trust, reduces misunderstandings, and enhances emotional connection, making it a valuable tool in both personal and professional contexts.\nActive listening is being fully engaged while another person is talking to you. It is listening with the intent to understand the other person fully, rather than listening to respond. Active listening includes asking curious questions such as, \"How did you feel?\" or \"What did you think?\"\n\n\n== History ==\nWilliam James identified a variety of attention called \"the reproduction of the sensation from within.\" He suggested that people could learn more by engaging this ability directly: ...reading not merely with the eye, and of listening not merely with the ear, but... articulating to one’s self the words seen or heard, ought to deepen one’s attention to the latter.I can keep my wandering mind a great deal more closely upon a conversation or a lecture if I actively re-echo to myself the words than if I simply hear them; and I find a number of my students who report benefit from voluntarily adopting a similar course.\nCarl Rogers and Richard Farson coined the term \"active listening\" in 1957 in a paper of the same title (reprinted in 1987 in the volume Communicating in Business Today). Practicing active listening also emphasized Rogers' (1980) concept of three facilitative conditions for effective counseling; empathy, genuineness, and unconditional positive regard. Rogers and Farson write: \"Active listening is an important way to bring about changes in people. Despite the popular notion that listening is a passive approach, clinical and research evidence clearly shows that sensitive listening is a most effective agent for individual personality change and group development. Listening brings about changes in peoples' attitudes toward themselves and others; it also brings about changes in their basic values and personal philosophy. People who have been listened to in this new and special way become more emotionally mature, more open to their experiences, less defensive, more democratic, and less authoritarian.\"\nThe theoretical framework for active listening developed in the middle of the 20th century, most notably by Carl Rogers and Richard Farson, who launched the concept in their seminal 1957 essay \"Active Listening\". Rooted in therapeutic communication, this approach was earmarked by its emphasis on the transformative power of listening to promote personal and relational growth. Rogers and Farson insisted on the fact that this non-threatening, empathic environment should be created where people would feel listened to and understood; it is the primary condition for overcoming defensiveness and, therefore, the capability of reflection. Their work established active listening as an essential skill for effective interpersonal communication—extending its relevance beyond therapy to business and everyday interactions.\n\n\n== Technique ==\nActive listening comprises several components by the listener, who must pay attention to what the speaker is attempting to communicate and elicit clarification where necessary for comprehension. \"Many studies suggest that even the smallest improvements in a person’s listening ability can have a noticeable impact on the overall effectiveness of communication and productivity.\" Developing this skill of active listening can positively impact the speakers and the listeners' mutual understanding and relationship.\nFrom the speakers perspective, listening is a multidimensional construct that includes attention, comprehension, and positive intention.\nActive listening includes further understanding and closeness between the listener and speaker. The more basic ways this is done are through paraphrasing, reflective emotion, and open-ended questions. Paraphrasing involves putting the speaker's message in one's words to demonstrate one's understanding and continue the discussion. Reflective emotion involves identifying the speaker's feelings, whether expressed or not, and responding to those feelings that will further validate the person's emotional state. On the other hand, open-ended questions permit the interviewee to expound on their responses, thus allowing deeper insight into their thoughts and experiences and encouraging a more inclusive dialogue. These skills find their real-life applications in their efficiency. For example, paraphrasing clarifies possible miscommunications by summarizing the speaker's words and verifying the accuracy. Emotion reflection helps to establish empathy with a speaker so that he/she feels appreciated and understood. Open-ended questions, such as \"What did you think of that?\" or \"Can you further explain what that felt like?\" describe ideas and feelings that deepen the conversation. Active listening skills, including but not limited to eye contact, no distractions, and clarity seeking, round out these techniques by engaging in an active, respectful, and attentive way. Only by practicing these methods can listeners create a non-threatening, meaningful space for communication.\n\n\n=== Comprehension ===\nThe first step in the active listening process is that of comprehension. Comprehension is a shared meaning between parties in communication. This can be done through top-down or bottom-up listening strategies. Top-down listening for comprehension will involve preparing for what message is likely going to be given, attempting to organize what is being communicated, and listening for summarizations or shifts in topic. Bottom-up listening for comprehension will involve an attentiveness to emphasized words such as longer or louder words. In addition, careful attention should be paid to repeated parts of the message being communicated. Attentiveness can be emphasized not just in one's ability to listen, but to listen and respond with sensitivity to particular needs or cultural norms. For example, if you are listening to someone communicate with a disability such as autism, you will need to pay close attention and forego common methods of organizing information as it is received. People with disabilities, you need to be patient with them not understanding at first. In many of today's cultures, comprehension may include a knowledge of people using neutral pronouns or preferred pronouns. In order to listen for comprehension, it will be important for a receiver to be aware and understand these cultural norms.\n\n\n=== Retaining ===\nRetaining is the second step in the process. Retaining memory is essential to the active listening process because the information retained when a person is involved in the listening process is how meaning is extracted from words, because everyone has different memories. The speaker and the listener may attach different meanings to the same statement. Memories are fallible meaning the mind can have errors in recalling information later on. Poor memory retaining techniques like cramming may cause information to be forgotten as our brains have a limited capacity to process more than one thing at a time this is more likely to not be retained. This may be due to the fact that one's brain needs more time to effectively process and retain the information given in order to successfully store it into a more solidified form of memory. Retaining information from messages being received is increased with how meaningful what is being said and using repetition so the brain can retain the information. For example, information is best retained in adults experience in what is being said over and over. Communicates back and forth with another communicator about the topic, and maintains visual contact with the source of the message being sent.\n\n\n=== Responding ===\nThere are three basic steps for responding in the following order:\n\nParaphrase: Explain what you believe has been said in your own words.\nClarify: Ensure you understand what has been said through asking questions.\nSummarize: Offer a concise overview of what you believe the main points and intent of the message received are.\nHere are the guidelines to help fine tune one's ability to follow these steps:\n\nKeep your attention on the message being presented\nRefrain from thinking about your own response to what is being presented.\nRefrain from offering judgement on anything the other person says.\nObserve non-verbal content. These are their own kind of communication which can be clarified by the active listener.\n\n\n== Barriers to active listening ==\nThere are a multitude of factors that may impede upon someone's ability to listen with purpose and intention; these factors are referred to as listening blocks.  Some examples of these blocks include rehearsing, filtering, and advising. Rehearsing is when the listener is more focused on preparing their response rather than listening. Filtering is when a listener focuses only on what they expect to hear, while tuning out other aspects of what is being said, and lastly, advising is when the listener focuses on problem solving, which can create a sense of pressure to fix what the other person is doing wrong. There are three types of barriers to effective listening: Environmental, Physiological, and Psychological.\n\n\n=== Environmental barriers ===\nEnvironmental barriers are brought about by the speaker's environment. Some examples include noises, smells, bad cell reception, and any other factors that make it difficult to hear and process information. Sometimes it is due to the language the speaker uses—such as high sounding and bombastic words that can lead to ambiguity. Other barriers include distractions, trigger words, vocabulary, and limited attention span. Environmental barriers likely can not be eliminated but they can be managed.\n\n\n=== Physiological barriers ===\nPhysiological barriers are those that are brought about by the listener's body. They can be temporary or permanent. Hearing loss and deficiencies are usually permanent boundaries. Temporary physiological barriers include headaches, earaches, hunger or fatigue of the listener. Another physiological boundary is the difference between the slow rate of most speech and the brain's ability to process that information. Typically, the brain can process around 500 words per minute while the average rate of speech for speakers is 125 words per minute. This difference make it easy for the mind to wander.\n\n\n=== Psychological barriers ===\nPsychological barriers interfere with one's willingness and mental capacity for listening. Pre-existing biases can lead to listening to someone else's argument for its weaknesses, ignoring its strengths. This can lead to a competitive advantage in a political debate, or by a journalist to provoke a strong response from an interviewee, and is known as \"ambushing\". Individuals in conflict often blindly contradict each other. On the other hand, if one finds that the other party understands, an atmosphere of cooperation can be created.\n\n\n=== Shift response ===\nShift response is a type of conversational narcissism—the tendency of listeners to turn the topic to themselves without showing sustained interest in others. A support response is the opposite of a shift response; it is an attention giving method and a cooperative effort to focus the conversational attention on the other person. Instead of being me-oriented like shift response, it is we-oriented. It is the response a competent communicator is most likely to use.\n\n\n== Overcoming listening barriers ==\nThe active listening technique is used to improve personal communications in organizations.  Listeners put aside their own emotions and ask questions and paraphrase what the speaker says to clarify and gain a better understanding of what the speaker intended to say. Distractions that interrupt the listener's attention are one of the major barriers to effective listening. These include external factors such as background noise and physical discomfort, and internal distractions, such as thoughts about other things and lack of focus. Another factor or barrier is the use and presence of technology. To continue, an additional barrier is misinterpretation of what the speaker is attempting to communicate, including assumption of motives, and \"reading between the lines\", as is premature judgment of the speaker's point, which can occur as a consequence of the listener holding onto a rigid personal opinion on the topic. This problem can be mitigated by asking the speaker what they mean when it is unclear, though this is not guaranteed to work every time.\nA strong disagreement hinders the ability to listen closely to what is being said. Eye contact and appropriate body languages are seen as important components to active listening, as they provide feedback to the speaker. The stress and intonation used by the speaker may also provide information to the listener, which is not available in the written word.\n\n\n== Applications ==\nActive listening is used in a wide variety of situations, including public interest advocacy, community organizing, tutoring, medical workers talking to patients, HIV counseling, helping suicidal persons, management, \ncounseling, and journalistic settings. In groups it may aid in reaching consensus. It may also be used in casual conversation or small talk to build understanding. Active listening plays a large role in the success of a leader. Leaders need to build trust and respect with those around them and mastering the skills of active listening will help them greatly.\nA listener can use several degrees of active listening, each resulting in a different quality of communication. These degrees include repeating to indicate attentiveness, paraphrasing to signify understanding, and reflecting to acknowledge perspective and application.\nThe proper use of active listening results in getting people to open up, avoiding misunderstandings, resolving conflict, and building trust. In a medical context, benefits may include increased patient satisfaction, improved cross-cultural communication, improved outcomes, or decreased litigation.\n\n\n=== Active listening in music ===\nActive listening has been developed as a concept in music and technology by François Pachet, researcher at Sony Computer Science Laboratory, Paris. Active listening in music refers to the idea that listeners can be given some degree of control on the music they listen to, by means of technological applications mainly based on artificial intelligence and information theory techniques, by opposition to traditional listening, in which the musical media is played passively by some neutral device\n\n\n=== Applications of active listening in healthcare and education ===\nActive listening is a critical communication skill with significant applications in both healthcare and education. In healthcare, active listening enables practitioners to understand better patients’ concerns, including unspoken fears or expectations, which can lead to improved diagnoses, treatment adherence, and patient satisfaction. According to Lang, Floyd, and Beine (2000), recognizing subtle verbal and nonverbal “clues” during patient interactions enhances communication and fosters trust between patients and healthcare providers.\nIn education, active listening is equally impactful, fostering collaboration between educators, students, and parents. McNaughton et al. (2008) developed the LAFF strategy, a structured method of active listening that includes empathetic engagement, asking open-ended questions, focusing on concerns, and identifying actionable steps. Teachers trained in this strategy have demonstrated improved communication skills and stronger relationships with parents, creating a more supportive learning environment. Feedback from parents highlights the importance of attentiveness and empathy in building trust and resolving issues effectively. These findings underscore the practical relevance of active listening in professional and educational settings.\n\n\n== Criticism ==\nA Munich-based marital therapy study conducted by Dr. Kurt Hahlweg and associates found that even after employing active listening techniques in the context of couples therapy, the typical couple was still distressed.\n\nActive listening was criticized by John Gottman's The Seven Principles for Making Marriage Work as being of limited usefulness: Active listening asks couples to perform Olympic-level emotional gymnastics when their relationship can barely walk. . . . After studying some 650 couples and tracking the fate of their marriages for up to fourteen years, we now understand that this approach to counseling doesn't work, not just because it's nearly impossible for most couples to do well, but more importantly because successful conflict resolution isn't what makes marriages succeed. One of the most startling findings of our research is that most couples who have maintained happy marriages rarely do anything that even partly resembles active listening when they're upset.\nRobert F. Scuka defends active listening by arguing that: ...a careful reading of the Hahlweg et al. (1984) study reveals that Gottman cites only certain (one-sided) results from the study. He also overlooks several important considerations that call into question his implied dismissal of the RE model as a legitimate therapeutic intervention for distressed couples.\n\n\n== See also ==\nAppreciative listening – Listening behaviour targeting media for enjoyment\nAuditory processing disorder – Developmental or acquired neurological disorders\nFour-sides model – Communication theory model\nInformational listening – Listening focused on understanding a message\nNonviolent Communication – Communication process intended to increase empathy\nReflective listening – Communication strategy\nWorkplace listening – Active listening in a professional environment\n\n\n== References ==\n\n\n== Further reading ==\nArnold, Kyle (24 October 2014). \"Behind the Mirror: Reflective Listening and Its Tain in the Work of Carl Rogers Archived 2017-03-13 at the Wayback Machine\". The Humanistic Psychologist. 42:4, 354–69. doi:10.1080/08873267.2014.913247.\nZenger, Jack, and Folkman, Joseph (14 July 2016). \"What Great Listeners Actually Do\". Listening Skills. Harvard Business Review.\n\n\n== External links ==\nListening is powerful medicine, Weekend Edition Sunday, National Public Radio February 2009\nActive Listening International Online Training Program On Intractable Conflict: Conflict Research Consortium, University of Colorado\nEmpathic listening skills How to listen so others feel heard, or listening first aid (University of California). Download a one-hour seminar on empathic listening and attending skills.\nExercise 4 – Active Listening, Center for Rural Studies, University of Vermont, Montpelier\nActive listening: A communication tool",
  "links": {
    "Active Listening": "",
    "Ambiguity": "",
    "Appreciative listening": "",
    "Artificial intelligence": "",
    "Auditory processing disorder": "",
    "Carl Rogers": "",
    "Communication": "",
    "Consensus decision-making": "",
    "Contradict": "",
    "Conversation": ""
  },
  "url": "https://en.wikipedia.org/wiki/Active_listening"
}