{
  "title": "Addiction-related structural neuroplasticity",
  "content": "Addiction is a state characterized by compulsive engagement in rewarding stimuli, despite adverse consequences. The process of developing an addiction occurs through instrumental learning, which is otherwise known as operant conditioning.\nNeuroscientists believe that drug addicts’ behavior is a direct correlation to some physiological change in their brain, caused by using drugs. This view believes there is a bodily function in the brain causing the addiction. This is brought on by a change in the brain caused by brain damage or adaptation from chronic drug use.\nIn humans, addiction is diagnosed according to diagnostic models such as the Diagnostic and Statistical Manual of Mental Disorders, through observed behaviors. There has been significant advancement in understanding the structural changes that occur in parts of the brain involved in the reward pathway (mesolimbic system) that underlies addiction. Most research has focused on two portions of the brain: the ventral tegmental area, (VTA) and the nucleus accumbens (NAc).\nThe VTA is the portion of the mesolimbic system responsible for spreading dopamine to the whole system. The VTA is stimulated by ″rewarding experiences″. The release of dopamine by the VTA induces pleasure, thus reinforcing behaviors that lead to the reward. Drugs of abuse increase the VTA's ability to project dopamine to the rest of the reward circuit. These structural changes only last 7–10 days, however, indicating that the VTA cannot be the only part of the brain that is affected by drug use, and changed during the development of addiction.\nThe nucleus accumbens (NAc) plays an essential part in the formation of addiction. Almost every drug with addictive potential induces the release of dopamine into the NAc. In contrast to the VTA, the NAc shows long-term structural changes. Drugs of abuse weaken the connections within the NAc after habitual use, as well as after use then withdrawal.\n\n\n== Structural changes of learning ==\nLearning by experience occurs through modifications of the structural circuits of the brain. These circuits are composed of many neurons and their connections, called synapses, which occur between the axon of one neuron and the dendrite of another. A single neuron generally has many dendrites which are called dendritic branches, each of which can be synapsed by many axons.\nAlong dendritic branches there can be hundreds or even thousands of dendritic spines, structural protrusions that are sites of excitatory synapses. These spines increase the number of axons from which the dendrite can receive information. Dendritic spines are very plastic, meaning they can be formed and eliminated very quickly, in the order of a few hours. More spines grow on a dendrite when it is repetitively activated. Dendritic spine changes have been correlated with long-term potentiation (LTP) and long-term depression (LTD).\nLTP is the way that connections between neurons and synapses are strengthened. LTD is the process by which synapses are weakened. For LTP to occur, NMDA receptors on the dendritic spine send intracellular signals to increase the number of AMPA receptors on the post synaptic neuron. If a spine is stabilized by repeated activation, the spine becomes mushroom shaped and acquires many more AMPA receptors. This structural change, which is the basis of LTP, persists for months and may be an explanation for some of the long-term behavioral changes that are associated with learned behaviors including addiction to drugs.\n\n\n== Research methodologies ==\n\n\n=== Animal models ===\nAnimal models, especially rats and mice, are used for many types of biological research. The animal models of addiction are particularly useful because animals that are addicted to a substance show behaviors similar to human addicts. This implies that the structural changes that can be observed after the animal ingests a drug can be correlated with an animal's behavioral changes, as well as with similar changes occurring in humans.\n\n\n=== Administration protocols ===\nAdministration of drugs that are often abused can be done either by the experimenter (non-contingent), or by a self-administration (contingent) method. The latter usually involves the animal pressing a lever to receive a drug. Non-contingent models are generally used for convenience, being useful for examining the pharmacological and structural effects of the drugs. Contingent methods are more realistic because the animal controls when and how much of the drug it receives. This is generally considered a better method for studying the behaviors associated with addiction. Contingent administration of drugs has been shown to produce larger structural changes in certain parts of the brain, in comparison to non-contingent administration.\n\n\n=== Types of drugs ===\nAll abused drugs directly or indirectly promote dopamine signaling in the mesolimbic dopamine neurons which project from the ventral tegmental area to the nucleus accumbens (NAc). The types of drugs used in experimentation increase this dopamine release through different mechanisms.\n\n\n==== Opiates ====\nOpiates are a class of sedative with the capacity for pain relief. Morphine is an opiate that is commonly used in animal testing of addiction. Opiates stimulate dopamine neurons in the brain indirectly by inhibiting GABA release from modulatory interneurons that synapse onto the dopamine neurons. GABA is an inhibitory neurotransmitter that decreases the probability that the target neuron will send a subsequent signal.\n\n\n==== Stimulants ====\nStimulants used regularly in neuroscience experimentation are cocaine and amphetamine. These drugs induce an increase in synaptic dopamine by inhibiting the reuptake of dopamine from the synaptic cleft, effectively increasing the amount of dopamine that reaches the target neuron.\n\n\n== The reward pathway ==\nThe reward pathway, also called the mesolimbic system of the brain, is the part of the brain that registers reward and pleasure. This circuit reinforces the behavior that leads to a positive and pleasurable outcome. In drug addiction, the drug-seeking behaviors become reinforced by the rush of dopamine that follows the administration of a drug of abuse. The effects of drugs of abuse on the ventral tegmental area (VTA) and the nucleus accumbens (NAc) have been studied extensively.\nDrugs of abuse change the complexity of dendritic branching as well as the number and size of the branches in both the VTA and the NAc. [7] By correlation, these structural changes have been linked to addictive behaviors. The effect of these structural changes on behavior is uncertain and studies have produced conflicting results. Two studies have shown that an increase in dendritic spine density due to cocaine exposure facilitates behavioral sensitization, while two other studies produce contradicting evidence.\nIn response to drugs of abuse, structural changes can be observed in the size of neurons and the shape and number of the synapses between them. The nature of the structural changes is specific to the type of drug used in the experiment. Opiates and stimulants produce opposite effects in structural plasticity in the reward pathway. It is not expected that these drugs would induce opposing structural changes in the brain because these two classes of drugs, opiates and stimulants, both cause similar behavioral phenotypes.\nBoth of these drugs induce increased locomotor activity acutely, escalated self-administration chronically, and dysphoria when the drug is taken away. Although their effects on structural plasticity are opposite, there are two possible explanations as to why these drugs still produce the same indicators of addiction: Either these changes produce the same behavioral phenotype when any change from baseline is produced, or the critical changes that cause the addictive behavior cannot be quantified by measuring dendritic spine density.\nOpiates decrease spine density and dendrite complexity in the nucleus accumbens (NAc). Morphine decreases spine density regardless of the treatment paradigm (with one exception: \"chronic morphine increases spine number on orbitofrontal cortex (oPFC) pyramidal neurons\"). Either chronic or intermittent administration of morphine will produce the same effect. The only case where opiates increase dendritic density is with chronic morphine exposure, which increases spine density on pyramidal neurons in the orbitofrontal cortex. Stimulants increase spinal density and dendritic complexity in the nucleus accumbens (NAc), ventral tegmental area (VTA), and other structures in the reward circuit.\n\n\n=== Ventral tegmental area ===\n\nThere are neurons with cell bodies in the VTA that release dopamine onto specific parts of the brain, including many of the limbic regions such as the NAc, the medial prefrontal cortex (mPFC), dorsal striatum, amygdala, and the hippocampus. The VTA has both dopaminergic and GABAergic neurons that both project to the NAc and mPFC. GABAergic neurons in the VTA also synapse on local dopamine cells. In non-drug models, the VTA dopamine neurons are stimulated by rewarding experiences. A release of dopamine from the VTA neurons seems to be the driving action behind drug-induced pleasure and reward.\nExposure to drugs of abuse elicits LTP at excitatory synapses on VTA dopamine neurons. Excitatory synapses in brain slices from the VTA taken 24 hours after a single cocaine exposure showed an increase in AMPA receptors in comparison to a saline control. Additional LTP could not be induced in these synapses. This is thought to be because the maximal amount of LTP had already been induced by the administration of cocaine. LTP is only seen on the dopamine neurons, not on neighboring GABAergic neurons. This is of interest because the administration of drugs of abuse increases the excitation of VTA dopamine neurons, but does not increase inhibition. Excitatory inputs into the VTA will activate the dopamine neurons 200%, but do not increase activation of GABA neurons which are important in local inhibition.\nThis effect of inducing LTP in VTA slices 24 hours after drug exposure has been shown using morphine, nicotine, ethanol, cocaine, and amphetamines. These drugs have very little in common except that they are all potentially addictive. This is evidence supporting a link between structural changes in the VTA and the development of addiction.\nChanges other than LTP have been observed in the VTA after treatment with drugs of abuse. For example, neuronal body size decreased in response to opiates.\nAlthough the structural changes in the VTA invoked by exposure to an addictive drug generally disappear after a week or two, the target regions of the VTA, including the NAc, may be where the longer-term changes associated with addiction occur during the development of the addiction.\n\n\n=== Nucleus accumbens ===\n\nThe nucleus accumbens plays an integral role in addiction. Almost every addictive drug of abuse induces the release of dopamine into the nucleus accumbens. The NAc is particularly important for instrumental learning, including cue-induced reinstatement of drug-seeking behavior. It is also involved in mediating the initial reinforcing effects of addictive drugs. The most common cell type in the NAc is the GABAergic medium spiny neuron. These neurons project inhibitory connections to the VTA and receive excitatory input from various other structures in the limbic system. Changes in the excitatory synaptic inputs into these neurons have been shown to be important in mediating addiction-related behaviors. It has been shown that LTP and LTD occurs at NAc excitatory synapses.\nUnlike the VTA, a single dose of cocaine induces no change in potentiation in the excitatory synapses of the NAc. LTD was observed in the medium spiny neurons in the NAc following two different protocols: a daily cocaine administration for five days or a single dose followed by 10–14 days of withdrawal. This suggests that the structural changes in the NAc are associated with long-term behaviors (rather than acute responses) associated with addiction such as drug seeking.\n\n\n== Human relevance ==\n\n\n=== Relapse ===\nNeuroscientists studying addiction define relapse as the reinstatement of drug-seeking behavior after a period of abstinence. The structural changes in the VTA are hypothesized to contribute to relapse. As the molecular mechanisms of relapse are better understood, pharmacological treatments to prevent relapse are further refined.\nRisk of relapse is a serious and long-term problem for recovering addicts. An addict can be forced to abstain from using drugs while they are admitted in a treatment clinic, but once they leave the clinic they are at risk of relapse. Relapse can be triggered by stress, cues associated with past drug use, or re-exposure to the substance. Animal models of relapse can be triggered in the same way.\n\n\n=== Search for a cure for addiction ===\nThe goal of addiction research is to find ways to prevent and reverse the effects of addiction on the brain. Theoretically, if the structural changes in the brain associated with addiction can be blocked, then the negative behaviors associated with the disease should never develop.\nStructural changes associated with addiction can be inhibited by NMDA receptor antagonists which block the activity of NMDA receptors. NMDA receptors are essential in the process of LTP and LTD. Drugs of this class are unlikely candidates for pharmacological prevention of addiction because these drugs themselves are used recreationally. Examples of NMDAR antagonists are ketamine, dextromethorphan (DXM), phencyclidine (PCP).\n\n\n== References ==",
  "links": {
    "AMPA receptor": "",
    "Addiction": "",
    "Amygdala": "",
    "Behavioral plasticity": "",
    "Behavioral sensitization": "",
    "Bennett Foddy": "",
    "Bibcode (identifier)": "",
    "CAMP response element-binding protein": "",
    "Compulsive behavior": "",
    "Conditioned place preference": ""
  },
  "url": "https://en.wikipedia.org/wiki/Addiction-related_structural_neuroplasticity"
}