{
  "title": "Affectional bond",
  "content": "In psychology, an affectional bond is a type of attachment behavior one individual has for another individual, typically a caregiver for their child, in which the two partners tend to remain in proximity to one another. The term was coined and subsequently developed over the course of four decades, from the early 1940s to the late 1970s, by psychologist John Bowlby in his work on attachment theory. The core of the term affectional bond, according to Bowlby, is the attraction one individual has for another individual. The central features of the concept of affectional bonding can be traced to Bowlby's 1958 paper, \"The Nature of the Child's Tie to his Mother\".\n\n\n== Five criteria ==\nBowlby referred to attachment bonds as a specific type of \"affectional\" bond, as described by him and developmental psychologist Mary Ainsworth. She established five criteria for affectional bonds between individuals, and a sixth criterion for attachment bonds:\n\nAn affectional bond is persistent, not transitory.\nAn affectional bond involves a particular person who is not interchangeable with anyone else.\nAn affectional bond involves a relationship that is emotionally significant.\nThe individual wishes to maintain proximity or contact with the person with whom they have an affectional tie.\nThe individual feels sadness or distress at involuntary separation from the person.\n(Attachment bond) The individual feels lonely & can not form other long lasting relationships & friendships.\nAn attachment bond has an additional criterion: the person seeks security and comfort in the relationship.\n\n\n== Attachment theory ==\n\n\n=== Background ===\nBowlby believed that there were four distinguishing characteristics of attachment. These included:\n\nProximity Maintenance: The desire to be near the people we are attached to.\nSafe Haven: Returning to the attachment figure for comfort and safety in the face of fear or threat.\nSecure Base: The attachment figure acts as a base of security from which the child can explore the surrounding environment.\nSeparation Distress: Anxiety that occurs in the absence of the attachment figure.\nBowlby's thoughts on distinguishing attachment led the way for many other psychologists' viewpoints on attachment and the various bonds that attachment coincides with.\n\n\n== Attachment through the lifespan ==\n\n\n=== Attachment style ===\nChild psychologist Mary Ainsworth further expanded on Bowlby's research by conducting an experiment that is known as the \"Strange Situation\" experiment. In the experiment, a parent and child are alone in the room. A stranger then walks into the room and talks to the parent. After some amount of time, the parent quietly exits the room, leaving the stranger and child in the room. The child then reacts to the situation at hand and then the parent re-enters the room and comforts the child. From this groundbreaking study, Ainsworth developed different forms of attachment styles that infants display with the people they are close to.\n\n\n==== Secure attachment ====\nSecure attachment in infancy was characterized by noticeable distress when the parent left the room. When the parent returned, the child was extremely happy to see them. Infants are more likely to choose a parent over any other person, especially a stranger. As they embark on childhood, those who maintain secure attachment have an easier time making friends and meeting new people and hold a trustworthy bond with their parents. Adolescents benefit from parental support, but they are also beginning to make the transitions from relying heavily on their parents to a more independent environment with more freedom. In adulthood, they are more likely to have long-lasting relationships, high self-esteem, find pleasure from romantic relationships and are able to easily talk with their partners.\n\n\n==== Ambivalent-insecure attachment ====\nAmbivalent attachment is characterized by a strong wariness towards strangers. Children get extremely uncomfortable when they do not have a noticeable face in the room. When the parent returns, the child receives no comfort from their return and is inconsolable. In childhood, these children tend to act \"clingy\" towards their parents and tend to heavily rely on others. In adulthood, they have difficulty with trust and feel that their partner does not exhibit the same feelings towards them. Insecurely attached adults tend to act cold and experience many break-ups throughout their life.\n\n\n==== Avoidant-insecure attachment ====\nInfants and children with avoidant attachment tend to show no preference between their caregivers and the stranger. They do not actively seek much comfort of contact from their parents and usually tend to avoid them. In adulthood, those with avoidant attachment have difficulty maintaining relationships due to the inability to display emotions. They are more likely to engage in casual sex and think about other people or things while they are having sex. Finally, they are not likely to be supportive when other people are in stressful situations and have an inability to look at ideas in another person's perspective.\n\n\n==== Disorganized-insecure attachment ====\nDisorganized attachment in infants tends to display avoidant and unsure behavior. They tend to be in a daze and seem confused about the situation that they are in. They tend not show any clear signs of attachment at any point in their lives.\nThis fourth form of attachment was observed in later studies conducted by Main and Solomon. Numerous studies have supported Ainsworth's observations. These studies have also shown that attachment styles developed in infancy can influence behavior later in life. Children in this group tend to take on a parental role and act like a caregiver toward their parent. They display an overall inconsistent form of behavior. Research by Main and Hesse showed that parents who use tactics of fear and assurance contribute to this disorganized form of attachment.\n\n\n=== Goal corrected partnership ===\nAccording to Bowlby's ideas of attachment, goal-corrected partnership is the last stage that a child experiences. It usually happens around age three. As the child begins spending more time with their caregiver, they begin to realize that their caregiver has goals and ideas of their own that may not concern the child. Because of this, the child begins to \"mold their behavior in order to please or impress the caregiver\". This type of bond is most likely to occur between the infant and the mother.\n\n\n== Caregivers ==\nCaregivers play an important role in children's lives for several reasons. It is important for the child to have an affectional bond with the person who is caring for that child. According to Bowlby, caregivers can be anyone who is caring for the child but is usually the mother or father of that child. Children place a high value on their relationship with their parents and will alter their behavior to meet the desired behavior from their parents. Bowlby explains by the time the child has reached twelve months of age the child has developed a strong relationship with his mother.  Freud who is cited in Bowlby's article \"The Nature of the Child's Tie to his Mother\" says that a child's first love is a satisfaction of the need for food and an object for food, so either the mother's breast or bottle of milk.\nBowlby has four theories that explain how the attachment and bond are created between a child and their caregiver.\n\nSecondary drive: When the physiological needs of the child are met, for example when the child needs are met by the mother feeding or keeping her child warm.\nPrimary object sucking: Infants have an innate quality that needs to be filled by sucking on the mother's breast which he realized is connected to his mother, therefore creating a stronger bond.\nPrimary object clinging: Besides food as a primary need, the feel or touch of another human is also a primary need for infants so they cling to their parents to meet this need.\nPrimary return-to-womb craving: Infants crave to go back inside their mother's womb.\n\n\n== Other affectional bonds through the lifespan ==\n\n\n=== Mother to infant ===\nThe bond between mothers and infants has been determined to be the core bond during the lifespan for mothers and children.  At birth, mothers go through a postpartum period where they feel detached from their infant and need to create a new bond different from the one that was created during the prenatal period.  The bond between mother and infant is just as important to the mother as it is to the infant.  This bond can be formed after the once believed critical period of postpartum skin contact.  This first emotional bond is the basis of all future relationships and bonds in the child's future.\n\n\n=== Father to child ===\nThe bond between father and child has been found to be more important than previously believed, however it has not been found to be as important as the bond between mother and child.  Children do bond with fathers as a caregiver but the level of the strength of the bond is dependent upon the level of involvement by the father.  However, there is not sufficient research on the subject to draw any other conclusions on the bond and on father's involvement.\n\n\n=== Older couples' display of affection ===\nOlder couples' deep displays of bonding stem from the sheer longevity of their relationship. Having shared many lifetimes' worth of experiences together, they have built a solid foundation based on trust, mutual understanding, and acceptance. This bond became unbreakable over the years as they weathered life's challenges side by side.\n\n\n=== Sexual partnership ===\nThe bond between sexual partners is characterized with three components which are reproductive, attachment and caregiver, and they may be more prevalent in certain relationships than in others.  In some sexual partnerships there is only a reproductive component, with no emotional attachment.  When an attachment is formed on top of the reproductive bond, the male is likely to take on a caregiver role with offspring as well as his mate; which in western culture is usually his wife.  In western culture the pair often exchanges levels of care, and attachment throughout the lifespan.  In traditional married couples the level of sexual attachment changes throughout the lifespan of the relationship thus stating that there are other important aspects of the bond between husband and wife.  Couples share an emotional and intellectual bond on top of the sexual one. In western society traditional gender roles are being challenged which is impacting the level of male caregiver attachment to his wife; however there is not a large field of research on the subject.\nNon-heterosexual couples are hypothesized to share much of the same attachment components; however there is little research on the subject to draw conclusions from.\n\n\n=== Friends, companions, intimates ===\nThe bond formed between friends, companions and intimates are essential bonds to the lifetime.  These bonds are essential for social development because they differ from the bonds formed with parents and other kin.  Humans are naturally social creatures thus forming bonds with other people comes naturally.  These relationships are often formed through common interests, and proximity.  Friendships begin in early childhood, and last throughout adulthood.  Many different friendships are formed throughout the lifespan and they can be any length of time.  Again, these bonds tend to not be as strong as those formed with other kin, but the social aspects of them are essential to development.\n\n\n=== Siblings and other kin ===\nThe bond between siblings and other kin is largely dependent upon the age of the kin, and the level of involvement with the child.  Older siblings can take on more of a parental role with younger siblings thus creating more of a parental bond.  This parental bond is found when a parent dies, or when the level of parental involvement is low, however this area of research is still fairly new.  Siblings that are close in age often have more of a friendship bond.  Siblings can also have a different type of bond that is not seen in other relationships because siblings have a close bond but may have more indecisive feelings towards each other.\nThe bond between other kin is largely dependent on the society that the child grows up in.  In more collectivist cultures the bond between kin is stronger than in the individualistic ones.  The level of bond between kin is often because of shared values, culture, background, and personal experiences.  There is little research on this subject thus the level of information is still low.\n\n\n== Harlow's attachment in non-human animals ==\nAttachment is not something that is only limited to humans, it is seen in non-human animals as well. A classic study demonstrating attachment in animals was done by Harry Harlow with his macaque monkeys. His study suggests that an infant not only feels attachment to their mother because of needs for nutrients and protection, but they feel attachment to their mother for needs of comfort as well.\nIn Harry Harlow's experiment he separated infant monkeys from their mothers 6–12 hours after birth and raised them in a laboratory, isolated from humans and other monkeys. In each cage these infant monkeys had two \"mothers.\" One mother was made solely from wire, and the other mother was made from a block of wood and sponge rubber which was then wrapped with terry cloth; both radiated heat. In one condition only the wire mother nursed, and in the other condition only the terry cloth mother nursed.\nThe results show that infant monkeys spent significantly more time with the terry cloth mother whether she provided nutrients or not. This demonstrates that infants not only need their mothers to provide food and protection, but they need to provide some sort of comfort as well.\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\nUniversality of Human Social Attachment as an Adaptive Process",
  "links": {
    "Accident-proneness": "",
    "Adaptationism": "",
    "Affect (psychology)": "",
    "Affect display": "",
    "Affective neuroscience": "",
    "Age disparity in sexual relationships": "",
    "Aggression": "",
    "Altruism (biology)": "",
    "Arachnophobia": "",
    "Attachment-based psychotherapy": ""
  },
  "url": "https://en.wikipedia.org/wiki/Affectional_bond"
}