{
  "title": "The arts",
  "content": "The arts or creative arts are a vast range of human practices of creative expression, storytelling, and cultural participation. The arts encompass diverse and plural modes of thinking, doing, and being in an extensive range of media. Both dynamic and a characteristically constant feature of human life have developed into stylized and intricate forms. This is achieved through sustained and deliberate study, training, or theorizing within a particular tradition, generations, and even between civilizations. The arts are a vehicle through which human beings cultivate distinct social, cultural, and individual identities while transmitting values, impressions, judgements, ideas, visions, spiritual meanings, patterns of life, and experiences across time and space.\nProminent examples of the arts include: visual arts (including architecture, ceramics, drawing, filmmaking, painting, photography, and sculpting), literary arts (including fiction, drama, poetry, and prose), and performing arts (including dance, music, and theatre). They can employ skill and imagination to produce objects and performances, convey insights and experiences, and construct new environments and spaces.\nThe arts can refer to common, popular, or everyday practices as well as more sophisticated, systematic, or institutionalized ones. They can be discrete and self-contained or combine and interweave with other art forms, such as combining artwork with the written word in comics. They can also develop or contribute to some particular aspect of a more complex art form, as in cinematography. By definition, the arts themselves are open to being continually redefined. The practice of modern art, for example, is a testament to the shifting boundaries, improvisation and experimentation, reflexive nature, and self-criticism or questioning that art and its conditions of production, reception, and possibility can undergo.\nAs both a means of developing capacities of attention and sensitivity and ends in themselves, the arts can simultaneously be a form of response to the world. It is a way to transform our responses and what we deem worthwhile goals or pursuits. From prehistoric cave paintings to ancient and contemporary forms of ritual to modern-day films, art has served to register, embody, and preserve our ever-shifting relationships with each other and the world.\n\n\n== Definition ==\n\nThe arts are considered various practices or objects done by people with skill, creativity, and imagination across cultures and history, viewed as a group. These activities include painting, sculpture, music, theatre, literature, and more. Art refers to the way of doing or applying human creative skills, typically in visual form.\n\n\n== History and classifications ==\n\nIn Ancient Greece, art and craft were referred to by the word techne. Ancient Greek art brought the veneration of the animal form and the development of equivalent skills to show musculature, poise, beauty, and anatomically correct proportions. Ancient Roman art depicted gods as idealized humans, shown with characteristic distinguishing features, e.g. Zeus' thunderbolt. In Byzantine and Gothic art of the Middle Ages, the dominant church insisted on the expression of Christian themes due to the overlap of church and state. Eastern art has generally worked in style akin to Western medieval art, namely a concentration on surface patterning and local colour (meaning the plain colour of an object, such as basic red for a red robe, rather than the modulations of that colour brought about by light, shade, and reflection). A characteristic of this style is that local colour is defined by an outline (a contemporary equivalent is the cartoon). This is evident, for example, in the art of India, Tibet, and Japan. Islamic art avoids the representation of living beings, particularly humans and other animals, in religious contexts. It instead expresses religious ideas through calligraphy and geometrical designs.\n\n\n=== Classifications ===\n\nIn the Middle Ages, liberal arts were taught in European universities as part of the Trivium, an introductory curriculum involving grammar, rhetoric, and logic, and of the Quadrivium, a curriculum involving the \"mathematical arts\" of arithmetic, geometry, music, and astronomy. In modern academia, the arts can be grouped with, or as a subset of, the humanities.\nThe arts have been classified as seven: painting, architecture, sculpture, literature, music, performing, and cinema. Some view literature, painting, sculpture, and music as the central four arts, of which the others are derivative; drama is literature with acting, dance is music expressed through motion, and song is music with literature and voice. Film is sometimes called the \"eighth\" and comics the \"ninth art\" in Francophone scholarship, adding to the traditional \"Seven Arts\". Cultural fields like gastronomy are only sometimes considered as arts.\n\n\n== Visual arts ==\n\n\n=== Architecture ===\n\nArchitecture is the art and science of designing buildings and structures. A wider definition would include the design of the built environment, from the macro level of urban planning, urban design, and landscape architecture, to the micro level of creating furniture. The word architecture comes from the Latin architectūra, from architectus \"master builder, director of works.\" Architectural design usually must address feasibility and cost for the builder, as well as function and aesthetics for the user.\nIn modern usage, architecture is the art and discipline of creating or inferring an implied or apparent plan for a complex object or system. Some types of architecture manipulate space, volume, texture, light, shadow, or abstract elements, to achieve pleasing aesthetics. Architectural works may be seen as cultural and political symbols, or works of art. The role of the architect, though changing, has been central to the design and implementation of pleasingly built environments, in which people live.\n\n\n=== Ceramics ===\n\nCeramic art is art made from ceramic materials (including clay), which may take forms such as pottery, tile, figurines, sculpture, and tableware. While some ceramic products are considered fine art, others are considered decorative, industrial, or applied art objects. Ceramics may also be considered artefacts in archaeology. Ceramic art can be made by one person or by a group of people. In a pottery or ceramic factory, a group of people design, manufacture, and decorate the pottery. Some pottery is regarded as art pottery. In a one-person pottery studio, ceramists or potters produce studio pottery. Ceramics excludes glass and mosaics made from glass tesserae.\n\n\n=== Conceptual art ===\n\nConceptual art is art wherein the concept(s) or idea(s) involved in the work take precedence over traditional aesthetic and material concerns.\nThe inception of the term in the 1960s referred to a strict and focused practice of idea-based art that defied traditional visual criteria associated with the visual arts in its presentation as text. Through its association with the Young British Artists and the Turner Prize during the 1990s, its popular usage, particularly in the United Kingdom, developed as a synonym for all contemporary art that does not practice the traditional skills of painting and sculpture.\n\n\n=== Drawing ===\n\nDrawing is a means of making an image using any of a wide variety of tools and techniques. It generally involves making marks on a surface by applying pressure from a tool, or moving a tool across a surface. Common tools are graphite pencils, pen and ink, inked brushes, wax coloured pencils, crayons, charcoals, pastels, and markers. Digital tools with similar effects are also used. The main techniques used in drawing are line drawing, hatching, cross-hatching, random hatching, scribbling, stippling, and blending. An artist who excels in drawing is referred to as a drafter, draftswoman, or draughtsman. Drawing can be used to create art used in cultural industries such as illustrations, comics, and animation. Comics are often called the \"ninth art\" (le neuvième art) in Francophone scholarship, adding to the traditional \"Seven Arts\".\n\n\n=== Painting ===\n\nPainting is considered to be a form of self-expression. Drawing, gesture (as in gestural painting), composition, narration (as in narrative art), or abstraction (as in abstract art), among other aesthetic modes, may serve to manifest the expressive and conceptual intention of the practitioner. Paintings can be a wide variety of topics, such as photographic, abstract, narrative, symbolistic (Symbolist art), emotive (Expressionism), or political in nature (Artivism). Some modern painters incorporate different materials, such as sand, cement, straw, wood, or strands of hair, for their artwork texture. Examples of this are the works of Jean Dubuffet or Anselm Kiefer.\n\n\n=== Photography ===\n\nPhotography as an art form refers to photographs that are created in accordance with the creative vision of the photographer. Art photography stands in contrast to photojournalism, which provides a visual account of news events, and commercial photography, the primary focus of which is to advertise products or services.\n\n\n=== Sculpture ===\n\nSculpture is the branch of the visual arts that operates in three dimensions. It is one of the plastic arts. Durable sculptural processes originally used carving (the removal of material) and modelling (the addition of material, such as clay), in stone, metal, ceramics, wood, and other materials, but shifts in sculptural processes have led to almost complete freedom of materials and processes following modernism. A wide variety of materials may be worked by removal such as carving, assembled by welding or modelling, or moulded or cast.\n\n\n== Literary arts ==\n\nLiterature (also known as literary arts or language arts) is literally \"acquaintance with letters\", as in the first sense given in the Oxford English Dictionary. The noun \"literature\" comes from the Latin word littera, meaning \"an individual written character (letter).\" The term has generally come to identify a collection of writings, which in Western culture are mainly prose (both fiction and non-fiction), drama, and poetry. In much, if not all, of the world, artistic linguistic expression can be oral as well and include such genres as epic, legend, myth, ballad, other forms of oral poetry, and folktales. Comics, the combination of drawings or other visual arts with narrating literature, are called the \"ninth art\" (le neuvième art) in Francophone scholarship.\n\n\n== Performing arts ==\n\nPerforming arts comprise dance, music, theatre, opera, mime, and other art forms in which human performance is the principal product. Performing arts are distinguished by this performance element in contrast with disciplines such as visual and literary arts, where the product is an object that does not require a performance to be observed and experienced. Each discipline in the performing arts is temporal in nature, meaning the product is performed over a period of time. Products are broadly categorized as being either repeatable (for example, by script or score) or improvised for each performance. Artists who participate in these arts in front of an audience are called performers, including actors, magicians, comedians, dancers, musicians, and singers. Performing arts are also supported by the services of other artists or essential workers, such as songwriting and stagecraft. Performers adapt their appearance with tools such as costumes and stage makeup.\n\n\n=== Dance ===\n\nDance generally refers to human movement, either used as a form of expression or presented in a social, spiritual, or performance setting. Choreography is the art of making dances, and the person who does this is called a choreographer. Definitions of what constitutes dance are dependent on social, cultural, aesthetic, artistic, and moral constraints and range from functional movement (such as folk dance) to codified virtuoso techniques such as ballet. In sports: gymnastics, figure skating, and synchronized swimming are dance disciplines. In martial arts, \"kata\" is compared to dances.\n\n\n=== Music ===\n\nMusic is defined as an art form whose medium is a combination of sounds. Though scholars agree that music generally consists of a few core elements, their exact definitions are debated. Commonly identified aspects include pitch (which governs melody and harmony), duration (including rhythm and tempo), intensity (including dynamics), and timbre. Though considered a cultural universal, definitions of music vary wildly throughout the world as they are based on diverse views of nature, the supernatural, and humanity. Music is differentiated into composition and performance, while musical improvisation may be regarded as an intermediary tradition. Music can be divided into genres and subgenres, although the dividing lines and relationships between genres are subtle, open to individual interpretation, and controversial.\n\n\n=== Theatre ===\n\nTheatre or theater (from Greek theatron (θέατρον); from theasthai, \"behold\") is the branch of the performing arts concerned with acting out stories in front of an audience using combinations of speech, gesture, music, dance, sound, and spectacle. In addition to the standard narrative dialogue style, theatre takes such forms as opera, ballet, mime, kabuki, classical Indian dance, and Chinese opera.\n\n\n== Multidisciplinary artistic works ==\nAreas exist in which artistic works incorporate multiple artistic fields, such as film, opera, and performance art. While opera is often categorized as the performing arts of music, the word itself is Italian for \"works\", because opera combines artistic disciplines into a singular artistic experience. In a traditional opera, the work uses the following: the sets, costumes, acting, the libretto, singers and an orchestra.\n\nThe composer Richard Wagner recognized the fusion of so many disciplines into a single work of opera, exemplified by his cycle Der Ring des Nibelungen (\"The Ring of the Nibelung\"). He did not use the term opera for his works, but instead Gesamtkunstwerk (\"synthesis of the arts\"), sometimes referred to as \"music drama\" in English, emphasizing the literary and theatrical components, which were as important as the music. Classical ballet is another form that emerged in the 17th century in which orchestral music is combined with dance.\nOther works in the late 19th, 20th, and 21st centuries have fused other disciplines in creative ways, such as performance art. Performance art is a performance over time that combines any number of instruments, objects, and art within a predefined or less well-defined structure, some of which can be improvised. Performance art may be scripted, unscripted, random, or carefully organized—even audience participation may occur. John Cage is regarded by many as a performance artist rather than a composer, although he preferred the latter term. He did not compose for traditional ensembles. Cage's composition Living Room Music, composed in 1940, is a quartet for unspecified instruments, really non-melodic objects, that can be found in the living room of a typical house, hence the title.\n\n\n== Other arts ==\n\n\n=== Applied arts ===\n\nThe applied arts are the application of design and decoration to everyday, functional objects to make them aesthetically pleasing. The applied arts include fields such as industrial design, illustration, and commercial art. The term \"applied art\" is used in distinction to the fine arts, where the latter is defined as arts that aim to produce objects that are beautiful or provide intellectual stimulation but have no primary everyday function. In practice, the two often overlap.\n\n\n=== Video games ===\n\nVideo games are multidisciplinary works that include non-controversially artistic elements such as visuals and sound, as well as an emergent experience from the nature of their interactivity.  Within the video game community, debates surround whether video games should be classified as an art form and whether game developers—AAA or indie—should be classified as artists. Hideo Kojima, a video game designer considered a gaming auteur, argued in 2006 that video games are a type of service rather than an art form. In the social sciences, cultural economists show how playing video games is conducive to involvement in more traditional art forms. In 2011, the National Endowment of the Arts included video games in its definition of a \"work of art\", and the Smithsonian American Art Museum presented an exhibit titled The Art of the Video Game in 2012.\n\n\n== Arts critique ==\n\nArt criticism is the discussion or evaluation of art. Art critics usually criticize art in the context of aesthetics or the theory of beauty. A goal of art criticism is the pursuit of a rational basis for art appreciation but it is questionable whether such criticism can transcend prevailing sociopolitical circumstances.\nThe variety of artistic movements has resulted in a division of art criticism into different disciplines, which may each use different criteria for their judgements. The most common division in the field of criticism is between historical criticism and evaluation, a form of art history, and contemporary criticism of work by living artists.\nDespite perceptions that criticism is a lower-risk activity than making art, opinions of current art are liable to corrections with the passage of time. Critics of the past can be ridiculed for dismissing artists now venerated (like the early work of the Impressionists). Some art movements themselves were named disparagingly by critics, with the name later adopted as a badge of honour by the artists of the style with the original negative meaning forgotten, e.g. Impressionism and Cubism. Artists have had an uneasy relationship with their critics. Artists usually need positive opinions from critics for their work to be viewed and purchased.\nMany variables determine judgement of art such as aesthetics, cognition or perception. Aesthetic, pragmatic, expressive, formalist, relativist, processional, imitation, ritual, cognition, mimetic, and postmodern theories, are some of the many theories to criticize and appreciate art. Art criticism and appreciation can be subjective based on personal preference toward aesthetics and form, or on the elements and principles of design and by social and cultural acceptance.\n\n\n== Education ==\n\nArts in education is a field of educational research and practice informed by investigations into learning through arts experiences. In this context, the arts can include performing arts education (dance, drama, music), literature and poetry, storytelling, visual arts education in film, craft, design, digital art, media and photography.\n\n\n== Politics ==\n\nA strong relationship between the arts and politics, particularly between various kinds of art and power, occurs across history and cultures. As they respond to events and politics, the arts take on political as well as social dimensions, becoming themselves a focus of controversy and a force of political and social change.\nOne observation is that an artist has a free spirit. For instance Pushkin, a well-regarded writer, attracted the irritation of Russian officialdom and particularly the Tsar, since he \"instead of being a good servant of the state in the rank and file of the administration and extolling conventional virtues in his vocational writings (if write he must), composed extremely arrogant and extremely independent and extremely wicked verse in which dangerous freedom of thought was evident in the novelty of his versification, in the audacity of his sensual fancy, and in his propensity for making fun of major and minor tyrants.\"\nArtists use their work to express their political views and promote social change, from influencing negatively in the form of hate speech to influencing positively through artivism. Governments use art, or propaganda, to promote their own agendas.\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Bibliography ===\n\n\n== Further reading ==\n\n\n== External links ==\n\nTopic Dictionaries at Oxford Learner's Dictionaries.\nDefinition of Art by Lexico.",
  "links": {
    "AAA (video game industry)": "",
    "ARTS (disambiguation)": "",
    "Abductive reasoning": "",
    "Abstract art": "",
    "Abstraction": "",
    "Academia": "",
    "Acropolis of Athens": "",
    "Actor": "",
    "Aesthetic": "",
    "Aesthetically": ""
  },
  "url": "https://en.wikipedia.org/wiki/The_arts"
}