{
  "title": "Brain healing",
  "content": "Brain healing is the process that occurs after the brain has been damaged. If an individual survives brain damage, the brain has a remarkable ability to adapt. When cells in the brain are damaged and die, for instance by stroke, there will be no repair or scar formation for those cells. The brain tissue will undergo liquefactive necrosis, and a rim of gliosis will form around the damaged area.\n\n\n== Scar formation ==\nApart from a small amount in the blood vessels, there are no fibroblasts in the brain. A scar is formed by fibroblasts producing collagen to repair an area, which will later contract. If scars did form in the brain, the contraction would cause even more damage.\n\n\n== Formation of a glial membrane ==\nAround the edge of necrosis, astrocytes proliferate. These cells extend processes, and form a delicate rim of gliosis around the margin of damage. The empty space left by brain tissue fills up with cerebrospinal fluid.\n\n\n== Functional recovery ==\nBrain injury will commonly be accompanied by acute swelling, which impairs function in brain tissue that remains alive. Resolution of swelling is an important factor for the individual's function to improve. The greatest factor in functional recovery after brain injury comes from the brain's ability to learn, called neuroplasticity. After injury, neuroplasticity allows intact areas of the brain to adapt and attempt to compensate for damaged parts of the brain. Although axons and the peripheral nervous system in the developing brain can regenerate, they cannot in the adult brain. This is partly because of factors produced by cells in the brain that inhibit this regeneration. Dendrites, however, will develop from intact axons, as part of the neuroplasticity process. After severe brain injury, improvement in function related to neuroplasticity is unlikely to occur without help from health professionals skilled in rehabilitation.  Recent studies have found collagen is extensively distributed throughout the brain and may be essential in protecting the brain against degeneration such as that in Alzheimers.\nA study done in Tel Aviv University showed severe brain damage can be reversed through oxygen rich air. Patients were treated with hyperbaric oxygen therapy (HBOT) in high pressure chambers containing oxygen rich air which increased oxygen levels in body tenfold.\nAfter two months of treatment, patients who were previously unable to perform simple daily activities such as bathing, cooking, climbing stairs or reading a book regained these abilities following treatment. \n\n\n== See also ==\nNeuroregeneration\n\n\n== References ==",
  "links": {
    "Astrocyte": "",
    "Axon": "",
    "Blood vessel": "",
    "Brain injury": "",
    "Cell (biology)": "",
    "Cerebrospinal fluid": "",
    "Dendrite": "",
    "Doi (identifier)": "",
    "Fibroblast": "",
    "Gliosis": ""
  },
  "url": "https://en.wikipedia.org/wiki/Brain_healing"
}