{
  "title": "Community resilience",
  "content": "Community resilience is the sustained ability of a community to use available resources (energy, communication, transportation, food, etc.) to respond to, withstand, and recover from adverse situations (e.g. economic collapse to global catastrophic risks). This allows for the adaptation and growth of a community after disaster strikes. Communities that are resilient are able to minimize any disaster, making the return to normal life as effortless as possible. By implementing a community resilience plan, a community can come together and overcome any disaster, while rebuilding physically and economically.\nDue to its high complexity the discussion on resilient societies has increasingly been considered from an inter- and transdisciplinary scope.\nAround 2010 the French-speaking discourse coined the notion of collapsology (collapse science), discussing the resilience of societal systems and possible scenarios for societal transformations in the face of a variety of factors, such as dependence on fossil fuels, overpopulation, loss of biodiversity, and instability of the financial system. The controversial term was created by Pablo Servigne (an agricultural engineer) who, with Raphaël Stevens, wrote the book Comment tout peut s'effondrer (literally, \"How everything can collapse\"). Another, decidedly transdisciplinary approach which has been coined in late 2010s by German researcher Karim Fathi is the concept of \"multiresilience\" taking into account the fact that crises in the 21st century are interconnected, multi-dimensional and occurring on multiple system levels. Challenges such as the COVID-19 pandemic (individuals, organisations, societies alike) occur simultaneously, often even in interconnected and clustered forms. From a cross-disciplinary perspective, Karim Fathi outlines five systemic principles contributing to increased collective intelligence, responsiveness and creativity of societies in the face of multiple crises occurring simultaneously. Multiresilience is regarded as complementary to already established concepts for assessing and promoting societal resilience potentials. At the same time it criticises the fact that societal resilience has so far always been discussed from a mono-crisis persperctive. According to Karim Fathi, this onesided perspective\" proves to be inadequate in terms of complexity, as societies in the 21st century have to deal with many global challenges - so-called „crisis-bundles“ - in the same time. Multiresilience aims to build up \"basic robustness\" in the sense of higher collective intelligence, which makes societies more capable of anticipating, reacting and solving problems in different crisis contexts.\n\n\n== Community resilience planning ==\nA community resilience plan is an action plan that allows for a community to rebuild after disaster. The plan should entail specific guidelines that will aid the community to rebuild both the economy and the ecosystem that the community thrives on. This typically means there are measures in place that a community will follow, such as the distribution of volunteers, and the access to knowledge and resources necessary to rebuild. Adaptability is a key attribute which means prevention can occur in response or before disaster strikes. The National Institute of Standards and Technology has a Community Resilience department tasked with solving this problem. This agency has created a Community Resilience Planning Guide, and its aim is to assist communities with anticipating challenges through a practical application that takes into account the social needs of the community as well as dependencies on the \"built environment\" - buildings and infrastructure systems. The outline of the six step process is shown below: \n\nSix-step process\nForm a collaborative planning team\nUnderstand the situation\nDetermine the goals and objectives\nPlan development\nPlan preparation, review, and approval\nPlan implementation and maintenance\n\n\n== Classification of hazards ==\nThe scope of community resilience extends beyond natural disasters and include manmade events.  Below are an example of disasters communities face on a daily basis:\n\nWind (hurricane, tornados)\nEarthquake (landslides, liquefaction)\nInundation (flooding, coastal erosion)\nFire (natural, manmade)\nSnow or rain (blizzards, tsunami)\nTechnological or human-caused (cyberwarfare, nuclear weapons)\nRoutine\nHazard events that occur regularly and are typically less consequential events in terms of damage and recovery.\nDesign\nHazard events that structures must be designed to withstand and often includes many natural disasters.\nExtreme\nHazard events may also found in building codes for some hazards; however, they are likely to cause significant and often irreparable damage.\n\n\n== Dependencies and cascading failures ==\nInfrastructure systems such as buildings, water, electric power, transportation, and communication are all interconnected and interdependent networks or systems. This means that a failure in one network can have catastrophic impact on another system. When Hurricane Katrina hit New Orleans, LA on August 23, 2005, it caused network outages in transportation and power networks which led to system failure and impedance in others such communication and emergency services.\n\n\n== For specific  issues ==\n\n\n=== Climate change ===\n\n\n== See also ==\nHuman-powered transport – Transport of goods and/or people only using human muscles\nResilience (organizational)\nSocietal collapse\n\n\n== References ==\n\n\n== External links ==\nNIST Community Resilience\nNIST Community Resilience Planning Guide\nResilient US website\nRAND website\nRAND tools",
  "links": {
    "ARkStorm": "",
    "Academic administration": "",
    "Accident": "",
    "Accounting management": "",
    "Adhocracy": "",
    "Alternative fuel vehicle": "",
    "Anthropocene": "",
    "Association of Technology, Management, and Applied Engineering": "",
    "Avalanche": "",
    "Bachelor of Business Administration": ""
  },
  "url": "https://en.wikipedia.org/wiki/Community_resilience"
}