{
  "title": "Comparative religion",
  "content": "Comparative religion is the branch of the study of religions  with the systematic comparison of the doctrines and practices, themes and impacts (including migration) of the world's religions. In general the comparative study of religion yields a deeper understanding of the fundamental philosophical concerns of religion such as ethics, metaphysics and the nature and forms of salvation. It also considers and compares the origins and similarities shared between the various religions of the world. Studying such material facilitates a broadened and more sophisticated understanding of human beliefs and practices regarding the sacred, numinous, spiritual and divine.\nIn the field of comparative religion, a common geographical classification of the main world religions distinguishes groups such as Middle Eastern religions (including Abrahamic religions and Iranian religions), Indian religions, East Asian religions, African religions, American religions, Oceanic religions, and classical Hellenistic religions.\nThere also exist various sociological classifications of religious movements.\n\n\n== History ==\n\nAl-Biruni (973 – c. 1050) and Ibn Hazm (994 – 1064), both of the Islamic Golden Age and considered as the \"fathers of comparative religion\", compared the study of religious pluralism and their works have been significant in the fields of theology and philosophy. The Persian Al-Biruni discussed his idea of history in The Remaining Signs of Past Centuries (c. 1000 AD) which was translated by Eduard Sachau in 19th century. It is a comparative study of calendars of different cultures and civilizations, interlaced with mathematical, astronomical, and historical information, exploring the customs and religions of different peoples.\nIn the seventeenth century, antiquarians such as Athanasius Kircher along with Sir Thomas Browne were pioneering scholars of comparative religion.\nSocial scientists in the 19th century took a strong interest in comparative and \"primitive\" religion through the work of Max Müller, Edward Burnett Tylor, William Robertson Smith, James George Frazer, Émile Durkheim, Max Weber, and Rudolf Otto.\nNicholas de Lange, Professor of Hebrew and Jewish Studies at Cambridge University, says that\n\nThe comparative study of religions is an academic discipline which has been developed within Christian theology faculties, and it has a tendency to force widely differing phenomena into a kind of strait-jacket cut to a Christian pattern. The problem is not only that other 'religions' may have little or nothing to say about questions which are of burning importance for Christianity, but that they may not even see themselves as religions in precisely the same way in which Christianity sees itself as a religion.Examples that demonstrate this point are Buddhism and Chinese Folk Religions. These belief systems have not historically been seen as mutually exclusive and have blended over time into different beliefs such as Pure Land Buddhism. This shows a marked difference from Western conceptions of religions which see adherence to one religion as precluding membership of another faith.\nHinduism and Buddhism provide another insight in the form of soteriology. Comparative study of religions may approach religions with a base idea of salvation with eternal life after death, but religions like Hinduism or Buddhism don't necessarily share this view. Instead, Hinduism and Theravada Buddhism both speak of a falling back into nonexistence and escaping the cycle of reincarnation, rather than eternal life after death.\n\n\n== Geographical classification ==\nAccording to Charles Joseph Adams, in the field of comparative religion, a common geographical classification discerns the main world religions as follows:\n\nMiddle Eastern religions, including Judaism, Christianity, Islam, Zoroastrianism, and a variety of ancient cults;\nEast Asian religions, the religious communities of China, Japan, Korea and Vietnam, and consisting of Confucianism, Taoism, the various schools of Mahayana (“Greater Vehicle”) Buddhism, and Shintō;\nIndian religions, including early Buddhism, Hinduism, Jainism, Sikhism, and sometimes also the Theravada (“Way of the Elders”) Buddhism and the Hindu- and Buddhist-inspired religions of South and Southeast Asia;\nAfrican religions, the ancient belief systems of the various indigenous peoples of Africa, excluding ancient Egyptian religion, which is considered to belong to the ancient Middle East;\nAmerican religions, the beliefs and practices of the various Indigenous peoples of the two American continents;\nOceanic religions, the religious systems of the peoples of the Pacific islands, Australia, and New Zealand; and\nReligions of ancient Greece and Rome and their Hellenistic descendants.\n\n\n=== Middle Eastern religions ===\n\n\n==== Abrahamic or Western Asian religions ====\n\nIn the study of comparative religion, the category of Abrahamic religions consists of the three monotheistic religions, Christianity, Islam and Judaism, which claim Abraham (Hebrew Avraham אַבְרָהָם; Arabic Ibrahim إبراهيم ) as a part of their sacred history. Smaller religions such as Baháʼí Faith that fit this description are sometimes included but are often omitted.\nThe original belief in the God of Abraham eventually became strictly monotheistic present-day Rabbinic Judaism. Judaism is considered by religious Jews to be the expression of the covenant that God established with the Children of Israel. Jews hold that the Torah is part of the larger text known as the Tanakh or the Hebrew Bible, they also believe in a supplemental oral tradition represented by later texts such as the Midrash and the Talmud.\nChristians believe that Christianity is the fulfillment and continuation of the Jewish Old Testament. Christians believe that Jesus (Hebrew Yeshua יֵשׁוּעַ) is the awaited Messiah (Christ) foretold in the Old Testament prophecies, and believe in subsequent New Testament scripture. Christians in general believe that Jesus is the incarnation or Son of God. Their creeds generally hold in common that the incarnation, ministry, suffering, death on the cross, and resurrection of Jesus was for the salvation of mankind.\nIslam believes the present Christian and Jewish scriptures have been corrupted over time and are no longer the original divine revelations as given to the Jewish people and to Moses, Jesus, and other prophets. For Muslims, the Quran is the final, complete revelation from God (Arabic الله Allah), who believe it to have been revealed to Muhammad alone, who is believed by Muslims to be the final prophet of Islam, and the Khatam an-Nabiyyin, meaning the last of the prophets ever sent by Allah (\"seal of the prophets\").\nBased on the Muslim figure of the Mahdī, the ultimate savior of humankind and the final Imām of the Twelve Imams, Ali Muhammad Shirazi, later known as Bab, created the Bábí movement out of the belief that he was the gate to the Twelfth Imām. This signaled a break with Islam and started a new religious system, Bábism. However, in the 1860s a split occurred after which the vast majority of Bábís who considered Mirza Husayn `Ali or Bahá'u'lláh to be Báb's spiritual successor founded the Baháʼí Movement, while the minority who followed Subh-i-Azal came to be called Azalis. The Baháʼí division eventually became a full-fledged religion of its own, the Baháʼí Faith. In comparison to the other Abrahamic religions, Judaism, Christianity and Islam, the number of adherents for Baháʼí faith and other minor Abrahamic religions are not very significant.\nOut of the three major Abrahamic faiths, Christianity and Judaism are the two religions that diverge the most in theology and practice.\nThe historical interaction of Islam and Judaism started in the 7th century CE with the origin and spread of Islam. There are many common aspects between Islam and Judaism, and as Islam developed, it gradually became the major religion closest to Judaism. As opposed to Christianity, which originated from interaction between ancient Greek, Roman, and Hebrew cultures, Judaism is very similar to Islam in its fundamental religious outlook, structure, jurisprudence and practice. There are many traditions within Islam originating from traditions within the Hebrew Bible or from post-biblical Jewish traditions. These practices are known collectively as the Isra'iliyat.\nThe historical interaction between Christianity and Islam connects fundamental ideas in Christianity with similar ones in Islam. Islam accepts many aspects of Christianity as part of its faith – with some differences in interpretation – and rejects other aspects. Islam believes the Quran is the final revelation from God and a completion of all previous revelations, including the Bible.\nMandaeism, sometimes also known as Sabianism (after the mysterious Sabians mentioned in the Quran, a name historically claimed by several religious groups), is a Gnostic and monotheistic religion.: 4  John the Baptist is their chief prophet and frequent baptism is part of their core beliefs. According to most scholars, Mandaeism originated sometime in the first three centuries CE, in either southwestern Mesopotamia or the Syro-Palestinian area. However, some scholars take the view that Mandaeism is older and dates from pre-Christian times. Mandaeans assert that their religion predates Judaism, Christianity, and Islam as a monotheistic faith. Mandaeans believe that they descend directly from Shem, Noah's son,: 182  and also from John the Baptist's original disciples.\n\n\n==== Iranian religions ====\n\nSeveral important religions and religious movements originated in Greater Iran, that is, among speakers of various Iranian languages. They include Zoroastrianism, Mithraism, Ætsæg Din, Yazdanism, Ahl-e Haqq, Zurvanism, Manichaeism, and Mazdakism.\n\nPerhaps one of the most important religions to have come out of Iran was Zoroastrianism. While not, properly speaking, a world religion, it became widespread in the Iranian world, especially through the Achaemenid and Sasanian Empires. It went into decline alongside many Iranian religions with the rise of Islam and the Caliphates. The religion still survives today in small numbers, with a particularly notable example being the Parsis in India and Pakistan.\nScholars have often noted the similarities between Zoroastrianism and the Abrahamic religions, especially Christianity. They've particularly noted this due to the historic relationship between the Jews and the Zoroastrian Persian Empires, as well as the relationship between Greek philosophy, Persia, and Christianity. They've debated whether Zoroastrianism played an influencing role on these religions or not. Particular areas of concern are a shared sense of duality between the forces of good and evil, or light and darkness. In addition to this, there is a shared belief in the resurrection of the dead as well as an emphasis on free will and the moral responsibility of mankind. These are seen by some as having influenced the three major Abrahamic faiths as well as Gnosticism and the Baháʼí Faith.\nManichaeism is another Iranian faith that shares many similarities to Zoroastrianism. In fact, Manichaeism shares a belief in the prophethood of Zoroaster while also maintaining the prophethood of Gautama Buddha and Jesus Christ. It shares a dualist cosmology that pits good and light against evil and darkness, with an adversary to oppose the benevolent God. Manichaeism and Mandaeism also share a common belief in many of the figures and stories of the Abrahamic faiths, which has raised questions of influences and origins.\n\n\n=== Indian religions ===\n\nIn comparative religion, Indian religions are all the religions that originated in South Asia. It is thought that \"the kinship of the religions of India stems from the fact that Jains, Buddhists and Sikhs look back to Hinduism as their common mother.\"\nAl-Biruni deeply studied the Vedic religions and through his works essential details about pre-11th century India's religions and cultures were found. Adi Shankaracharya was an early 8th century philosopher and theologian who consolidated the doctrine of Advaita Vedanta. Gautama Buddha is mentioned as an Avatar of Vishnu in the Puranic texts of Hinduism. Most Hindus believe the Buddha accepted and incorporated many tenets of Hinduism in his doctrine. Prominent modern Hindu reformers such as Mahatma Gandhi and Vivekananda acknowledge Buddhist influence. Like Hindus, Gandhi himself did not believe Buddha established a non-Hindu tradition. He writes, \"I do not regard Jainism or Buddhism as separate from Hinduism.\"\n\n\n=== East Asian or Taoic religions ===\n\nA Taoic religion is a religion, or religious philosophy, that focuses on the East Asian concept of Tao (\"The Way\"). This forms a large group of eastern religions including Taoism, Confucianism, Jeung San Do, Shintoism, I-Kuan Tao, Chondogyo, and Chen Tao. In large parts of East Asia, Buddhism has taken on some taoic features.\nTao can be roughly stated to be the flow of the universe, or the force behind the natural order. It is believed to be the influence that keeps the universe balanced and ordered and is associated with nature, due to a belief that nature demonstrates the Tao. The flow of qi, as the essential energy of action and existence, is compared to the universal order of Tao. Following the Tao is also associated with a \"proper\" attitude, morality and lifestyle. This is intimately tied to the complex concept of De, or literally \"virtue\" or \"power.\" De is the active expression of Tao.\nTaoism and Chan Buddhism for centuries had a mutual influence on each other in China, Japan, Korea, and Taiwan. These influences were inherited by Zen Buddhism when Chan Buddhism arrived in Japan and adapted as Zen Buddhism.\nDespite being too far from each other to have had any influence, some have historically noted similarities between traditional Chinese religious beliefs and Christianity. This was noted by Jesuit missionaries who became known as figurists. Figurists promoted the idea that the ancient Chinese knew the truth of Christian revelation and that many of the figures described in Chinese texts are actually figures and concepts from Christianity. Noted parallels include shared flood myths, similarities between Fuxi and Enoch, as well as parallels between Christ and the sages. There is also a noted similarity between the Tao being \"the Way\" as well as Christ claiming to be \"the Way.\"\nWhile scholarship rejects this view today, it was a notable view in the history of comparative religion. These beliefs were ultimately opposed and disavowed by the Catholic Church in the 18th century.\nThe introduction of Nestorian Christianity to China under the Tang dynasty also led to increasing similarities between Chinese Buddhism and Nestorian Christianity. Christians began using Buddhist and Taoist concepts to explain their faith. During this time the Jingjiao documents were created, sometimes called sutras, that demonstrated the blending of Christianity with Buddhism. The two also formed a monastic tradition that furthered the similarities. This fusion became so heavy that when Emperor Wuzong of the Tang dynasty began persecuting Buddhists in the 9th century, he claimed that Christianity was merely a heresy of Buddhism rather than its own religion. This equation of the two led to the collapse of Nestorian Christianity in China alongside the persecution of Buddhism.\n\n\n== Comparing traditions ==\nReligious ideologies can be systematically understood to have formed many major groups with tens of thousands of subbranches. It is a form of cultural evolution that can be intuitively illustrated with trees showing historical relationships and the diversification over time of the various traditions. Some of the most successful have been those religions that paired up with empires, kingdoms, or caliphates early in their history (e.g., Christianity, Islam, Hinduism, Buddhism). A few major groups of religion are given below.\n\n\n=== Christianity ===\nChristianity and other religions\nBuddhism and Christianity\nComparison of Buddhism and Christianity\nChristianity and Islam\nChristianity and Judaism\nChristianity and Neopaganism\nChristianity and Paganism\nChristianity and Vodou\nChristianity and Mormonism\nChristianity and Theosophy\nMormonism\nMormonism and Christianity\nMormonism and Islam\nMormonism and Judaism\n\n\n=== Judaism ===\nChristianity and Judaism\nIslamic–Jewish relations\nHinduism and Judaism\n\n\n=== Islam ===\nIslam and other religions\nChristianity and Islam\nHindu–Islamic relations\nIslam and Jainism\nIslamic–Jewish relations\nIslam and Sikhism\nMormonism and Islam\n\n\n=== Sikhism ===\nHinduism and Sikhism\nIslam and Sikhism\nJainism and Sikhism\n\n\n=== Hinduism ===\nHinduism and other religions\nBaháʼí Faith and Hinduism\nBuddhism and Hinduism\nHindu–Islamic relations\nJainism and Hinduism\nHinduism and Sikhism\nHinduism and Judaism\n\n\n=== Buddhism ===\nBuddhism and Christianity\nBuddhism and Eastern religions\nBuddhism and Gnosticism\nBuddhism and Hinduism\nBuddhism and Jainism\nBuddhism and Theosophy\nBuddhism and Islam\nComparison of Buddhism and Christianity\n\n\n=== Jainism ===\nBuddhism and Jainism\nIslam and Jainism\nJainism and Sikhism\n\n\n=== Paganism and Neopaganism ===\nChristianity and Paganism\nChristianity and Neopaganism\n\n\n=== Confucianism ===\nConfucianism and eastern religions\nConfucianism and western religions\n\n\n=== Taoism ===\nTaoism and other religions\n\n\n=== Baháʼí Faith ===\nBaháʼí Faith and the unity of religion\nBaháʼí Faith and Buddhism\nBaháʼí Faith and Hinduism\nBaháʼí Faith and Zoroastrianism\n\n\n=== Zoroastrianism ===\nZoroastrianism and other religions\nZoroastrianism and Baháʼí Faith\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Works cited ===\nComans, Michael (2000). The Method of Early Advaita Vedānta: A Study of Gauḍapāda, Śaṅkara, Sureśvara, and Padmapāda. Motilal Banarsidass. ISBN 978-81-208-1722-7.\nSharma, B.N. Krishnamurti (1962). Philosophy of Śrī Madhvācārya. Bombay: Bharatiya Vidya Bhavan March. OCLC 1075020345.\n\n\n== Further reading ==\nChopra, R. M. A Study of Religions, (Anuradha Prakashan, New Delhi, 2015) ISBN 978-9382339-94-6.\nDavis, G. Scott. Believing and Acting: The Pragmatic Turn in Comparative Religion and Ethics (Oxford University Press, 2012).\nEastman, Roger. The Ways of Religion: An Introduction to the Major Traditions. (3rd ed. Oxford University Press, 1959) ISBN 978-0-19-511835-3.\nEliade, Mircea. Patterns in comparative religion (1958) online\nEliade, Mircea. The Sacred and the Profane: The Nature of Religion (1959) online\nGothoni, Rene, How to Do Comparative Religion: Three Ways, Many Goals (2005) online\nJames, E. O. Comparative Religion (1961) online textbook\nJones, Lindsay, ed. Encyclopedia of Religion (2nd edn, 15 vols, Macmillan, 2004)\nMomen, Moojan (2009) [Originally published as The Phenomenon of Religion in 1999]. Understanding Religion: A Thematic Approach. Oxford, UK: Oneworld Publications. ISBN 978-1-85168-599-8. OL 25434252M.\nMuhiyaddin, M. A. (1984) A Comparative Study of the Religions of Today. Vantage Press, US. ISBN 978-0533059638.\nPaden, William E. \"Comparative religion.\" in The Routledge companion to the study of religion (Routledge, 2009). pp 239–256. online\nPaden, William E. New patterns for comparative religion: Passages to an evolutionary perspective (Bloomsbury, 2016).\nPaden, William E. Interpreting the Sacred: Ways of Viewing Religion (2003) excerpt\nPaden, William E. Religious Worlds: The Comparative Study of Religion (2015) excerpt\nSaso, Michael R. Mystic, Shaman, Oracle, Priest (MYSHOP): Prayers Without Words. (Sino-Asian Institute of America, US, 2015). ISBN 978-1624074059.\nSharpe, Eric J. Comparative Religion: A History, London: Duckworth, 1975 (2nd revised edition 1986).\nShaw, Jeffrey M. Illusions of Freedom: Thomas Merton and Jacques Ellul on Technology and the Human Condition. (Wipf and Stock, 2014). ISBN 978-1625640581.\nSmart, Ninian. Dimensions of the Sacred: An Anatomy of the World's Beliefs (1999) ISBN 0-520-21960-0\nSmith, Huston. The World's Religions: Our Great Wisdom Traditions. (1991)  HarperOne, US; Rev Rep edition. ISBN 978-0062508119.\n\n\n== External links ==\nPatheos.com's Side-By-Side Comparative \"Lenses\"\nReligiousTolerance.org Archived 6 December 2010 at the Wayback Machine\nReligionFacts.com\nComparative-religion.com\nStudies in Comparative Religion\nAnswers to Questions of Faith From Several Worldviews\n\"The Faith versus Reason Debate\" – comparative religion studies inspired by Aldous Huxley's The Perennial Philosophy\nHave religious discussions and debates both voice and text on telegram group: Discuss Religion",
  "links": {
    "Abenaki mythology": "",
    "Abkhaz neopaganism": "",
    "Abraham": "",
    "Abrahamic religion": "",
    "Abrahamic religions": "",
    "Achaemenid Empire": "",
    "Acoma Pueblo": "",
    "Adi Shankaracharya": "",
    "Advaita Vedanta": "",
    "Adventism": ""
  },
  "url": "https://en.wikipedia.org/wiki/Comparative_religion"
}