{
  "title": "Creativity techniques",
  "content": "Creativity techniques are methods that encourage creative actions, whether in the arts or sciences. They focus on a variety of aspects of creativity, including techniques for idea generation and divergent thinking, methods of re-framing problems, changes in the affective environment and so on. They can be used as part of problem solving, artistic expression, or therapy.\nSome techniques require groups of two or more people while other techniques can be accomplished alone.  These methods include word games, written exercises and different types of improvisation, or algorithms for approaching problems. Aleatory techniques exploiting randomness are also common.\n\n\n== Aleatory techniques ==\n\nAleatoricism is the incorporation of chance (random elements) into the process of creation, especially the creation of art or media. Aleatoricism is commonly found in music, art, and literature, particularly in poetry.  In film, Andy Voda made a movie in 1979 called Chance Chants, which he produced by a flip of a coin or roll of a dice. In music, John Cage, an avant-garde musician, composed music by using the I Ching to determine the position of musical notes, superimposing star maps on blank sheet music, by rolling dice and preparing open-ended scores that depended on the spontaneous decisions of the performers. Other ways of practicing randomness include coin tossing, picking something out of a hat, or selecting random words from a dictionary. \nThe aleatory approach is also demonstrated in the case of the process called provocation, which was initially introduced by Edward de Bono as an aid to research. This method, which Richard Restak said was also employed by Anthony Burgess, aims to achieve novel ideas in writing by directing a plot with creative connections through random words picked from a reference book. Restak explained that the two hundred billion interconnected neural cells in the brain are capable of an abundance of possibilities for long-range connections and creative interactions using random and unrelated words.\n\n\n== Improvisation ==\n\nImprovisation is a creative process which can be spoken, written, or composed without prior preparation.\nImprovisation, also called extemporization, can lead to the discovery of new ways to act, new patterns of thought and practices, or new structures. Improvisation is used in the creation of music, theater, and other various forms.  Many artists also use improvisational techniques to help their creative flow.\nThe following are two significant domains that use improvisation:\n\nImprovisational theater is a form of theater in which actors use improvisational acting techniques to perform spontaneously. Many improvisational (\"improv\") techniques are taught in standard drama classes. The basic skills of listening, clarity, confidence, and performing instinctively and spontaneously are considered important skills for actors to develop.\nFree improvisation is real-time composition. Musicians of all kinds improvise (\"improv\") music; such improvised music is not limited to a particular genre. Two contemporary musicians that use free improvisation are Anthony Braxton and Cecil Taylor.\n\n\n== In problem solving ==\n\nIn problem-solving contexts, the random-word creativity technique is perhaps the simplest method. A person confronted with a problem is presented with a randomly generated word, in the hopes of a solution arising from any associations between the word and the problem.  A random image, sound, or article can be used instead of a random word as a kind of creativity goad or provocation.\nThere are many problem-solving tools and methodologies to support creativity:\n\nTRIZ (theory which are derived from tools such as ARIZ or TRIZ contradiction matrix)\nCreative problem solving process (CPS) (complex strategy, also known as Osborn-Parnes-process)\nLateral thinking process, of Edward de Bono\nSix Thinking Hats, of Edward de Bono\nOrdinal priority approach\nHerrmann brain dominance instrument – right brain / left brain\nBrainstorming and brainwriting\nThink outside the box\nBusiness war games, for the resolution of competitive problems\nSWOT analysis\nUSIT method of convergent creativity\nThought experiment\nFive Ws\n\n\n== In project management ==\nFor project management purposes, group creativity techniques are creativity techniques used by a team in the course of executing a project. Some relevant techniques are brainstorming, the nominal group technique, the Delphi technique, idea/mind mapping, the affinity diagram, and multicriteria decision analysis. These techniques are referenced in the Guide to the Project Management Body of Knowledge.\nGroup creativity techniques can be used in a sequence; for example:\n\nGather requirements using idea/mind mapping\nContinue generating ideas by brainstorming\nConstruct an affinity diagram based on the generated ideas\nIdentify the most important ideas by applying the nominal group technique\nObtain several rounds of independent feedback using the Delphi technique\n\n\n== Affecting factors ==\n\n\n=== Distraction ===\nMultiple studies have confirmed that distraction actually increases creative cognition. One such study done by Jonathan Schooler found that non-demanding distractions improve performance on a classic creativity task called the UUT (Unusual Uses Task) in which the subject must come up with as many possible uses for a common object. The results confirmed that decision-related neural processes occur during moments of unconscious thought while a person engages in a non-demanding task. The research showed that while distracted, a subject isn’t maintaining one thought for a particularly long time, which in turn allows different ideas to float in and out of one’s consciousness—this sort of associative process leads to creative incubation.\nAmbient noise is another variable that is conducive to distraction. It has been proven that a moderate level of noise actually heightens creativity. Professor Ravi Mehta conducted a study to research the degree of distraction induced by various noise levels and their effect on creativity. The series of experiments show that a moderate level of ambient noise (70 dB) produces just enough distraction to induce processing disfluency, which leads to abstract cognition. These higher construal levels caused by moderate levels of noise consequently enhance creativity.\n\n\n=== Walking ===\nIn 2014, a study found that walking increased creativity.\n\n\n=== Sleep and relaxation ===\nSome advocate enhancing creativity by taking advantage of hypnagogia, the transition from wakefulness to sleep, using techniques such as lucid dreaming.  One technique used by Salvador Dalí was to drift off to sleep in an armchair with a set of keys in his hand; when he fell completely asleep, the keys would fall and wake him up, allowing him to recall his mind's subconscious imaginings.  Thomas Edison used the same technique, with ball bearings.\n\n\n=== Meditation ===\nA study from 2014 involving 40 Chinese undergraduates found that performing a 30 minute meditation session each day, for seven days, was sufficient to improve verbal and visual creativity, as measured by the Torrance Tests of Creative Thinking, due to the positive effects of meditation on emotional regulation. The same researchers also showed in 2015 that short term meditation training could also improve insight-based problem solving (the type commonly associated with an \"ah-ha\" or \"eureka\" type moment of realization) as measured by the Remote Associates Test.\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\n Media related to Creativity techniques at Wikimedia Commons",
  "links": {
    ".design": "",
    "6-3-5 Brainwriting": "",
    "Activity-centered design": "",
    "Adaptive web design": "",
    "Advertising": "",
    "Affective design": "",
    "Affinity diagram": "",
    "Agile software development": "",
    "Aleatoricism": "",
    "Algorithm design": ""
  },
  "url": "https://en.wikipedia.org/wiki/Creativity_techniques"
}