{
  "title": "Critical systems thinking",
  "content": "Critical systems thinking (CST) is a systems approach designed to aid decision-makers, and other stakeholders, improve complex problem situations that cross departmental and, often, organizational boundaries. CST sees systems thinking as essential to managing multidimensional 'messes' in which technical, economic, organizational, human, cultural and political elements interact. It is critical in a positive manner because it seeks to capitalize on the strengths of existing approaches while also calling attention to their limitations. CST seeks to allow systems approaches such as systems engineering, system dynamics, organizational cybernetics, soft systems methodology, critical systems heuristics, and others, to be used together, in a responsive and flexible way, to maximize the benefits they can bring.\n\n\n== History ==\nCST has its origins in the 1980s with accounts of how the theoretical partiality of existing systems methodologies limited their ability to guide interventions in the full range of problem situations; calls for pluralism in systems practice; and suggestions about how those disadvantaged by systems designs could be given a voice and have impact. CST was largely developed at the Centre for Systems Studies, University of Hull, based on research by Michael C Jackson, Paul Keys, and Robert L Flood. It came to prominence in 1991 with the publication of three books - Critical Systems Thinking: Directed Readings, Systems Methodology for the Management Sciences, and Creative Problem Solving: Total Systems Intervention. The first was a collection of papers, accompanied by a commentary, which traced the origins and outlined the major themes of the approach. It highlighted the contributions of authors such as Flood, Fuenmayor, Jackson, Mingers, Oliga and Ulrich. The second offered a critique of existing systems approaches from the perspective of social theory, made the case for CST and sought to demonstrate that it could take the lead in enriching theory and practice in the management sciences. The third was the first attempt to show how CST could be used in practice. Since 1991, CST has been taken forward by authors such as Robert L Flood, Michael C Jackson, John Mingers and Gerald Midgley.\n\n\n== Recent developments ==\nRecent developments have centered on the application of CST in practice - in particular Gerald Midgley's 'Systemic Intervention', focusing on boundary critique, and Michael C Jackson's multiperspectival and multimethodological 'Critical Systems Practice' (CSP). Adopting a pragmatist orientation, Jackson has set out, in a series of papers, how the four commitments of CST can be applied in practice. CSP has 4 main stages - Explore, Produce, Intervene, and Check (EPIC) - and various sub-stages:\n\nExplore the problem situation\nview it from a variety of systemic perspectives\nidentify primary and secondary issues\nProduce an appropriate intervention strategy\nappreciate the variety of systems approaches\nchoose appropriate systems methodologies\nchoose appropriate systems models and methods\nstructure, schedule and set objectives for the intervention\nIntervene flexibly (revisiting the first two stages as necessary)\nCheck on progress\nevaluate the improvements achieved\nreflect on the systems approaches used\ndiscuss and agree next steps\n\n\n== See also ==\nsystems engineering\nsystem dynamics\nOrganizational cybernetics\nSoft systems methodology\nSystems thinking\nSystems theory\n\n\n== References ==",
  "links": {
    "Doi (identifier)": "",
    "Gerald Midgley": "",
    "ISBN (identifier)": "",
    "ISSN (identifier)": "",
    "Mike Jackson (systems scientist)": "",
    "Organizational Cybernetics": "",
    "Robert L. Flood": "",
    "S2CID (identifier)": "",
    "Soft systems methodology": "",
    "System dynamics": ""
  },
  "url": "https://en.wikipedia.org/wiki/Critical_systems_thinking"
}