{
  "title": "Dantian",
  "content": "Dantian is a concept in traditional Chinese medicine loosely translated as \"elixir field\", \"sea of qi\", or simply \"energy center\". Dantian are the \"qi focus flow centers\", important focal points for meditative and exercise techniques such as qigong, martial arts such as tai chi, and in traditional Chinese medicine. Dantian is also now commonly understood to refer to the diaphragm in various Qigong practices and breath control techniques, such as diaphragmatic breathing for singing and speaking.\n\n\n== Overview ==\nHistorically the first detailed description of the lower Dantian is in the Laozi zhongjing from the 3rd century CE, which refers to the elixir-of-life field where \"essence\" and \"spirit\" are stored; it is related to regeneration and sexual energy, menstruation and semen. Traditionally, a dantian is considered to be a center of qi or life force energy. The dantian are important points of reference in neidan, qigong, neigong, daoyin, Taoist sexual practices, reiki and other self-cultivation practices of exercise, breathing, and meditation, as well as in martial arts and in Traditional Chinese medicine. The lower dantian is particularly important as the focal point of breathing technique as well as the centre of balance and gravity. Dantian are focal points for transmutation of the three treasures jing, qi and shen. Qi can be seen as a substance when it is stored in the form of jing, this can be refined by heating in these cauldrons into more rarefied states such as qi which is insubstantial and further still into shen which is more like the Western concept of mind although it is more often translated as \"spirit\".\nTaoist and Buddhist teachers often instruct their students to centre the mind in the navel or lower dantian. This is believed to aid control of thoughts and emotions. Acting from the dantian is considered to be related to higher states of awareness including sanmei (三昧) or ding (定).\n\n\n== Three dantians ==\nDifferent schools of thought categorize dantian in various manners. Three main dantian are typically emphasized:\n\nLower dantian (下丹田, Xià Dāntián): at the crossing of the horizontal line behind the Ren-6 acupoint and vertical line above the perineum, which is also called \"the golden stove\" (金炉 pinyin: Jīn lú) or the namesake \"elixir-of-life field\" proper, where the process of developing the elixir by refining and purifying essence (jing) into vitality (qi) begins.\nMiddle dantian (中丹田, Zhōng Dāntián): at the level of the heart, which is also called \"the crimson palace\", associated with storing spirit (shen) and with respiration and health of the internal organs, in particular the thymus gland. This cauldron is where vitality or qi is refined into shen or spirit.\nUpper dantian (上丹田, Shàng Dāntián): at the forehead between the eyebrows or third eye, which is also called \"the muddy pellet\", associated with the pineal gland. This cauldron is where shen or spirit is transmuted into wu wei or emptiness.\n\n\n== Importance of the lower dantian ==\nThe term dantian used by itself usually refers to the lower dantian, which is considered to be the foundation of rooted standing, grounding, breathing, and body awareness in Chinese and other martial arts including qigong. The lower dantian has been described to be \"like the root of the tree of life.\"\nIn speaking of the lower of the three energy centers, the term dantian is often used interchangeably with the Japanese word hara (腹; Chinese: fù) which means simply \"belly.\" In Chinese, Korean, and Japanese traditions, it is considered the physical center of gravity of the human body and is the seat of one's internal energy (qi). A master of Japanese acupuncture, calligraphy, swordsmanship, tea ceremony, martial arts, among other arts, is held in the Japanese tradition to be \"acting from the hara.\"\nThe lower dantian in traditional Chinese Medicine is where the primordial essence, Jing (精), is stored. Jing is the basis for our physical existence and can be seen as DNA. At the same time, the lower Dan Tian is the place for Yuan qi (元氣)  the Qi that has not yet been divided into Yin Qi or Yang Qi. This Qi is much less physical and could be seen as the elemental existence of atoms and electrons before there are molecules. In the Ancient Texts of the Book of the Yellow Emperor (Huangdi Neijing ), the lower Dan Tian is referred to as both the seat of Jing (精) and the source of Yuan qi (元氣). Both can also be used side by side as an apparent contradiction.\nIn this way, the lower dantian becomes the basis of all life, of your body (Jing 精) of your mind (shen,神) of the energy of life (qi, 氣 ) of your self-preservation, of your self-healing capacity, of your emotions with the basic fear / fear of life as a foundation .\nIn qigong practice, the lower dantian, as the source of qi, is also used for storing qi, for transforming qi, for emitting qi, for returning qi, for releasing blockages of qi in the periphery.\nThe area is associated to the tantric swadhisthana chakra In yoga philosophy, it is thought to be the seat of prana (compare with yuan qi) that radiates outwards to the entire body. This Chakra can be blocked by the fear of death, the bases for all emotions. Also this has the same similarity with the lower dantian\n\n\n== See also ==\nAcupuncture\nDosha -vatta, pitta, Kapha (3 life elements in body)\nHara (tanden)\nJing (TCM)\nKiai\nKundalini energy\nMeditation\nMindfulness (Buddhism)\nMisogi\nPushing hands\nQigong\nScientific skepticism\nSecret of the Golden Flower\nSilk reeling\nTai chi\nTriple burner\n\n\n== References ==\n\nChia, Mantak. Cosmic Orbit: Connect to the Universe from Within. Universal Tao Publications, 2005. ISBN 974-85401-4-6.\nPorkert, Manfred. The Theoretical Foundations of Chinese Medicine. MIT Press, 1974. ISBN 0-262-16058-7.\nRouselle, Irwin. ‘Spiritual Guidance in Contemporary Taoism’. In Spiritual Disciplines: Papers from the Eranos Yearbooks. Princeton University Press, 1960. ISBN 0-691-01863-4.\nWang, Mu. Foundations of Internal Alchemy: The Taoist Practice of Neidan. Golden Elixir Press, 2011. ISBN 978-0-9843082-5-5.\n\n\n== External links ==\nDoctrine of the Elixir – On the conception of the Dan Tian in Daoist cosmology.\n\"An Shigao and Early Chinese Meditation Techniques\" – Phra Kiattisak Kittipanyo (August 2012), DIRI Journal Volume 1, no. 1, pp. 98–118.",
  "links": {
    "Activated charcoal cleanse": "",
    "Acupoint": "",
    "Acupressure": "",
    "Acupuncture": "",
    "Adrenal fatigue": "",
    "Aerotoxic syndrome": "",
    "Alkaline diet": "",
    "Alternative cancer treatments": "",
    "Alternative medicine": "",
    "Alternative veterinary medicine": ""
  },
  "url": "https://en.wikipedia.org/wiki/Dantian"
}