{
  "title": "Ecosystem management",
  "content": "Ecosystem management is an approach to natural resource management that aims to ensure the long-term sustainability and persistence of an ecosystem's function and services while meeting socioeconomic, political, and cultural needs. Although indigenous communities have employed sustainable ecosystem management approaches implicitly for millennia, ecosystem management emerged explicitly as a formal concept in the 1990s from a growing appreciation of the complexity of ecosystems and of humans' reliance and influence on natural systems (e.g., disturbance and ecological resilience).\nBuilding upon traditional natural resource management, ecosystem management integrates ecological, socioeconomic, and institutional knowledge and priorities through diverse stakeholder participation. In contrast to command and control approaches to natural resource management, which often lead to declines in ecological resilience, ecosystem management is a holistic, adaptive method for evaluating and achieving resilience and sustainability. As such, implementation is context-dependent and may take a number of forms including adaptive management, strategic management, and landscape-scale conservation.\n\n\n== Formulations ==\n\nThe term “ecosystem management” was formalized in 1992 by F. Dale Robertson, former Chief of the U.S. Forest Service. Robertson stated, “By ecosystem management, we mean an ecological approach… [that] must blend the needs of people and environmental values in such a way that the National Forests and Grasslands represent diverse, healthy, productive and sustainable ecosystems.”\nA variety of additional definitions of ecosystem management exist. For example, Robert T. Lackey emphasizes that ecosystem management is informed by ecological and social factors, is motivated by societal benefits, and is implemented over a specific timeframe and area. F. Stuart Chapin and co-authors emphasize that ecosystem management is guided by ecological science to ensure the long-term sustainability of ecosystem services, while Norman Christensen and coauthors emphasize that it is motivated by defined goals, employs adaptive practices, and accounts for the complexities of ecological systems. Peter Brussard and colleagues emphasize that ecosystem management balances preserving ecosystem health while sustaining human needs.\nAs a concept of natural resource management, ecosystem management remains both ambiguous and controversial, in part because some of its formulations rest on contested policy and scientific assertions. These assertions are important for understanding much of the conflict surrounding ecosystem management. For instance, some allege that professional natural resource managers, typically operating from within government bureaucracies and professional organizations, mask debate over controversial assertions by depicting ecosystem management as an evolution of past management approaches.\n\n\n=== Principles of ecosystem management ===\nA fundamental concern of ecosystem management is the long-term sustainability of the production of goods and services by ecosystems, as \"intergenerational sustainability [is] a precondition for management, not an afterthought.\" Ideally, there should be clear, publicly stated goals with respect to future trajectories and behaviors of the system being managed. Other important requirements include a sound ecological understanding of the system including ecological dynamics and the context in which the system is embedded. An understanding of the role of humans as components of the ecosystems and the use of adaptive management is also important. While ecosystem management can be used as part of a plan for wilderness conservation, it can also be used in intensively managed ecosystems (e.g., agroecosystems and close to nature forestry).\nCore principles and common themes of ecosystem management:\n\nSystems thinking: Management has a holistic perspective rather than focusing on a particular level of biological hierarchy in an ecosystem (e.g., only conserving a specific species or only preserving ecosystem functioning).\nEcological boundaries: Ecological boundaries are clearly and formally defined, and management is place-based.\nEcological integrity: Management is focused on maintaining or reintroducing native biological diversity and on preserving natural disturbance regimes and other key processes that sustain resilience.\nData collection: Broad ecological research and data collection is needed to inform effective management (e.g., species diversity, habitat types, disturbance regimes, etc.).\nMonitoring: The impacts of management methods are tracked, allowing for their outcomes to be evaluated and modified, if needed.\nAdaptive management: Management is an iterative process in which methods are continuously reevaluated as new scientific knowledge is gained.\nInteragency cooperation: As ecological boundaries often cross administrative boundaries, management often requires cooperation among a range of agencies and private stakeholders.\nOrganizational change: Successful implementation of management requires shifts in the structure and operation of land management agencies.\nHumans and nature: Nature and people are intrinsically linked and humans shape, and are shaped by, ecological processes.\nValues: Humans play a key role in guiding management goals, which reflect a stage in the continuing evolution of social values and priorities.\n\n\n== History ==\n\n\n=== Pre-industrialization ===\nSustainable ecosystem management approaches have been used by societies throughout human history. Prior to colonization, indigenous cultures often sustainably managed their natural resources through intergenerational traditional ecological knowledge (TEK). In TEK, cultures acquire knowledge of their environment over time and this information is passed on to future generations through cultural customs including folklore, religion, and taboos. Traditional management strategies vary by region; examples include the burning of the longleaf pine ecosystem by Native Americans in what is today the southeastern United States, the ban of seabird guano harvest during the breeding season by the Inca, the sustainable harvest practices of glaucous-winged gull eggs by the Huna Tlingit, and the Maya milpa intercropping approach (which is still used today).\n\n\n=== Post-industrialization ===\nIn industrialized Western society, ecosystems have been managed primarily to maximize yields of a particular natural resource. This method for managing ecosystems can be seen in the U.S. Forest Service's shift away from sustaining ecosystem health and toward maximizing timber production to support residential development following World War II. Furthermore, natural resource management has typically assumed a view that each ecosystem has a single best equilibrium and that minimizing variation around this equilibrium results in more dependable, greater yields of natural resources. For example, this perspective informed the long-held belief in forest fire suppression in the United States, which drove a decline in populations of fire-tolerant species and a buildup of fuel, leading to higher intensity fires. Additionally, these approaches to managing natural systems tended to (a) be site- and species-specific, rather than considering all components of an ecosystem collectively, (b) employ a “command and control” approach,  and (c) exclude stakeholders from management decisions.\nThe latter half of the 20th century saw a paradigm shift in how ecosystems were viewed, with a growing appreciation for the importance of ecological disturbance and for the intrinsic link between natural resources and overall ecosystem health. Simultaneously, there was acknowledgment of society's reliance on ecosystem services (beyond provisioning goods) and of the inextricable role human-environment interactions play in ecosystems. In sum, ecosystems were increasingly seen as complex systems shaped by non-linear and stochastic processes, and thus, they could not be managed to achieve single, fully predictable outcomes. As a result of these complexities and often unforeseeable feedback from management strategies, DeFries and Nagendra deemed ecosystem management to be a “wicked problem”. Thus, the outcome of natural resource management's \"evolution\" over the course of the 20th century is ecosystem management, which explicitly recognizes that technical and scientific knowledge, though necessary in all approaches to natural resource management, are insufficient in themselves.\n\n\n== Stakeholders ==\nStakeholders are individuals or groups who are affected by or have an interest in ecosystem management decisions and actions. Stakeholders may also have power to influence the goals, policies, and outcomes of management. Ecosystem management stakeholders fall into the following groups based on their diverse concerns:\n\nStakeholders whose lives are directly tied to the ecosystem (e.g., members of local community)\nStakeholders who are not directly impacted, but have an interest in the ecosystem or its ecosystem services (e.g., NGOs, recreational groups)\nStakeholders concerned with the decision-making processes (e.g., environmental advocacy groups)\nStakeholders funding management plans (e.g., taxpayers, funding agencies)\nStakeholders representing public interest (e.g., public officials)\n\n\n=== Strategies to stakeholder participation ===\nThe complexity of ecosystem management decisions, ranging from local to international scales, requires the participation of stakeholders with diverse understandings, perceptions, and values of ecosystems and ecosystem services. Due to these complexities, effective ecosystem management is flexible and develops reciprocal trust around issues of common interest, with the objective of creating mutually beneficial partnerships. Key attributes of successful participatory ecosystem management efforts have been identified:\n\nStakeholder involvement is inclusive, equitable, and focused on trust-building and empowerment.\nStakeholders are engaged early on, and their involvement continues beyond decision and into management.\nStakeholder analysis is performed to ensure parties are appropriately represented. This involves determining the stakeholders involved in the management issue; categorizing stakeholders based on their interest in and influence on the issue; and evaluating relationships between stakeholders.\nStakeholders agree upon the aims of the participatory process from its beginning, and the means and extent of stakeholder participation are case-specific.\nStakeholder participation is conducted through skilled facilitation.\nSocial, economic, and ecological goals are equally weighed, and stakeholders are actively involved in decision making, which is arrived at by collective consensus.\nStakeholders continually monitor management plan’s effectiveness.\nMultidisciplinary data are collected, reflecting multidisciplinary priorities, and decisions are informed by both local and scientific knowledge.\nEconomic incentives are provided to parties responsible for implementing management plans.\nTo ensure long-term stakeholder involvement, participation is institutionalized.\n\n\n=== Examples of stakeholder participation ===\nMalpai Borderland management:\nIn the early 1990s, there was ongoing conflict between the ranching and environmentalist communities in the Malpai Borderlands. The former group was concerned about sustaining their livelihoods, while the latter was concerned about the environmental impacts of livestock grazing. The groups found common ground around conserving and restoring rangeland, and diverse stakeholders, including ranchers, environmental groups, scientists, and government agencies, were engaged in management discussions. In 1994, the rancher-led Malpai Borderlands Group was created to collaboratively pursue the goals of ecosystem protection, management, and restoration.\nHelge å River & Kristianstads Vattenrike Biosphere Reserve:\nIn the 1980s, local government agencies and environmental groups noted declines in the health of the Helge å River ecosystem, including eutrophication, bird population declines, and deterioration of flooded meadows areas. There was concern that the Helge å, a Ramsar Wetland of International Importance, faced an imminent tipping point. In 1989, led by a municipal organization, a collaborative management strategy was adopted, involving diverse stakeholders concerned with the ecological, social, and economic facets of the ecosystem. The Kristianstads Vattenrike Biosphere Reserve was established in 2005 to promote the preservation of the ecosystem's socio-ecological services.\n\n\n== Strategies to ecosystem management ==\nSeveral strategies to implementing the maintenance and restoration of natural and human-modified ecosystem exist. Command and control management and traditional natural resource management are the precursors to ecosystem management. Adaptive management, strategic management, and landscape-level conservation are different methodologies and processes involved in implementing ecosystem management:\n\n\n=== Command and control management ===\n\nCommand and control management utilizes a linear problem solving approach, in which a perceived problem is resolved through controlling devices such as laws, threats, contracts, and/or agreements. This top-down approach is used across many disciplines, and it is best suited for addressing relatively simple, well-defined problems, which have a clear cause and effect, and for which there is broad societal agreement as to policy and management goals. In the context of natural systems, command and control management attempts to control nature in order to improve natural resource extractions, establish predictability, and reduce threats. Command and control strategies include the use of herbicides and pesticides to improve crop yields; the culling of predators to protect game bird species; and the safeguarding of timber supply, by suppressing forest fires.\nHowever, due to the complexities of ecological systems, command and control management may result in unintended consequences. For example, wolves were extirpated from Yellowstone National Park in the mid-1920s to reduce elk predation. Long-term studies of wolf, elk, and tree populations since wolf reintroduction in 1995 demonstrate that reintroduction has decreased elk populations, improving tree species recruitment. Thus, by controlling ecosystems to limit natural variation and increase predictability, command and control management often leads to a decline the resilience of ecological, social, and economic systems, termed the “pathology of natural resource management”. In this “pathology”, an initially successful command and control practice drives relevant institutions to shift their focus toward control, over time obscuring the ecosystem’s natural behavior, while the economy becomes reliant on the system in its controlled state. Consequently, there has been a transition away from command and control management, and increased focus on more holistic adaptive management approaches and on arriving at management solutions through partnerships between stakeholders.\n\n\n=== Natural resource management ===\n\nThe term natural resource management is frequently used in relation to a particular resource for human use, rather than the management of a whole ecosystem. Natural resource management aims to fulfill the societal demand for a given resource without causing harm to the ecosystem, or jeopardizing the future of the resource. Due to its focus on natural resources, socioeconomic factors significantly affect this management approach. Natural resource managers initially measure the overall condition of an ecosystem, and if the ecosystem's resources are healthy, the ideal degree of resource extraction is determined, which leaves enough to allow the resource to replenish itself for subsequent harvests. The condition of each resource in an ecosystem is subject to change at different spatial and time scales, and ecosystem attributes, such as watershed and soil health, and species diversity and abundance, need to be considered individually and collectively.\nInformed by natural resource management, the ecosystem management concept is based on the relationship between sustainable ecosystem maintenance and human demand for natural resources and other ecosystem services. To achieve these goals, ecosystem managers can be appointed to balance natural resource extraction and conservation over a long-term timeframe. Partnerships between ecosystem managers, natural resource managers, and stakeholders should be encouraged in order to promote the sustainable use of limited natural resources.\nHistorically, some ecosystems have experienced limited resource extraction and have been able to subsist naturally. Other ecosystems, such as forests, which in many regions provide considerable timber resources, have undergone successful reforestation and consequently, have accommodated the needs of future generations. As human populations grow, introducing new stressors to ecosystems, such as climate change, invasive species, land-use change, and habitat fragmentation, future demand for natural resources is unpredictable. Although ecosystem changes may occur gradually, their cumulative impacts can have negative effects for both humans and wildlife. Geographic information system (GIS) applications and remote sensing can be used to monitor and evaluate natural resources and ecosystem health.\n\n\n=== Adaptive management ===\nAdaptive management is based on the concept that predicting future influences and disturbances to an ecosystem is limited and unclear. Therefore, an ecosystem should be managed to it maintain the greatest degree of ecological integrity and management practices should have the ability to change based on new experience and insights. In an adaptive management strategy, a hypotheses about an ecosystem and its functioning is formed, and then management techniques to test these hypotheses are implemented. The implemented methods are then analyzed to evaluate if ecosystem health improved or declined, and further analysis allows for the modification of methods until they successfully meet the needs of the ecosystem. Thus, adaptive management is an iterative approach, encouraging “informed trial-and-error”.\nThis management approach has had mixed success in the field of ecosystem management, fisheries management, wildlife management, and forest management, possibly because ecosystem managers may not be equipped with the decision-making skills needed to undertake an adaptive management methodology. Additionally, economic, social, and political priorities can interfere with adaptive management decisions. For this reason, for adaptive management to be successful it must be a social and scientific process, focusing on institutional strategies while implementing experimental management techniques.\n\n\n=== Strategic management ===\nAs it relates to ecosystem management, strategic management encourages the establishment of goals that will sustain an ecosystem while keeping socioeconomic and politically relevant policy drivers in mind. This approach differs from other types of ecosystem management because it emphasizes stakeholders' involvement, relying on their input to develop the best management strategy for an ecosystem. Similar to other methods of ecosystem management, strategic management prioritizes evaluating and reviewing any impacts of management intervention on an ecosystem, and flexibility in adapting management protocols as a result of new information.\n\n\n=== Landscape-level conservation ===\n\nLandscape-level (or landscape-scale) conservation is a method that considers wildlife needs at a broader landscape scale when implementing conservation initiatives. By considering broad-scale, interconnected ecological systems, landscape-level conservation acknowledges the full scope of an environmental problem. Implementation of landscape-scale conservation is carried out in a number of ways. A wildlife corridor, for example, provides a connection between otherwise isolated habitat patches, presenting a solution to habitat fragmentation. These implementations can be found crossing over or under highways to reduce segmentation. In other instances, the habitat requirements of a keystone or vulnerable species is assessed to identify the best strategies for protecting the ecosystem and the species. However, simultaneously addressing the habitat requirements of multiple species in an ecosystem can be difficult, and as a result, more comprehensive approaches have been considered in landscape-level conservation.\nIn human-dominated landscapes, weighing the habitat requirements of wild flora and fauna versus the needs of humans presents challenges. Globally, human-induced environmental degradation is an increasing problem, which is why landscape-level approaches play an important role in ecosystem management. Traditional conservation methods targeted at individual species may need to be modified to include the maintenance of habitats through the consideration of both human and ecological factors.\n\n\n== See also ==\nEcosystem-based management\nEcosystem Management Decision Support\nSustainable forest management\nSustainable land management\n\n\n== References ==",
  "links": {
    "Abundance (ecology)": "",
    "Adaptive management": "",
    "Agroecosystem": "",
    "Bibcode (identifier)": "",
    "Biological diversity": "",
    "Biological organisation": "",
    "CiteSeerX (identifier)": "",
    "Climate change": "",
    "Close to nature forestry": "",
    "Command and control (management)": ""
  },
  "url": "https://en.wikipedia.org/wiki/Ecosystem_management"
}