{
  "title": "Electromagnetic theories of consciousness",
  "content": "Electromagnetic theories of consciousness propose that consciousness can be understood as an electromagnetic phenomenon.\n\n\n== Overview ==\nTheorists differ in how they relate consciousness to electromagnetism. Electromagnetic field theories (or \"EM field theories\") of consciousness propose that consciousness results when a brain produces an electromagnetic field with specific characteristics. Susan Pockett and Johnjoe McFadden have proposed EM field theories; William Uttal has criticized McFadden's and other field theories.\nIn general, quantum mind theories do not treat consciousness as an electromagnetic phenomenon, with a few exceptions. \nAR Liboff has proposed that \"incorporating EM field-mediated communication into models of brain function has the potential to reframe discussions surrounding consciousness\".\nAlso related are E. Roy John's work and Andrew and Alexander Fingelkurts theory \"Operational Architectonics framework of brain-mind functioning\".\n\n\n== Cemi theory ==\nThe starting point for McFadden and Pockett's theory is the fact that every time a neuron fires to generate an action potential, and a postsynaptic potential in the next neuron down the line, it also generates a disturbance in the surrounding electromagnetic field. McFadden has proposed that the brain's electromagnetic field creates a representation of the information in the neurons. Studies undertaken towards the end of the 20th century are argued to have shown that conscious experience correlates not with the number of neurons firing, but with the synchrony of that firing. McFadden views the brain's electromagnetic field as arising from the induced EM field of neurons. The synchronous firing of neurons is, in this theory, argued to amplify the influence of the brain's EM field fluctuations to a much greater extent than would be possible with the unsynchronized firing of neurons.\nMcFadden thinks that the EM field could influence the brain in a number of ways. Redistribution of ions could modulate neuronal activity, given that voltage-gated ion channels are a key element in the progress of axon spikes. Neuronal firing is argued to be sensitive to the variation of as little as one millivolt across the cell membrane, or the involvement of a single extra ion channel. Transcranial magnetic stimulation is similarly argued to have demonstrated that weak EM fields can influence brain activity.\nMcFadden proposes that the digital information from neurons is integrated to form a conscious electromagnetic information (cemi) field in the brain. Consciousness is suggested to be the component of this field that is transmitted back to neurons, and communicates its state externally. Thoughts are viewed as electromagnetic representations of neuronal information, and the experience of free will in our choice of actions is argued to be our subjective experience of the cemi field acting on our neurons.\nMcFadden's view of free will is deterministic. Neurons generate patterns in the EM field, which in turn modulate the firing of particular neurons. There is only conscious agency in the sense that the field or its download to neurons is conscious, but the processes of the brain themselves are driven by deterministic electromagnetic interactions. The feel of subjective experience or qualia corresponds to a particular configuration of the cemi field. This field representation is in this theory argued to integrate parts into a whole that has meaning, so a face is not seen as a random collection of features, but as somebody's face. The integration of information in the field is also suggested to resolve the binding/combination problem.\nIn 2013, McFadden published two updates to the theory. In the first, 'The CEMI Field Theory: Closing the Loop' McFadden cites recent experiments in the laboratories of Christof Koch  and David McCormick  which demonstrate that external EM fields, that simulate the brain's endogenous EM fields, influence neuronal firing patterns within brain slices. The findings are consistent with a prediction of the cemi field theory that the brain's endogenous EM field - consciousness - influences brain function. In the second, 'The CEMI Field Theory Gestalt Information and the Meaning of Meaning', McFadden claims that the cemi field theory provides a solution to the binding problem of how complex information is unified within ideas to provide meaning: the brain's EM field unifies the information encoded in millions of disparate neurons.\nSusan Pockett has advanced a theory, which has a similar physical basis to McFadden's, with consciousness seen as identical to certain spatiotemporal patterns of the EM field. However, whereas McFadden argues that his deterministic interpretation of the EM field is not out-of-line with mainstream thinking, Pockett suggests that the EM field comprises a universal consciousness that experiences the sensations, perceptions, thoughts and emotions of every conscious being in the universe. However, while McFadden thinks that the field is causal for actions, albeit deterministically, Pockett does not see the field as causal for our actions.\n\n\n== Quantum brain dynamics ==\n\nThe concepts underlying this theory derive from the physicists, Hiroomi Umezawa and Herbert Fröhlich in the 1960s. More recently, their ideas have been elaborated by Mari Jibu and Kunio Yasue. Water comprises 70% of the brain, and quantum brain dynamics (QBD) proposes that the electric dipoles of the water molecules constitute a quantum field, referred to as the cortical field, with corticons as the quanta of the field. This cortical field is postulated to interact with quantum coherent waves generated by the biomolecules in neurons, which are suggested to propagate along the neuronal network. The idea of quantum coherent waves in the neuronal network derives from Fröhlich. He viewed these waves as a means by which order could be maintained in living systems, and argued that the neuronal network could support long-range correlation of dipoles. This theory suggests that the cortical field not only interacts with the neuronal network, but also to a good extent controls it.\nThe proponents of QBD differ somewhat as to the way in which consciousness arises in this system. Jibu and Yasue suggest that the interaction between the energy quanta (corticons) of the quantum field and the biomolecular waves of the neuronal network produces consciousness. However, another theorist, Giuseppe Vitiello, proposes that the quantum states produce two poles, a subjective representation of the external world and also the internal self.\n\n\n== Advantages ==\nLocating consciousness in the brain's EM field, rather than the neurons, has the advantage of neatly accounting for how information located in millions of neurons scattered through the brain can be unified into a single conscious experience (called the binding problem): the information is unified in the EM field. In this way, EM field consciousness can be considered to be \"joined-up information\". This theory accounts for several otherwise puzzling facts, such as the finding that attention and awareness tend to be correlated with the synchronous firing of multiple neurons rather than the firing of individual neurons. When neurons fire together, their EM fields generate stronger EM field disturbances; so synchronous neuron firing will tend to have a larger impact on the brain's EM field (and thereby consciousness) than the firing of individual neurons. However their generation by synchronous firing is not the only important characteristic of conscious electromagnetic fields—in Pockett's original theory, spatial pattern is the defining feature of a conscious (as opposed to a non-conscious) field.\n\n\n== Objections ==\nIn a circa-2002 publication of The Journal of Consciousness Studies, the electromagnetic theory of consciousness faced an uphill battle for acceptance among cognitive scientists.\n\"No serious researcher I know believes in an electromagnetic theory of consciousness\", Bernard Baars wrote in an e-mail. Baars is a neurobiologist and co-editor of Consciousness and Cognition, another scientific journal in the field. \"It's not really worth talking about scientifically\", he was quoted as saying.\nMcFadden acknowledges that his theory, which he calls the \"cemi field theory\", is far from proven but he argues that it is certainly a legitimate line of scientific inquiry. His article underwent peer review before publication.\nThe field theories of consciousness do not appear to have been as widely discussed as other quantum consciousness theories, such as those of Penrose, Stapp or Bohm. However, David Chalmers argues against quantum consciousness. He instead discusses how quantum mechanics may relate to dualistic consciousness. Chalmers is skeptical that any new physics can resolve the hard problem of consciousness. He argues that quantum theories of consciousness suffer from the same weakness as more conventional theories. Just as he argues that there is no particular reason why particular macroscopic physical features in the brain should give rise to consciousness, he also thinks that there is no particular reason why a particular quantum feature, such as the EM field in the brain, should give rise to consciousness either. Despite the existence of transcranial magnetic stimulation with medical purposes, Y. H. Sohn, A. Kaelin-Lang and M. Hallett have denied it, and later Jeffrey Gray states in his book Consciousness: Creeping up on the Hard Problem, that tests looking for the influence of electromagnetic fields on brain function have been universally negative in their result. However, a number of studies have found clear neural effects from EM stimulation.\n\nDobson, et al. (2000): 1.8 millitesla = 18,000 mG\nThomas, et al. (2007): 400 microtesla = 4000 milligauss\nHuesser, et al. (1997): 0.1 millitesla = 1000 mG\nBell, et al. (2007) 0.78 Gauss = 780 mG\nMarino, et al. (2004): 1 Gauss = 1000 mG\nCarrubba, et al. (2008): 1 Gauss = 1000 mG\nJacobson (1994): 5 picotesla = 0.00005 mG\nSandyk (1999): Picotesla range\nIn April 2022, the results of two related experiments at the University of Alberta and Princeton University were announced at The Science of Consciousness conference, providing further evidence to support quantum processes operating within microtubules. In a study Stuart Hameroff was part of, Jack Tuszyński of the University of Alberta demonstrated that anesthetics hasten the duration of a process called delayed luminescence, in which microtubules and tubulins re-emit trapped light. Tuszyński suspects that the phenomenon has a quantum origin, with superradiance being investigated as one possibility. In the second experiment, Gregory D. Scholes and Aarat Kalra of Princeton University used lasers to excite molecules within tubulins, causing a prolonged excitation to diffuse through microtubules further than expected, which did not occur when repeated under anesthesia. However, diffusion results have to be interpreted carefully, since even classical diffusion can be very complex due to the wide range of length scales in the fluid filled extracellular space. Nevertheless, University of Oxford quantum physicist Vlatko Vedral told that this connection with consciousness is a really long shot.\nAlso in 2022, a group of Italian physicists conducted several experiments that failed to provide evidence in support of a gravity-related quantum collapse model of consciousness, weakening the possibility of a quantum explanation for consciousness.\n\n\n== Influence on brain function ==\nThe different EM field theories disagree as to the role of the proposed conscious EM field on brain function. In McFadden's cemi field theory, as well as in Drs Fingelkurts' Brain-Mind Operational Architectonics theory, the brain's global EM field modifies the electric charges across neural membranes, and thereby influences the probability that particular neurons will fire, providing a feed-back loop that drives free will. However, in the theories of Susan Pockett and E. Roy John, there is no necessary causal link between the conscious EM field and our consciously willed actions.\nReferences to \"Mag Lag\" also known as the subtle effect on cognitive processes of MRI machine operators who sometimes have to go into the scanner room to check the patients and deal with issues that occur during the scan could suggest a link between magnetic fields and consciousness. Memory loss and delays in information processing have been reported, in some cases several hours after exposure.\nOne hypothesis is that magnetic fields in the 0.5-9 Tesla range can affect the ion permeability of neural membranes, in fact this could account for a lot of the issues seen as this would affect many different brain functions.\n\n\n== Implications for artificial intelligence ==\nIf true, the theory has major implications for efforts to design consciousness into artificial intelligence machines; current microprocessor technology is designed to transmit information linearly along electrical channels, and more general electromagnetic effects are seen as a nuisance and damped out; if this theory is right, however, this is directly counterproductive to creating an artificially conscious computer, which on some versions of the theory would instead have electromagnetic fields that synchronized its outputs—or in the original version of the theory would have spatially patterned electromagnetic fields.\n\n\n== See also ==\nOrchestrated objective reduction\nQuantum mind\nQuantum neural network\n\n\n== References ==\n\n\n== External links ==\nThe electromagnetic field theory of consciousness, Scholarpedia\nConsciousness Based on Wireless?",
  "links": {
    "A Universe of Consciousness": "",
    "Action potential": "",
    "Agnosia": "",
    "Alfred North Whitehead": "",
    "Altered state of consciousness": "",
    "Anesthesia": "",
    "Anesthetic": "",
    "Anil Seth": "",
    "Animal consciousness": "",
    "Annaka Harris": ""
  },
  "url": "https://en.wikipedia.org/wiki/Electromagnetic_theories_of_consciousness"
}