{
  "title": "Empathy quotient",
  "content": "Empathy quotient (EQ) is a psychological self-report measure of empathy developed by Simon Baron-Cohen and Sally Wheelwright at the Autism Research Centre at the University of Cambridge. EQ is based on a definition of empathy that includes cognition and affect.\nAccording to the authors of the measure, empathy is a combination of the ability to feel an appropriate emotion in response to another's emotion and the ability to understand anothers' emotion (this is associated with the theory of mind). EQ was designed to fill a measurement gap by measuring empathy exclusively; other measures such as the Questionnaire Measure of Emotional Empathy and the Empathy Scale have multiple factors that are uncorrelated with empathy but are associated with social skills or the ability to be emotionally aroused in general. EQ tests the empathizing–systemizing theory, a theory that places individuals in different brain-type categories based on their tendencies toward empathy and system creation, and that was intended to determine clinically the role of lack of empathy in psychopathology, and in particular to screen for autism spectrum disorder.\n\n\n== Format and scoring ==\nThe EQ consists of 60 items: 40 items relating to empathy and 20 control items. \"On each empathy item a person can score 2, 1, or 0.\" A 40-item version of the test containing only the relevant questions is also available, but may be less reliable in certain applications. Each item is a first-person statement which the test-taker must rate as either \"strongly agree\", \"slightly agree\", \"slightly disagree\", or \"strongly disagree\". All questions must be answered for the test results to be valid.\nThe test is scored on a scale of 0 (the least empathetic possible) to 80 (the most empathetic possible). A useful cut-off of 30 was established to screen for autism-spectrum disorders.\n\n\n== Development of the measure ==\nTogether with the systematizing quotient, the empathy quotient tests Simon Baron-Cohen's empathizing-systemizing (E-S) theory of autism. This cognitive theory attempts to account for two aspects of autism disorder: the social and communication barriers and the narrow interest and attention to detail. Baron-Cohen associated the social and communication barriers with a lack of empathy – not only a lack of theory of mind but also an inability to respond to others' thoughts and emotions. He associated the narrow interest and attention to detail with a special ability to systematize or analyze. This theory is consistent with the findings that individuals with autism score significantly higher on the systemizing quotient and lower on the empathizing quotient than the general population. Although these score differences have been found consistently, there is controversy about whether the autistic brain differs qualitatively or quantitatively.\nE-S theory is also associated with a theory of autism called the extreme male brain theory. That theory is based on the finding that males score significantly higher on the systemizing quotient and lower on the empathy quotient than females in both adult and child populations, and that scores of the autistic population were also higher on systemizing and lower on empathizing but to an extreme. Baron-Cohen hypothesized that the tendencies of autistic scores to be similar to male scores might imply that the autistic brain is more like the male than the female brain in general, and that this might be due to prenatal testosterone. This hypothesis explains the sex difference in the prevalence of autism (male-female ratio: 4:1 for autism, 10.8:1 for Asperger syndrome).\nThe extreme male brain theory is controversial, and tests of the hypothesis had mixed findings on the correlation between biological indicators of prenatal testosterone and scores on the systemizing quotient and empathy quotient. Chapman et al. found that male children who had been exposed to more prenatal testosterone scored lower on the EQ, indicating that there is not only a sex difference in empathy but also a difference within the male population which is correlated with prenatal testosterone. There is also evidence against this theory. For example, one possible biomarker for prenatal testosterone's effect on the brain is a low ratio of the second to fourth finger (the 2D:4D ratio), which has been found to be associated with several male-specific psychological factors. A significantly lower 2D:4D ratio than the general population has been found in autistic individuals, however there was no correlation between the empathizing and systemizing quotients and the 2D:4D ratio. The authors give many possible explanations for this finding which are contrary to the extreme male brain theory of autism, for example it is possible that the psychometric properties of the quotients are lacking or that the theory itself is incorrect and the difference in autistic brains is not an extreme of normal functioning but of a different structure altogether.\n\n\n== Psychometric properties ==\nThere is evidence for the face validity of the EQ from the method by which the measure was created. In initial testing, the EQ was examined by a panel of six experimental psychologists, who were asked to rate the match of the items in the measure to the following definition of empathy: \"Empathy is the drive or ability to attribute mental states to another person/animal, and entails an appropriate affective response in the observer to the other person’s mental state.\" This definition is based on Baron-Cohen's theory of empathy which includes both a cognitive and affective response to another individual's emotions. Each of the 40 empathy items were rated as relating to the definition of empathy, while all 20 control items were rated as not related, by at least five out of six experimenters.\nThe EQ has also demonstrated other kinds of reliability. Lawrence et al. found strong inter-rater reliability and test-retest reliability for the EQ. They also found that the EQ has a moderate correlation with the \"empathetic concern\" and \"perspective taking\" sub-scales of the Interpersonal Reactivity Index This is another measure of empathy that the authors of the EQ considered to be the best empathy measure before creating their own, but which includes sub-scales that measure more than empathy. This indicates that the EQ has concurrent validity.\nThere has been concern that social desirability might influence EQ score because certain items correlate with the social desirability scale. It is suggested that these items either be dropped or that social desirability be measured in conjunction with the EQ. The authors of this study also suggest that the EQ be revised to include only 28 items divided into three separate categories of empathy including \"cognitive empathy, emotional reactivity, and social skills.\"\nDoubts have been raised about the validity and reliability of the EQ. One study found a lack of correlation between the EQ and the 2D:4D ratio, as mentioned above. That study did not directly measure the psychometric properties of the empathy quotient, but indicated that there may be an issue either with the E-S theory or with the measure itself.\n\n\n== Revised questionnaires ==\nBased on the findings about the psychometric properties of the EQ, there is evidence for the division of the EQ into three sub-categories (the three-factor model): cognitive empathy, emotional reactivity, and social skills. The original authors did not create those divisions because they considered it impossible to separate the cognitive from the emotional aspects of empathy.\nBased on an analysis of the internal consistency of the scale, a team which included the original authors found that the original questionnaire contained some irrelevant questions. They produced a shortened version of the scale containing 28 items. Principal component analysis indicated that this shortened questionnaire was able to measure empathy reliably.\nThe EQ has been translated into several languages including Serbian, Russian, and Dutch. The reliability of the Serbian 40-question scale was lower than the English version, and the original theory that empathy is a one-factor concept was not confirmed. The translation of the shortened 28-question version had higher reliability and there was evidence for the three-factor understanding of empathy. The Russian study also confirmed the three-factor model. A study of the Dutch version also confirmed the three-factor model, and indicated good cross-cultural validity in Europe and the US, but less so in Asia.\n\n\n== See also ==\nEmpathy\nEmotional intelligence\nEmotional thought method\n\n\n== References ==\n\n\n== External links ==\nEQ test – Online format",
  "links": {
    "Acceptance": "",
    "Action for Autism": "",
    "Acute stress reaction": "",
    "Admiration": "",
    "Adoration": "",
    "Aesthetic emotions": "",
    "Affect (education)": "",
    "Affect (psychology)": "",
    "Affect consciousness": "",
    "Affect measures": ""
  },
  "url": "https://en.wikipedia.org/wiki/Empathy_quotient"
}