{
  "title": "Entrepreneurial economics",
  "content": "Entrepreneurial economics is the field of study that focuses on the study of entrepreneur and entrepreneurship within the economy. The accumulation of factors of production per se does not explain economic development. They are necessary factors of production, but they are not sufficient for economic growth.\nWilliam Baumol wrote in American Economic Review that \"The theoretical firm is entrepreneurless – the Prince of Denmark has been expunged from the discussion of Hamlet\". The article was a prod to the economics profession to attend to this neglected factor.\nEntrepreneurship is difficult to analyse using the traditional tools of economics, e.g. calculus and general equilibrium models. Current textbooks have only a passing reference to the concept of entrepreneurship and the entrepreneur. Equilibrium models are central to mainstream economics, and exclude entrepreneurship.\nCoase believed that economics has become a \"theory-driven\" subject that has moved into a paradigm in which conclusions take precedence over problems. \"If you look at a page of a scientific journal like Nature,\" he said, \"every few weeks you have statements such as, 'We’ll have to think it out again. These results aren't going the way we thought they would.' Well, in economics, the results always go the way we thought they would because we approach the problems in the same way, only asking certain questions. Entrepreneurial Economics challenges fundamental principles, using insights from models and theories in the natural sciences.\"\nStudies about entrepreneurs in economics, psychology and sociology largely relate to four major currents of thought. Early thinkers such as Max Weber emphasized its occurrence in the context of a religious belief system, thereby suggesting that some belief systems do not encourage entrepreneurship. This contention has, however, been challenged by many sociologists. Karl Marx considered the economic system and mode of production as its sole determinants. Weber suggested a direct relationship between the ethics and economic system as both interacted intensively.\nAnother current of thought underscores the motivational aspects of personal achievement. This overemphasized the individual and his values, attitudes and personality. This thought, however, has been severely criticized by many scholars such as Kilby (1971) and Kunkel (1971).\n\n\n== Economic functions of the entrepreneur ==\n\n\n=== Richard Cantillon ===\nRichard Cantillon (1680?-1734) was the earliest scholar of whom we know that paid considerable attention to the entrepreneur. He introduced the very concept of entrepreneur. The entrepreneur is functionally described as arbitrager. The motivating factor is the potential profit generated from the activity of \"buying at a certain price and selling at an uncertain price\".\n\n\n=== Jean-Baptiste Say ===\nJean-Baptiste Say, who has been an entrepreneur during a period of his life, recognizes the \"superior kind of labour\" of the entrepreneur. He is the \"coordinator, modern leader and manager within his firm\". He is a kind of \"super-manager\" because the exercise of the function needs a combination of rare qualities and experience: \"Judgement, perseverance, and a knowledge of the world as well as of business...the art of superintendence and administration\". To Say, a successful entrepreneur must demonstrate prudence, probity and regularity.\n\n\n=== Frank Knight ===\nFrank Knight saw the entrepreneur as someone who undertakes business decisions under conditions of 'uncertainty'. Knightian uncertainty exists where there is no basis for objective probabilities, so that it is unmeasureable and decisions have to be made using subjective judgment. The entrepreneur earns economic profits as a reward for good judgment. Entrepreneurs are seen as being confident and venturesome.\n\n\n=== Schumpeter ===\nSchumpeter's concept is a synthesis of three different notions of the entrepreneur: risk bearer, innovator and a coordinator. He assigned the role of innovator to the entrepreneur, driving economic growth through a process of creative destruction, and not to the capitalist. Capitalists supply capital while entrepreneurs innovate. He stated that \"whatever the type, everyone is an entrepreneur only when he actually carries out a new combination and loses that character as soon as he has built up his business, when he settles to running it as other people run their business.\" The focus here is not on a category of person, but on a function. He was perhaps influenced by his family history.\nThe Schumpeterian entrepreneur disrupts existing equilibrium. Innovation is a chaotic, unpredictable economic process, which cannot be modeled using the equilibrium based analytic methods used in mainstream economic theory.\n\n\n=== Israel Kirzner ===\nIsrael Kirzner, an economist of the Austrian School, sees the entrepreneur as an arbitrageur who is alert to opportunities for profit that exist due to market disequilibrium.\n\n\n=== Harvey Leibenstein ===\nHarvey Leibenstein claimed that entrepreneurship is a creative response to x-inefficiency. Entrepreneurs are also gap-fillers, having the ability to perceive market opportunities and to develop new goods/services that are not currently being supplied. He postulates that entrepreneurs have the special ability to connect markets and make up for market deficiencies. Additionally, drawing from the theories of J.B. Say and Richard Cantillon, Leibenstein suggests that entrepreneurs have the ability to combine various inputs into new innovations in order to satisfy unfulfilled market demand.\n\n\n=== Baumol ===\nBaumol has argued that entrepreneurship can be either productive or unproductive. Unproductive entrepreneurs may pursue economic rents or crime. Societies differ significantly in how they allocate entrepreneurial activities between the two forms of entrepreneurship, depending on the 'rules of the game' such as the laws in each society.\n\n\n=== David Audretsch ===\nAudretsch defines the entrepreneur as the missing link between investment in knowledge and growth. It is the entrepreneur who adds value to scientific discovery. Entrepreneurship capital is then, just as capital and labor in a macroeconomic model, an essential factor of production in the economy.\n\n\n== See also ==\nSocial entrepreneurship\n\n\n== Further reading ==\nCasson, Mark C. (1982) The Entrepreneur: An Economic Theory, Oxford: Martin Robertson, [2nd. ed., Edward Elgar, 2003]\nChen J. (2005). The Physical Foundation of Economics – An Analytical Thermodynamic Theory. World Scientific.\nFarmer J.D., Shubik M., Smits E. (2005). Economics: The Next Physical Science?\nGlancey, Keith D., Mcquaid, Ronald W (2000) Entrepreneurial Economics. Palgrave Macmillan.\nTabarok A. (2002). Entrepreneurial Economics – Bright Ideas from The Dismal Science. Oxford University Press.\nVining G.T., Van Der Voort R. (2005). The Emergence of Entrepreneurial Economics. Elsevier.\nVogel J.H. (1989). Entrepreneurship, Evolution and the Entropy Law. The Journal of Behavioral Economics. Vol. 18, No. 3.\nSharma, Vivek, Workbook on Entrepreneurship (2005), Abza Publications, India\nParker, S. C. (2009). The economics of entrepreneurship. Cambridge University Press.\nNightingale P., Coad A. (2013). Muppets and Gazelles: Political and Methodological Biases in Entrepreneurship Research, SPRU Working Paper Series 2013-03, SPRU - Science and Technology Policy Research, University of Sussex.\n\n\n== References ==",
  "links": {
    "American Economic Review": "",
    "Austrian School": "",
    "Baumol": "",
    "Blackwell Publishing": "",
    "Capitalist": "",
    "Coase": "",
    "Creative destruction": "",
    "David Audretsch": "",
    "Discovery (observation)": "",
    "Doi (identifier)": ""
  },
  "url": "https://en.wikipedia.org/wiki/Entrepreneurial_economics"
}