{
  "title": "Epistemology",
  "content": "Epistemology is the branch of philosophy that examines the nature, origin, and limits of knowledge. Also called theory of knowledge, it explores different types of knowledge, such as propositional knowledge about facts, practical knowledge in the form of skills, and knowledge by acquaintance as a familiarity through experience. Epistemologists study the concepts of belief, truth, and justification to understand the nature of knowledge. To discover how knowledge arises, they investigate sources of justification, such as perception, introspection, memory, reason, and testimony.\nThe school of skepticism questions the human ability to attain knowledge while fallibilism says that knowledge is never certain. Empiricists hold that all knowledge comes from sense experience, whereas rationalists believe that some knowledge does not depend on it. Coherentists argue that a belief is justified if it coheres with other beliefs. Foundationalists, by contrast, maintain that the justification of basic beliefs does not depend on other beliefs. Internalism and externalism disagree about whether justification is determined solely by mental states or also by external circumstances.\nSeparate branches of epistemology are dedicated to knowledge found in specific fields, like scientific, mathematical, moral, and religious knowledge. Naturalized epistemology relies on empirical methods and discoveries, whereas formal epistemology uses formal tools from logic. Social epistemology investigates the communal aspect of knowledge and historical epistemology examines its historical conditions. Epistemology is closely related to psychology, which describes the beliefs people hold, while epistemology studies the norms governing the evaluation of beliefs. It also intersects with fields such as decision theory, education, and anthropology.\nEarly reflections on the nature, sources, and scope of knowledge are found in ancient Greek, Indian, and Chinese philosophy. The relation between reason and faith was a central topic in the medieval period. The modern era was characterized by the contrasting perspectives of empiricism and rationalism. Epistemologists in the 20th century examined the components, structure, and value of knowledge while integrating insights from the natural sciences and linguistics.\n\n\n== Definition ==\nEpistemology is the philosophical study of knowledge. Also called theory of knowledge, it examines what knowledge is and what types of knowledge there are. It further investigates the sources of knowledge, like perception, inference, and testimony, to determine how knowledge is created. Another topic is the extent and limits of knowledge, confronting questions about what people can and cannot know. Other central concepts include belief, truth, justification, evidence, and reason. Epistemology is one of the main branches of philosophy besides fields like ethics, logic, and metaphysics. The term is also used in a slightly different sense to refer not to the branch of philosophy but to the positions of particular philosophers within that branch, as in Plato's epistemology and Immanuel Kant's epistemology.\nAs a normative field of inquiry, epistemology explores how people should acquire beliefs. It determines which beliefs or forms of belief acquisition fulfill the standards or epistemic goals of knowledge and which ones fail, thereby providing an evaluation of beliefs. Descriptive fields of inquiry, like psychology and cognitive sociology, are also interested in beliefs and related cognitive processes. Unlike epistemology, they study the beliefs people have and how people acquire them instead of examining the evaluative norms of these processes. Epistemology is relevant to many descriptive and normative disciplines, such as the other branches of philosophy and the sciences, by exploring the principles of how they may arrive at knowledge.\nThe word epistemology comes from the ancient Greek terms ἐπιστήμη (episteme, meaning knowledge or understanding) and λόγος (logos, meaning study of or reason), literally, the study of knowledge. The word was only coined in the 19th century to label this field and conceive it as a distinct branch of philosophy.\n\n\n== Central concepts ==\nEpistemologists examine several foundational concepts to understand their essences and rely on them to formulate theories. Various epistemological disagreements have their roots in disputes about the nature and function of these concepts, like the controversies surrounding the definition of knowledge and the role of justification in it.\n\n\n=== Knowledge ===\n\nKnowledge is an awareness, familiarity, understanding, or skill. Its various forms all involve a cognitive success through which a person establishes epistemic contact with reality. Epistemologists typically understand knowledge as an aspect of individuals, generally as a cognitive mental state that helps them understand, interpret, and interact with the world. While this core sense is of particular interest to epistemologists, the term also has other meanings. For example, the epistemology of groups examines knowledge as a characteristic of a group of people who share ideas. The term can also refer to information stored in documents and computers.\nKnowledge contrasts with ignorance, which is often simply defined as the absence of knowledge. Knowledge is usually accompanied by ignorance since people rarely have complete knowledge of a field, forcing them to rely on incomplete or uncertain information when making decisions. Even though many forms of ignorance can be mitigated through education and research, there are certain limits to human understanding that are responsible for inevitable ignorance. Some limitations are inherent in the human cognitive faculties themselves, such as the inability to know facts too complex for the human mind to conceive. Others depend on external circumstances when no access to the relevant information exists. \nEpistemologists disagree on how much people know, for example, whether fallible beliefs can amount to knowledge or whether absolute certainty is required. The most stringent position is taken by radical skeptics, who argue that there is no knowledge at all.\n\n\n==== Types ====\n\nEpistemologists distinguish between different types of knowledge. Their primary interest is in knowledge of facts, called propositional knowledge. It is theoretical knowledge that can be expressed in declarative sentences using a that-clause, like \"Ravi knows that kangaroos hop\". For this reason, it is also called knowledge-that. Epistemologists often understand it as a relation between a knower and a known proposition, in the case above between the person Ravi and the proposition \"kangaroos hop\". It is use-independent since it is not tied to one specific purpose, unlike practical knowledge. It is a mental representation that embodies concepts and ideas to reflect reality. Because of its theoretical nature, it is often held that only creatures with highly developed minds, such as humans, possess propositional knowledge.\nPropositional knowledge contrasts with non-propositional knowledge in the form of knowledge-how and knowledge by acquaintance. Knowledge-how is a practical ability or skill, like knowing how to read or how to prepare lasagna. It is usually tied to a specific goal and not mastered in the abstract without concrete practice. To know something by acquaintance means to have an immediate familiarity with or awareness of it, usually as a result of direct experiential contact. Examples are \"familiarity with the city of Perth\", \"knowing the taste of tsampa\", and \"knowing Marta Vieira da Silva personally\".\nAnother influential distinction in epistemology is between a posteriori and a priori knowledge. A posteriori knowledge is knowledge of empirical facts based on sensory experience, like \"seeing that the sun is shining\" and \"smelling that a piece of meat has gone bad\". Knowledge belonging to the empirical science and knowledge of everyday affairs belongs to a posteriori knowledge. A priori knowledge is knowledge of non-empirical facts and does not depend on evidence from sensory experience, like knowing that \n  \n    \n      \n        2\n        +\n        2\n        =\n        4\n      \n    \n    {\\displaystyle 2+2=4}\n  \n. It belongs to fields such as mathematics and logic. The contrast between a posteriori and a priori knowledge plays a central role in the debate between empiricists and rationalists on whether all knowledge depends on sensory experience.\n\nA closely related contrast is between analytic and synthetic truths. A sentence is analytically true if its truth depends only on the meaning of the words it uses. For instance, the sentence \"all bachelors are unmarried\" is analytically true because the word \"bachelor\" already includes the meaning \"unmarried\". A sentence is synthetically true if its truth depends on additional facts. For example, the sentence \"snow is white\" is synthetically true because its truth depends on the color of snow in addition to the meanings of the words snow and white. A priori knowledge is primarily associated with analytic sentences while a posteriori knowledge is primarily associated with synthetic sentences. However, it is controversial whether this is true for all cases. Some philosophers, such as Willard Van Orman Quine, reject the distinction, saying that there are no analytic truths.\n\n\n==== Analysis ====\n\nThe analysis of knowledge is the attempt to identify the essential components or conditions of all and only propositional knowledge states. According to the so-called traditional analysis, knowledge has three components: it is a belief that is justified and true. In the second half of the 20th century, this view was put into doubt by a series of thought experiments that aimed to show that some justified true beliefs do not amount to knowledge. In one of them, a person is unaware of all the fake barns in their area. By coincidence, they stop in front of the only real barn and form a justified true belief that it is a real barn. Many epistemologists agree that this is not knowledge because the justification is not directly relevant to the truth. More specifically, this and similar counterexamples involve some form of epistemic luck, that is, a cognitive success that results from fortuitous circumstances rather than competence.\n\nFollowing these thought experiments, philosophers proposed various alternative definitions of knowledge by modifying or expanding the traditional analysis. According to one view, the known fact has to cause the belief in the right way. Another theory states that the belief is the product of a reliable belief formation process. Further approaches require that the person would not have the belief if it was false, that the belief is not inferred from a falsehood, that the justification cannot be undermined, or that the belief is infallible. There is no consensus on which of the proposed modifications and reconceptualizations is correct. Some philosophers, such as Timothy Williamson, reject the basic assumption underlying the analysis of knowledge by arguing that propositional knowledge is a unique state that cannot be dissected into simpler components.\n\n\n==== Value ====\nThe value of knowledge is the worth it holds by expanding understanding and guiding action. Knowledge can have instrumental value by helping a person achieve their goals. For example, knowledge of a disease helps a doctor cure their patient. The usefulness of a known fact depends on the circumstances. Knowledge of some facts may have little to no uses, like memorizing random phone numbers from an outdated phone book. Being able to assess the value of knowledge matters in choosing what information to acquire and transmit to others. It affects decisions like which subjects to teach at school and how to allocate funds to research projects.\nOf particular interest to epistemologists is the question of whether knowledge is more valuable than a mere opinion that is true. Knowledge and true opinion often have a similar usefulness since both are accurate representations of reality. For example, if a person wants to go to Larissa, a true opinion about how to get there may help them in the same way as knowledge does. Considering this problem, Plato proposed that knowledge is better because it is more stable. Another suggestion focuses on practical reasoning. It proposes that people put more trust in knowledge than in mere true opinions when drawing conclusions and deciding what to do. A different response says that, unlike mere true opinion, knowledge has intrinsic value in addition to instrumental value. This view asserts that knowledge is always valuable, while true opinion is only valuable in circumstances where it is useful.\n\n\n=== Belief and truth ===\n\nBeliefs are mental states about what is the case, like believing that snow is white or that God exists. In epistemology, they are often understood as subjective attitudes that affirm or deny a proposition, which can be expressed in a declarative sentence. For instance, to believe that snow is white is to affirm the proposition \"snow is white\". According to this view, beliefs are representations of what the universe is like. They are kept in memory and can be retrieved when actively thinking about reality or when deciding how to act. A different view understands beliefs as behavioral patterns or dispositions to act rather than as representational items stored in the mind. According to this view, to believe that there is mineral water in the fridge is nothing more than a group of dispositions related to mineral water and the fridge. Examples are the dispositions to answer questions about the presence of mineral water affirmatively and to go to the fridge when thirsty. Some theorists deny the existence of beliefs, saying that this concept borrowed from folk psychology is an oversimplification of much more complex psychological or neurological processes. Beliefs play a central role in various epistemological debates, which cover their status as a component of propositional knowledge, the question of whether people have control over and are responsible for their beliefs, and the issue of whether there are degrees of beliefs, called credences.\nAs propositional attitudes, beliefs are true or false depending on whether they affirm a true or a false proposition. According to the correspondence theory of truth, to be true means to stand in the right relation to the world by accurately describing what it is like. This means that truth is objective: a belief is true if it corresponds to a fact. The coherence theory of truth says that a belief is true if it belongs to a coherent system of beliefs. A result of this view is that truth is relative since it depends on other beliefs. Further theories of truth include pragmatist, semantic, pluralist, and deflationary theories. Truth plays a central role in epistemology as a goal of cognitive processes and an attribute of propositional knowledge.\n\n\n=== Justification ===\n\nIn epistemology, justification is a property of beliefs that fulfill certain norms about what a person should believe. According to a common view, this means that the person has sufficient reasons for holding this belief because they have information that supports it. Another view states that a belief is justified if it is formed by a reliable belief formation process, such as perception. The terms reasonable, warranted, and supported are closely related to the idea of justification and are sometimes used as synonyms. Justification is what distinguishes justified beliefs from superstition and lucky guesses. However, justification does not guarantee truth. For example, if a person has strong but misleading evidence, they may form a justified belief that is false.\nEpistemologists often identify justification as one component of knowledge. Usually, they are not only interested in whether a person has a sufficient reason to hold a belief, known as propositional justification, but also in whether the person holds the belief because or based on this reason, known as doxastic justification. For example, if a person has sufficient reason to believe that a neighborhood is dangerous but forms this belief based on superstition then they have propositional justification but lack doxastic justification.\n\n\n==== Sources ====\nSources of justification are ways or cognitive capacities through which people acquire justification. Often-discussed sources include perception, introspection, memory, reason, and testimony, but there is no universal agreement to what extent they all provide valid justification. Perception relies on sensory organs to gain empirical information. There are various forms of perception corresponding to different physical stimuli, such as visual, auditory, haptic, olfactory, and gustatory perception. Perception is not merely the reception of sense impressions but an active process that selects, organizes, and interprets sensory signals. Introspection is a closely related process focused not on external physical objects but on internal mental states. For example, seeing a bus at a bus station belongs to perception while feeling tired belongs to introspection.\nRationalists understand reason as a source of justification for non-empirical facts. It is often used to explain how people can know about mathematical, logical, and conceptual truths. Reason is also responsible for inferential knowledge, in which one or several beliefs are used as premises to support another belief. Memory depends on information provided by other sources, which it retains and recalls, like remembering a phone number perceived earlier. Justification by testimony relies on information one person communicates to another person. This can happen by talking to each other but can also occur in other forms, like a letter, a newspaper, and a blog.\n\n\n=== Other concepts ===\nRationality is closely related to justification and the terms rational belief and justified belief are sometimes used as synonyms. However, rationality has a wider scope that encompasses both a theoretical side, covering beliefs, and a practical side, covering decisions, intentions, and actions. There are different conceptions about what it means for something to be rational. According to one view, a mental state is rational if it is based on or responsive to good reasons. Another view emphasizes the role of coherence, stating that rationality requires that the different mental states of a person are consistent and support each other. A slightly different approach holds that rationality is about achieving certain goals. Two goals of theoretical rationality are accuracy and comprehensiveness, meaning that a person has as few false beliefs and as many true beliefs as possible.\nEpistemic norms are criteria to assess the cognitive quality of beliefs, like their justification and rationality. Epistemologists distinguish between deontic norms, which are prescriptions about what people should believe or which beliefs are correct, and axiological norms, which identify the goals and values of beliefs. Epistemic norms are closely related to intellectual or epistemic virtues, which are character traits like open-mindedness and conscientiousness. Epistemic virtues help individuals form true beliefs and acquire knowledge. They contrast with epistemic vices and act as foundational concepts of virtue epistemology.\nEvidence for a belief is information that favors or supports it. Epistemologists understand evidence primarily in terms of mental states, for example, as sensory impressions or as other propositions that a person knows. But in a wider sense, it can also include physical objects, like bloodstains examined by forensic analysts or financial records studied by investigative journalists. Evidence is often understood in terms of probability: evidence for a belief makes it more likely that the belief is true. A defeater is evidence against a belief or evidence that undermines another piece of evidence. For instance, witness testimony connecting a suspect to a crime is evidence of their guilt while an alibi is a defeater. Evidentialists analyze justification in terms of evidence by saying that to be justified, a belief needs to rest on adequate evidence.\nThe presence of evidence usually affects doubt and certainty, which are subjective attitudes toward propositions that differ regarding their level of confidence. Doubt involves questioning the validity or truth of a proposition. Certainty, by contrast, is a strong affirmative conviction, meaning that the person is free of doubt that the proposition is true. In epistemology, doubt and certainty play central roles in attempts to find a secure foundation of all knowledge and in skeptical projects aiming to establish that no belief is immune to doubt.\nWhile propositional knowledge is the main topic in epistemology, some theorists focus on understanding instead. Understanding is a more holistic notion that involves a wider grasp of a subject. To understand something, a person requires awareness of how different things are connected and why they are the way they are. For example, knowledge of isolated facts memorized from a textbook does not amount to understanding. According to one view, understanding is a special epistemic good that, unlike propositional knowledge, is always intrinsically valuable. Wisdom is similar in this regard and is sometimes considered the highest epistemic good. It encompasses a reflective understanding with practical applications. It helps people grasp and evaluate complex situations and lead a good life.\n\n\n== Schools of thought ==\n\n\n=== Skepticism, fallibilism, and relativism ===\n\nPhilosophical skepticism questions the human ability to arrive at knowledge. Some skeptics limit their criticism to certain domains of knowledge. For example, religious skeptics say that it is impossible to have certain knowledge about the existence of deities or other religious doctrines. Similarly, moral skeptics challenge the existence of moral knowledge and metaphysical skeptics say that humans cannot know ultimate reality.\nGlobal skepticism is the widest form of skepticism, asserting that there is no knowledge in any domain. In ancient philosophy, this view was accepted by academic skeptics while Pyrrhonian skeptics recommended the suspension of belief to achieve a state of tranquility. Overall, not many epistemologists have explicitly defended global skepticism. The influence of this position derives mainly from attempts by other philosophers to show that their theory overcomes the challenge of skepticism. For example, René Descartes used methodological doubt to find facts that cannot be doubted.\nOne consideration in favor of global skepticism is the dream argument. It starts from the observation that, while people are dreaming, they are usually unaware of this. This inability to distinguish between dream and regular experience is used to argue that there is no certain knowledge since a person can never be sure that they are not dreaming. Some critics assert that global skepticism is a self-refuting idea because denying the existence of knowledge is itself a knowledge claim. Another objection says that the abstract reasoning leading to skepticism is not convincing enough to overrule common sense.\nFallibilism is another response to skepticism. Fallibilists agree with skeptics that absolute certainty is impossible. Most fallibilists disagree with skeptics about the existence of knowledge, saying that there is knowledge since it does not require absolute certainty. They emphasize the need to keep an open and inquisitive mind since doubt can never be fully excluded, even for well-established knowledge claims like thoroughly tested scientific theories.\nEpistemic relativism is a related view. It does not question the existence of knowledge in general but rejects the idea that there are universal epistemic standards or absolute principles that apply equally to everyone. This means that what a person knows depends on the subjective criteria or social conventions used to assess epistemic status.\n\n\n=== Empiricism and rationalism ===\n\nThe debate between empiricism and rationalism centers on the origins of human knowledge. Empiricism emphasizes that sense experience is the primary source of all knowledge. Some empiricists express this view by describing the mind as a blank slate that only develops ideas about the external world through the sense data it receives from the sensory organs. According to them, the mind can arrive at various additional insights by comparing impressions, combining them, generalizing to arrive at more abstract ideas, and deducing new conclusions from them. Empiricists say that all these mental operations depend on material from the senses and do not function on their own.\nEven though rationalists usually accept sense experience as one source of knowledge, they also say that important forms of knowledge are directly possessed by reason without sense experience, like knowledge of mathematical and logical truths. According to some rationalists, the mind possesses inborn ideas, which it can access without the help of the senses. Others hold that there is an additional cognitive faculty, sometimes called rational intuition, through which people acquire nonempirical knowledge. Some rationalists limit their discussion to the origin of concepts, saying that the mind relies on inborn categories to understand the world and organize experience.\n\n\n=== Foundationalism and coherentism ===\n\nFoundationalists and coherentists disagree about the structure of knowledge. Foundationalism distinguishes between basic and non-basic beliefs. A belief is basic if it is justified directly, meaning that its validity does not depend on the support of other beliefs. A belief is non-basic if it is justified by another belief. For example, the belief that it rained last night is a non-basic belief if it is inferred from the observation that the street is wet. According to foundationalism, basic beliefs are the foundation on which all other knowledge is built while non-basic beliefs act as the superstructure resting on this foundation.\nCoherentists reject the distinction between basic and non-basic beliefs, saying that the justification of any belief depends on other beliefs. They assert that a belief must be in tune with other beliefs to amount to knowledge. This is the case if the beliefs are consistent and support each other. According to coherentism, justification is a holistic aspect determined by the whole system of beliefs, which resembles an interconnected web.\nThe view of foundherentism is an intermediary position combining elements of both foundationalism and coherentism. It accepts the distinction between basic and non-basic beliefs while asserting that the justification of non-basic beliefs depends on coherence with other beliefs.\nInfinitism presents another approach to the structure of knowledge. It agrees with coherentism that there are no basic beliefs while rejecting the view that beliefs can support each other in a circular manner. Instead, it argues that beliefs form infinite justification chains, in which each link of the chain supports the belief following it and is supported by the belief preceding it.\n\n\n=== Internalism and externalism ===\n\nThe disagreement between internalism and externalism is about the sources of justification. Internalists say that justification depends only on factors within the individual. Examples of such factors include perceptual experience, memories, and the possession of other beliefs. This view emphasizes the importance of the cognitive perspective of the individual in the form of their mental states. It is commonly associated with the idea that the relevant factors are accessible, meaning that the individual can become aware of their reasons for holding a justified belief through introspection and reflection.\nExternalism rejects this view, saying that at least some relevant factors are external to the individual. For instance, when considering the belief that a cup of coffee stands on the table, externalists are not primarily interested in the subjective perceptual experience that led to this belief. Instead, they focus on objective factors, like the quality of the person's eyesight, their ability to differentiate coffee from other beverages, and the circumstances under which they observed the cup. A key motivation of many forms of externalism is that justification makes it more likely that a belief is true. Based on this view, justification is external to the extent that some factors contributing to this likelihood are not part of the believer's cognitive perspective.\nEvidentialism is an influential internalist view. It says that justification depends on the possession of evidence. In this context, evidence for a belief is any information in the individual's mind that supports the belief. For example, the perceptual experience of rain is evidence for the belief that it is raining. Evidentialists have suggested various other forms of evidence, including memories, intuitions, and other beliefs. According to evidentialism, a belief is justified if the individual's evidence supports the belief and they hold the belief on the basis of this evidence.\nReliabilism is an externalist theory asserting that a reliable connection between belief and truth is required for justification. Some reliabilists explain this in terms of reliable processes. According to this view, a belief is justified if it is produced by a reliable belief-formation process, like perception. A belief-formation process is reliable if most of the beliefs it causes are true. A slightly different view focuses on beliefs rather than belief-formation processes, saying that a belief is justified if it is a reliable indicator of the fact it presents. This means that the belief tracks the fact: the person believes it because it is a fact but would not believe it otherwise.\nVirtue epistemology is another type of externalism and is sometimes understood as a form of reliabilism. It says that a belief is justified if it manifests intellectual virtues. Intellectual virtues are capacities or traits that perform cognitive functions and help people form true beliefs. Suggested examples include faculties like vision, memory, and introspection.\n\n\n=== Others ===\nIn the epistemology of perception, direct and indirect realists disagree about the connection between the perceiver and the perceived object. Direct realists say that this connection is direct, meaning that there is no difference between the object present in perceptual experience and the physical object causing this experience. According to indirect realism, the connection is indirect since there are mental entities, like ideas or sense data, that mediate between the perceiver and the external world. The contrast between direct and indirect realism is important for explaining the nature of illusions.\nConstructivism in epistemology is the theory that how people view the world is not a simple reflection of external reality but an invention or a social construction. This view emphasizes the creative role of interpretation while undermining objectivity since social constructions may differ from society to society.\nAccording to contrastivism, knowledge is a comparative term, meaning that to know something involves distinguishing it from relevant alternatives. For example, if a person spots a bird in the garden, they may know that it is a sparrow rather than an eagle but they may not know that it is a sparrow rather than an indistinguishable sparrow hologram.\nEpistemic conservatism is a view about belief revision. It gives preference to the beliefs a person already has, asserting that a person should only change their beliefs if they have a good reason to. One motivation for adopting epistemic conservatism is that the cognitive resources of humans are limited, meaning that it is not feasible to constantly reexamine every belief.\nPragmatist epistemology is a form of fallibilism that emphasizes the close relation between knowing and acting. It sees the pursuit of knowledge as an ongoing process guided by common sense and experience while always open to revision. It reinterprets some core epistemological notions, for example, by conceptualizing beliefs as habits that shape actions rather then as representations that mirror the world.\nBayesian epistemology is a formal approach based on the idea that people have degrees of belief representing how certain they are. It uses probability theory to define norms of rationality that govern how certain people should be about their beliefs.\nPhenomenological epistemology emphasizes the importance of first-person experience. It distinguishes between the natural and the phenomenological attitudes. The natural attitude focuses on objects belonging to common sense and natural science. The phenomenological attitude focuses on the experience of objects and aims to provide a presuppositionless description of how objects appear to the observer.\nParticularism and generalism disagree about the right method of conducting epistemological research. Particularists start their inquiry by looking at specific cases. For example, to find a definition of knowledge, they rely on their intuitions about concrete instances of knowledge and particular thought experiments. They use these observations as methodological constraints that any theory of more general principles needs to follow. Generalists proceed in the opposite direction. They give preference to general epistemic principles, saying that it is not possible to accurately identify and describe specific cases without a grasp of these principles. Other methods in contemporary epistemology aim to extract philosophical insights from ordinary language or look at the role of knowledge in making assertions and guiding actions.\n\nPostmodern epistemology criticizes the conditions of knowledge in advanced societies. This concerns in particular the metanarrative of a constant progress of scientific knowledge leading to a universal and foundational understanding of reality. Feminist epistemology critiques the effect of gender on knowledge. Among other topics, it explores how preconceptions about gender influence who has access to knowledge, how knowledge is produced, and which types of knowledge are valued in society. Decolonial scholarship criticizes the global influence of Western knowledge systems, often with the aim of decolonizing knowledge to undermine Western hegemony.\nVarious schools of epistemology are found in traditional Indian philosophy. Many of them focus on the different sources of knowledge, called pramāṇa. Perception, inference, and testimony are sources discussed by most schools. Other sources only considered by some schools are non-perception, which leads to knowledge of absences, and presumption. Buddhist epistemology tends to focus on immediate experience, understood as the presentation of unique particulars without the involvement of secondary cognitive processes, like thought and desire. Nyāya epistemology is a causal theory of knowledge, understanding sources of knowledge as reliable processes that cause episodes of truthful awareness. It sees perception as the primary source of knowledge and emphasizes its importance for successful action. Mīmāṃsā epistemology understands the holy scriptures known as the Vedas as a key source of knowledge while discussing the problem of their right interpretation. Jain epistemology states that reality is many-sided, meaning that no single viewpoint can capture the entirety of truth.\nAfrican epistemology is rooted in African ontology. It emphasizes the interconnectedness of reality in the form of a continuum between knowing subject and known object. It understands knowledge as a holistic phenomenon that includes sensory, emotional, intuitive, and rational aspects and is not limited to the physical domain.\n\n\n== Branches ==\nSome branches of epistemology focus on the problems of knowledge within specific academic disciplines. The epistemology of science examines how scientific knowledge is generated and what problems arise in the process of validating, justifying, and interpreting scientific claims. A key issue concerns the problem of how individual observations can support universal scientific laws. Further topics include the nature of scientific evidence and the aims of science. The epistemology of mathematics studies the origin of mathematical knowledge. In exploring how mathematical theories are justified, it investigates the role of proofs and whether there are empirical sources of mathematical knowledge.\nEpistemological problems are found in most areas of philosophy. The epistemology of logic examines how people know that an argument is valid. For example, it explores how logicians justify that modus ponens is a correct rule of inference or that all contradictions are false. Epistemologists of metaphysics investigate whether knowledge of the basic structure of reality is possible and what sources this knowledge could have. Knowledge of moral statements, like the claim that lying is wrong, belongs to the epistemology of ethics. It studies the role of ethical intuitions, coherence among moral beliefs, and the problem of moral disagreement. The ethics of belief is a closely related field covering the interrelation between epistemology and ethics. It examines the norms governing belief formation and asks whether violating them is morally wrong.\nReligious epistemology studies the role of knowledge and justification for religious doctrines and practices. It evaluates the weight and reliability of evidence from religious experience and holy scriptures while also asking whether the norms of reason should be applied to religious faith. Social epistemology focuses on the social dimension of knowledge. While traditional epistemology is mainly interested in the knowledge possessed by individuals, social epistemology covers knowledge acquisition, transmission, and evaluation within groups, with specific emphasis on how people rely on each other when seeking knowledge. Historical epistemology examines how the understanding of knowledge and related concepts has changed over time. It asks whether the main issues in epistemology are perennial and to what extent past epistemological theories are relevant to contemporary debates. It is particularly concerned with scientific knowledge and practices associated with it. It contrasts with the history of epistemology, which presents, reconstructs, and evaluates epistemological theories of philosophers in the past. \nNaturalized epistemology is closely associated with the natural sciences, relying on their methods and theories to examine knowledge. Naturalistic epistemologists focus on empirical observation to formulate their theories and are often critical of approaches to epistemology that proceed by a priori reasoning. Evolutionary epistemology is a naturalistic approach that understands cognition as a product of evolution, examining knowledge and the cognitive faculties responsible for it from the perspective of natural selection. Epistemologists of language explore the nature of linguistic knowledge. One of their topics is the role of tacit knowledge, for example, when native speakers have mastered the rules of grammar but are unable to explicitly articulate those rules. Epistemologists of modality examine knowledge about what is possible and necessary. Epistemic problems that arise when two people have diverging opinions on a topic are covered by the epistemology of disagreement. Epistemologists of ignorance are interested in epistemic faults and gaps in knowledge.\nThere are distinct areas of epistemology dedicated to specific sources of knowledge. Examples are the epistemology of perception, the epistemology of memory, and the epistemology of testimony.\nSome branches of epistemology are characterized by their research method. Formal epistemology employs formal tools found in logic and mathematics to investigate the nature of knowledge. Experimental epistemologists rely in their research on empirical evidence about common knowledge practices. Applied epistemology focuses on the practical application of epistemological principles to diverse real-world problems, like the reliability of knowledge claims on the internet, how to assess sexual assault allegations, and how racism may lead to epistemic injustice.\nMetaepistemologists examine the nature, goals, and research methods of epistemology. As a metatheory, it does not directly defend a position about which epistemological theories are correct but examines their fundamental concepts and background assumptions.\n\n\n== Related fields ==\nEpistemology and psychology were not defined as distinct fields until the 19th century; earlier investigations about knowledge often do not fit neatly into today's academic categories. Both contemporary disciplines study beliefs and the mental processes responsible for their formation and change. One important contrast is that psychology describes what beliefs people have and how they acquire them, thereby explaining why someone has a specific belief. The focus of epistemology is on evaluating beliefs, leading to a judgment about whether a belief is justified and rational in a particular case. Epistemology has a similar intimate connection to cognitive science, which understands mental events as processes that transform information. Artificial intelligence relies on the insights of epistemology and cognitive science to implement concrete solutions to problems associated with knowledge representation and automatic reasoning. \nLogic is the study of correct reasoning. For epistemology, it is relevant to inferential knowledge, which arises when a person reasons from one known fact to another. This is the case, for example, if a person does not know directly that \n  \n    \n      \n        572\n        +\n        382\n        =\n        954\n      \n    \n    {\\displaystyle 572+382=954}\n  \n but comes to infer it based on their knowledge that \n  \n    \n      \n        2\n        +\n        2\n        =\n        4\n      \n    \n    {\\displaystyle 2+2=4}\n  \n, \n  \n    \n      \n        8\n        +\n        7\n        =\n        15\n      \n    \n    {\\displaystyle 8+7=15}\n  \n, and \n  \n    \n      \n        5\n        +\n        3\n        =\n        8\n      \n    \n    {\\displaystyle 5+3=8}\n  \n. Whether an inferential belief amounts to knowledge depends on the form of reasoning used, in particular, that the process does not violate the laws of logic. Another overlap between the two fields is found in the epistemic approach to fallacies. Fallacies are faulty arguments based on incorrect reasoning. The epistemic approach to fallacies explains why they are faulty, stating that arguments aim to expand knowledge. According to this view, an argument is a fallacy if it fails to do so. A further intersection is found in epistemic logic, which uses formal logical devices to study epistemological concepts like knowledge and belief.\nBoth decision theory and epistemology are interested in the foundations of rational thought and the role of beliefs. Unlike many approaches in epistemology, the main focus of decision theory lies less in the theoretical and more in the practical side, exploring how beliefs are translated into action. Decision theorists examine the reasoning involved in decision-making and the standards of good decisions. They identify beliefs as a central aspect of decision-making. One of their innovations is to distinguish between weaker and stronger beliefs. This helps them take the effect of uncertainty on decisions into consideration.\nEpistemology and education have a shared interest in knowledge, with one difference being that education focuses on the transmission of knowledge, exploring the roles of both learner and teacher. Learning theory examines how people acquire knowledge. Behavioral learning theories explain the process in terms of behavior changes, for example, by associating a certain response with a particular stimulus. Cognitive learning theories study how the cognitive processes that affect knowledge acquisition transform information. Pedagogy looks at the transmission of knowledge from the teacher's side, exploring the teaching methods they may employ. In teacher-centered methods, the teacher takes the role of the main authority delivering knowledge and guiding the learning process. In student-centered methods, the teacher mainly supports and facilitates the learning process while the students take a more active role. The beliefs students have about knowledge, called personal epistemology, affect their intellectual development and learning success.\nThe anthropology of knowledge examines how knowledge is acquired, stored, retrieved, and communicated. It studies the social and cultural circumstances that affect how knowledge is reproduced and changes, covering the role of institutions like university departments and scientific journals as well as face-to-face discussions and online communications. It understands knowledge in a wide sense that encompasses various forms of understanding and culture, including practical skills. Unlike epistemology, it is not interested in whether a belief is true or justified but in how understanding is reproduced in society. The sociology of knowledge is a closely related field with a similar conception of knowledge. It explores how physical, demographic, economic, and sociocultural factors impact knowledge. It examines in what sociohistorical contexts knowledge emerges and the effects it has on people, for example, how socioeconomic conditions are related to the dominant ideology in a society.\n\n\n== History ==\n\nEarly reflections on the nature and sources of knowledge are found in ancient history. In ancient Greek philosophy, Plato (427–347 BCE) studied what knowledge is, examining how it differs from true opinion by being based on good reasons. According to him, the process of learning something is a form of recollection in which the soul remembers what it already knew before. Aristotle (384–322 BCE) was particularly interested in scientific knowledge, exploring the role of sensory experience and how to make inferences from general principles. The Hellenistic schools, which began to arise in the 4th century BCE, included Epicureanism, Stoicism, and skepticism. The Epicureans had an empiricist outlook, stating that sensations are always accurate and act as the supreme standard of judgments. The Stoics defended a similar position but limited themselves to lucid and specific sensations, which they regarded as true. The skepticists questioned that knowledge is possible, recommending instead suspension of judgment to arrive at a state of tranquility. Emerging in the 3rd century CE, Neoplatonism distinguished knowledge from true belief, arguing that knowledge is infallible and limited to the realm of immaterial forms.\n\nThe Upanishads, philosophical scriptures composed in ancient India between 700 and 300 BCE, examined how people acquire knowledge, including the role of introspection, comparison, and deduction. In the 6th century BCE, the school of Ajñana developed a radical skepticism questioning the possibility and usefulness of knowledge. The school of Nyaya emerged in the 2nd century BCE and provided a systematic treatment of how people acquire knowledge, distinguishing between valid and invalid sources. When Buddhist philosophers later became interested in epistemology, they relied on concepts developed in Nyaya and other traditions. Buddhist philosopher Dharmakirti (6th or 7th century CE) analyzed the process of knowing as a series of causally related events.\nAncient Chinese philosophers understood knowledge as an interconnected phenomenon fundamentally linked to ethical behavior and social involvement. Many saw wisdom as the goal of attaining knowledge. Mozi (470–391 BCE) proposed a pragmatic approach to knowledge using historical records, sensory evidence, and practical outcomes to validate beliefs. Mencius (c. 372–289 BCE) explored analogical reasoning as another source of knowledge. Xunzi (c. 310-220 BCE) aimed to combine empirical observation and rational inquiry. He emphasized the importance of clarity and standards of reasoning without excluding the role of feeling and emotion.\nThe relation between reason and faith was a central topic in the medieval period. In Arabic–Persian philosophy, al-Farabi (c. 870–950) and Averroes (1126–1198) discussed how philosophy and theology interact and which is the better vehicle to truth. Al-Ghazali (c. 1056–1111) criticized many of the core teachings of previous Islamic philosophers, saying that they rely on unproven assumptions that do not amount to knowledge. In Western philosophy, Anselm of Canterbury (1033–1109) proposed that theological teaching and philosophical inquiry are in harmony and complement each other. Peter Abelard (1079–1142) argued against unquestioned theological authorities and said that all things are open to rational doubt. Influenced by Aristotle, Thomas Aquinas (1225–1274) developed an empiricist theory, stating that \"nothing is in the intellect unless it first appeared in the senses\". According to an early form of direct realism proposed by William of Ockham (c. 1285–1349), perception of mind-independent objects happens directly without intermediaries. Meanwhile, in 14th-century India, Gaṅgeśa developed a reliabilist theory of knowledge and considered the problems of testimony and fallacies. In China, Wang Yangming (1472–1529) explored the unity of knowledge and action, holding that moral knowledge is inborn and can be attained by overcoming self-interest.\n\nThe course of modern philosophy was shaped by René Descartes (1596–1650), who claimed that philosophy must begin from a position of indubitable knowledge of first principles. Inspired by skepticism, he aimed to find absolutely certain knowledge by encountering truths that cannot be doubted. He thought that this is the case for the assertion \"I think, therefore I am\", from which he constructed the rest of his philosophical system. Descartes, together with Baruch Spinoza (1632–1677) and Gottfried Wilhelm Leibniz (1646–1716), belonged to the school of rationalism, which asserts that the mind possesses innate ideas independent of experience. John Locke (1632–1704) rejected this view in favor of an empiricism according to which the mind is a blank slate. This means that all ideas depend on sense experience, either as \"ideas of sense\", which are directly presented through the senses, or as \"ideas of reflection\", which the mind creates by reflecting on ideas of sense. David Hume (1711–1776) used this idea to explore the limits of what people can know. He said that knowledge of facts is never certain, adding that knowledge of relations between ideas, like mathematical truths, can be certain but contains no information about the world. Immanuel Kant (1724–1804) tried to find a middle position between rationalism and empiricism by identifying a type of knowledge that Hume had missed. For Kant, this is knowledge about principles that underlie all experience and structure it, such as spatial and temporal relations and fundamental categories of understanding. \nIn the 19th century, Georg Wilhelm Friedrich Hegel (1770–1831) argued against empiricism, saying that sensory impressions on their own cannot amount to knowledge since all knowledge is actively structured by the knowing subject. John Stuart Mill (1806–1873) defended a wide-sweeping form of empiricism and explained knowledge of general truths through inductive reasoning. Charles Peirce (1839–1914) thought that all knowledge is fallible, emphasizing that knowledge seekers should always be ready to revise their beliefs if new evidence is encountered. He used this idea to argue against Cartesian foundationalism seeking absolutely certain truths.\nIn the 20th century, fallibilism was further explored by J. L. Austin (1911–1960) and Karl Popper (1902–1994). In continental philosophy, Edmund Husserl (1859–1938) applied the skeptic idea of suspending judgment to the study of experience. By not judging whether an experience is accurate or not, he tried to describe the internal structure of experience instead. Logical positivists, like A. J. Ayer (1910–1989), said that all knowledge is either empirical or analytic. Bertrand Russell (1872–1970) developed an empiricist sense-datum theory, distinguishing between direct knowledge by acquaintance of sense data and indirect knowledge by description, which is inferred from knowledge by acquaintance. Common sense had a central place in G. E. Moore's (1873–1958) epistemology. He used trivial observations, like the fact that he has two hands, to argue against abstract philosophical theories that deviate from common sense. Ordinary language philosophy, as practiced by the late Ludwig Wittgenstein (1889–1951), is a similar approach that tries to extract epistemological insights from how ordinary language is used.\nEdmund Gettier (1927–2021) conceived counterexamples against the idea that knowledge is the same as justified true belief. These counterexamples prompted many philosophers to suggest alternative definitions of knowledge. Developed by philosophers such as Alvin Goldman (1938–2024), reliabilism emerged as one of the alternatives, asserting that knowledge requires reliable sources and shifting the focus away from justification. Virtue epistemology, a closely related response, analyses belief formation in terms of the intellectual virtues or  cognitive competencies involved in the process. Naturalized epistemology, as conceived by Willard Van Orman Quine (1908–2000), employs concepts and ideas from the natural sciences to formulate its theories. Other developments in late 20th-century epistemology were the emergence of social, feminist, and historical epistemology.\n\n\n== See also ==\n\nEpistemological pluralism – School of thought in epistemology\nKnowledge falsification – Deliberate misrepresentation of knowledge\nLogology (science) – The study of all aspects of science and its practitioners\nReformed epistemology – School of philosophical thought\nTheory of Knowledge (IB Course) – Compulsory International Baccalaureate subjectPages displaying short descriptions of redirect targets\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Citations ===\n\n\n=== Bibliography ===\n\n\n== External links ==",
  "links": {
    "A. J. Ayer": "",
    "A priori and a posteriori": "",
    "Abhidharma": "",
    "Absolute idealism": "",
    "Academic Skepticism": "",
    "Academic skepticism": "",
    "Achintya Bheda Abheda": "",
    "Action (philosophy)": "",
    "Action theory (philosophy)": "",
    "Advaita Vedanta": ""
  },
  "url": "https://en.wikipedia.org/wiki/Epistemology"
}