{
  "title": "Ethics of technology",
  "content": "The ethics of technology is a sub-field of ethics addressing ethical questions specific to the technology age, the transitional shift in society wherein personal computers and subsequent devices provide for the quick and easy transfer of information. Technology ethics is the application of ethical thinking to growing concerns as new technologies continue to rise in prominence.\nThe topic has evolved as technologies have developed. Technology poses an ethical dilemma on producers and consumers alike. \nThe subject of technoethics, or the ethical implications of technology, have been studied by different philosophers such as Hans Jonas and Mario Bunge.\n\n\n== Technoethics ==\nTechnoethics (TE) is an interdisciplinary research area that draws on theories and methods from multiple knowledge domains (such as communications, social sciences, information studies, technology studies, applied ethics, and philosophy) to provide insights on ethical dimensions of technological systems and practices for advancing a technological society.\nTechnoethics views technology and ethics as socially embedded enterprises and focuses on discovering the ethical uses for technology, protecting against the misuse of technology, and devising common principles to guide new advances in technological development and application to benefit society. Typically, scholars in technoethics have a tendency to conceptualize technology and ethics as interconnected and embedded in life and society. Technoethics denotes a broad range of ethical issues revolving around technology – from specific areas of focus affecting professionals working with technology to broader social, ethical, and legal issues concerning the role of technology in society and everyday life.\nTechnoethical perspectives are constantly in transition as technology advances in areas unseen by creators and as users change the intended uses of new technologies. Humans cannot be separated from these technologies because it is an inherent part of consciousness. The short term and longer term ethical considerations for technologies engage the creator, producer, user, and governments.\nWith the increasing impact emerging technologies have on society, the importance of assessing ethical and social issues constantly becomes more important. While such technologies provide opportunities for novel applications and the potential to transform the society on a global scale, their rise is accompanied by new ethical challenges and problems that must be considered. This becomes more difficult with the increasing pace at which technology is progressing and the increasing impact it has on the societal understanding by seemingly outrunning human control. The concept of technoethics focuses on expanding the knowledge of existing research in the areas of technology and ethics in order to provide a holistic construct for the different aspects and subdisciplines of ethics related to technology-related human activity like economics, politics, globalization, and scientific research. It is also concerned with the rights and responsibilities that designers and developers have regarding the outcomes of the respective technology. This is of particular importance with the emergence of algorithmic technology capable of making decisions autonomously and the related issues of developer or data bias influencing these decisions. To work against the manifestation of these biases, the balance between human and technology accountability for ethical failure has to be carefully evaluated and has shifted the view from technology as a merely positive tool towards the perception of technology as inherently neutral. Technoethics thus has to focus on both sides of the human technology equation when confronted with upcoming technology innovations and applications.\nWith technology continuing to advance over time, there are new technoethical issues that come into play. For instance, discussions on genetically modified organisms (GMOs) have brought about a huge concern for technology, ethics, and safety. There is also a huge question of whether or not artificial intelligence (AI) should be trusted and relied upon. These are just some examples of how the advancements in technology will affect the ethical values of humans in the future.\nTechnoethics finds application in various areas of technology. The following key areas are mentioned in the literature:\n\nComputer ethics: Focuses on the use of technology in areas including visual technology, artificial intelligence, and robotics.\nEngineering ethics: Dealing with professional standards of engineers and their moral responsibilities to the public.\nInternet ethics and cyberethics: Concerning the guarding against unethical Internet activity.\nMedia and communication technoethics: Concerning ethical issues and responsibilities when using mass media and communication technology.\nProfessional technoethics: Concerning all ethical considerations that revolve around the role of technology within professional conduct like in engineering, journalism, or medicine.\nEducational technoethics: Concerning the ethical issues and outcomes associated with using technology for educational aims.\nBiotech ethics: Linked to advances in bioethics and medical ethics like considerations arising in cloning, human genetic engineering, and stem cell research.\nEnvironmental technoethics: Concerning technological innovations that impact the environment and life.\nNanoethics: Concerning ethical and social issues associated with developments in the alteration of matter at the level of atoms and molecules in various disciplines including computer science, engineering, and biology.\nMilitary technoethics: Concerning ethical issues associated with technology use in military action.\n\n\n== Definitions ==\nEthics address the issues of what is 'right', what is 'just', and what is 'fair'. Ethics describe moral principles influencing conduct; accordingly, the study of ethics focuses on the actions and values of people in society (what people do and how they believe they should act in the world).\nTechnology is the branch of knowledge that deals with the creation and use of technical means and their interrelation with life, society, and the environment; it may draw upon a variety of fields, including industrial arts, engineering, applied science, and pure science. Technology \"is core to human development and a key focus for understanding human life, society and human consciousness.\"\nUsing theories and methods from multiple domains, technoethics provides insights on ethical aspects of technological systems and practices, examines technology-related social policies and interventions, and provides guidelines for how to ethically use new advancements in technology. Technoethics provides a systems theory and methodology to guide a variety of separate areas of inquiry into human-technological activity and ethics. Moreover, the field unites both technocentric and bio-centric philosophies, providing \"conceptual grounding to clarify the role of technology to those affected by it and to help guide ethical problem solving and decision making in areas of activity that rely on technology.\" As a bio-techno-centric field, technoethics \"has a relational orientation to both technology and human activity\"; it provides \"a system of ethical reference that justifies that profound dimension of technology as a central element in the attainment of a 'finalized' perfection of man.\"\n\n\n== Fundamental problems ==\nTechnology is merely a tool like a device or gadget. With this thought process of technology just being a device or gadget, it is not possible for technology to possess a moral or ethical quality. Going by this thought process the tool maker or end user would be the one who decides the morality or ethicality behind a device or gadget. \"Ethics of technology\" refers to two basic subdivisions:\n\nThe ethics involved in the development of new technology—whether it is always, never, or contextually right or wrong to invent and implement a technological innovation.\nThe ethical questions that are exacerbated by the ways in which technology extends or curtails the power of individuals—how standard ethical questions are changed by the new powers.\nIn the former case, ethics of such things as computer security and computer viruses asks whether the very act of innovation is an ethically right or wrong act.  Similarly, does a scientist have an ethical obligation to produce or fail to produce a nuclear weapon?  What are the ethical questions surrounding the production of technologies that waste or conserve energy and resources?  What are the ethical questions surrounding the production of new manufacturing processes that might inhibit employment, or might inflict suffering in the third world?\nIn the latter case, the ethics of technology quickly break down into the ethics of various human endeavors as they are altered by new technologies.  For example, bioethics is now largely consumed with questions that have been exacerbated by the new life-preserving technologies, new cloning technologies, and new technologies for implantation.  In law, the right of privacy is being continually attenuated by the emergence of new forms of surveillance and anonymity.  The old ethical questions of privacy and free speech are given new shape and urgency in an Internet age.  Such tracing devices as RFID, biometric analysis and identification, genetic screening, all take old ethical questions and amplify their significance. As you can see, the fundamental problem is as society produces and advances technology that we use in all areas of our life from work, school, medicine, surveillance, etc. we receive great benefits, but there are underlying costs to these benefits. As technology evolves even more, some of the technological innovations can be seen as inhumane and those same technological innovations can be seen by others as creative, life changing, and innovative.\n\n\n== History of technoethics ==\nThough the ethical consequences of new technologies have existed since Socrates' attack on writing in Plato's dialogue Phaedrus, the formal field of technoethics had only existed for a few decades. The first traces of TE can be seen in Dewey and Peirce's pragmatism. With the advent of the Industrial Revolution, it was easy to see that technological advances were going to influence human activity. This is why they put emphasis on the responsible use of technology.\nThe term \"technoethics\" was coined in 1977 by the philosopher Mario Bunge to describe the responsibilities of technologists and scientists to develop ethics as a branch of technology. Bunge argued that the current state of technological progress was guided by ungrounded practices based on limited empirical evidence and trial-and-error learning.  He recognized that \"the technologist must be held not only technically but also morally responsible for whatever he designs or executes: not only should his artifacts be optimally efficient but, far from being harmful, they should be beneficial, and not only in the short run but also in the long term.\" He recognized a pressing need in society to create a new field called 'technoethics' to discover rationally grounded rules for guiding science and technological progress.\nWith the spurt in technological advances came technological inquiry. Societal views of technology were changing; people were becoming more critical of the developments that were occurring and scholars were emphasizing the need to understand and to take a deeper look and study the innovations. Associations were uniting scholars from different disciplines to study the various aspects of technology. The main disciplines being philosophy, social sciences and science and technology studies (STS). Though many technologies were already focused on ethics, each technology discipline was separated from each other, despite the potential for the information to intertwine and reinforce itself. As technologies became increasingly developed in each discipline, their ethical implications paralleled their development, and became increasingly complex. Each branch eventually became united, under the term technoethics, so that all areas of technology could be studied and researched based on existing, real-world examples and a variety of knowledge, rather than just discipline-specific knowledge.\n\n\n== Technology and ethics ==\n\n\n=== Ethics theories ===\nTechnoethics involves the ethical aspects of technology within a society that is shaped by technology. This brings up a series of social and ethical questions regarding new technological advancements and new boundary crossing opportunities. Before moving forward and attempting to address any ethical questions and concerns, it is important to review the three major ethical theories to develop a perspective foundation:\n\nUtilitarianism (Bentham) is an ethical theory which attempts to maximize happiness and reduce suffering for the greatest number of people. Utilitarianism focused on results and consequences rather than rules.\nDuty ethics (Kant) notes the obligations that one has to society and follows society's universal rules. It focuses on the rightness of actions instead of the consequences, focusing on what an individual should do.\nVirtue ethics is another main perspective in normative ethics. It highlights the role and virtues that an individual's character contains to be able to determine or evaluate ethical behaviour in society. By practicing honing honest and generous behavior, Aristotle, the philosopher of this theory believes that people will then make the right choice when faced with an ethical decision.\nRelationship ethics states that care and consideration are both derived from human communication. Therefore, ethical communication is the core substance to maintain healthy relationships.\n\n\n=== Historical framing of technology – four main periods ===\nGreek civilization defined technology as techné. Techné is \"the set principles, or rational method, involved in the production of an object or the accomplishment of an end; the knowledge such as principles of method; art.\" This conceptualization of technology used during the early Greek and Roman period to denote the mechanical arts, construction, and other efforts to create, in Cicero's words, a \"second nature\" within the natural world.\nModern conceptualization of technology as invention materialized in the 17th century in Bacon's futuristic vision of a perfect society governed by engineers and scientists in Saloman's House, to raise the importance of technology in society.\nThe German term \"Technik\" was used in the 19th-20th century. Technik is the totality of processes, machines, tools and systems employed in the practical arts and Engineering. Webber popularized it when it was used in broader fields. Mumford said it was underlying a civilization. Known as: before 1750: Eotechnic, in 1750-1890: Paleoethnic and in 1890: Neoethnic. Place it at the center of social life in close connection to social progress and societal change. Mumford says that a machine cannot be divorced from its larger social pattern, for it is the pattern that gives it meaning and purpose.\nRapid advances in technology provoked a negative reaction from scholars who saw technology as a controlling force in society with the potential to destroy how people live (Technological Determinism). Heidegger warned people that technology was dangerous in that it exerted control over people through its mediating effects, thus limiting authenticity of experience in the world that defines life and gives life meaning. It is an intimate part of the human condition, deeply entrenched in all human history, society and mind.\n\n\n=== Significant technoethical developments in society ===\nMany advancements within the past decades have added to the field of technoethics. There are multiple concrete examples that have illustrated the need to consider ethical dilemmas in relation to technological innovations. Beginning in the 1940s influenced by the British eugenic movement, the Nazis conduct \"racial hygiene\" experiments causing widespread, global anti-eugenic sentiment. In the 1950s the first satellite Sputnik 1 orbited the Earth, the Obninsk Nuclear Power Plant was the first nuclear power plant to be opened, the American nuclear tests take place. The 1960s brought about the first crewed Moon landing, ARPANET created which leads to the later creation of the Internet, first heart transplantation completed,  and the Telstar communications satellite is launched. The 70s, 80s, 90s, 2000s and 2010s also brought multiple developments.\n\n\n=== Technological consciousness ===\nTechnological consciousness is the relationship between humans and technology. Technology is seen as an integral component of human consciousness and development. Technology, consciousness and society are intertwined in a relational process of creation that is key to human evolution. Technology is rooted in the human mind, and is made manifest in the world in the form of new understandings and artifacts. The process of technological consciousness frames the inquiry into ethical responsibility concerning technology by grounding technology in human life.\nThe structure of technological consciousness is relational but also situational, organizational, aspectual and integrative. Technological consciousness situates new understandings by creating a context of time and space. As well, technological consciousness organizes disjointed sequences of experience under a sense of unity that allows for a continuity of experience. The aspectual component of technological consciousness recognizes that individuals can only be conscious of aspects of an experience, not the whole thing. For this reason, technology manifests itself in processes that can be shared with others. The integrative characteristics of technological consciousness are assimilation, substitution and conversation. Assimilation allows for unfamiliar experiences to be integrated with familiar ones. Substitution is a metaphorical process allowing for complex experiences to be codified and shared with others — for example, language. Conversation is the sense of an observer within an individual's consciousness, providing stability and a standpoint from which to interact with the process.\n\n\n=== Misunderstandings of consciousness and technology ===\nAccording to Rocci Luppicini, the common misunderstandings about consciousness and technology are listed as follows. The first misunderstanding is that consciousness is only in the head when according to Luppicini, consciousness is not only in the head meaning that \"[c]onsciousness is responsible for the creation of new conscious relations wherever imagined, be it in the head, on the street or in the past.\" The second misunderstanding is technology is not a part of consciousness. Technology is a part of consciousness as \"the conceptualization of technology has gone through drastic changes.\" The third misunderstanding is that technology controls society and consciousness, by which Luppicini means \"that technology is rooted in consciousness as an integral part of mental life for everyone. This understanding will most likely alter how both patients and psychologists deal with the trials and tribunes of living with technology.\" The last misunderstanding is society controls technology and consciousness. \"…(other) accounts fail to acknowledge the complex relational nature of technology as an operation within mind and society. This realization shifts the focus on technology to its origins within the human mind as explained through the theory of technological consciousness.\"\n\nConsciousness (C) is only a part of the head: C is responsible for the creation of new conscious relations\nTechnology (T) is not part of C: Humans cannot be separated from technology\nT controls society and C: Technology cannot control the mind\nSociety controls T and C: Society fails to take in account the consideration of society shaping what technology gets developed?\n\n\n== Types of technology ethics ==\nTechnology ethics are principles that can be used to govern technology including factors like risk management and individual rights. They are basically used to understand and resolve moral issues that have to do with the development and application of technology of different types.\nThere are many types of technology ethics:\n\nAccess rights: access to empowering technology as a right\nAccountability: decisions made for who is responsible when considering success or harm in technological advancements\nDigital rights: protecting intellectual property rights and privacy rights\nEnvironment: how to produce technology that could harm the environment\nExistential risk: technologies that represent a threat to the global quality of life pertaining to extinction\nFreedom: technology that is used to control a society raising questions related to freedom and independence\nHealth and safety: health and safety risks that are increased and imposed by technologies\nHuman Enhancement: human genetic engineering and human-machine integration\nHuman judgement: when can decisions be judged by automation and when do they acquire a reasonable human?\nOver-automation: when does automation decrease quality of life and start affecting society?\nPrecaution principle: Who decides that developing this new technology is safe for the world?\nPrivacy: protection of privacy rights\nSecurity: Is due diligence required to ensure information security?\nSelf replicating technology: should self replicating be the norm?\nTechnology transparency: clearly explaining how a technology works and what its intentions are\nTerms of service: ethics related to legal agreements\n\n\n=== Ethical challenges ===\nEthical challenges arise in many different situations:\n\nHuman knowledge processes\nWorkplace discrimination\nStrained work-life balance in technologically enhanced work environments: Many people find that simply having the technology allowing one to do work while at home increases stress levels. In a recent study 70% of respondents said that since technology, work has crept into their personal lives.\nDigital divide: Inequalities in information access for parts of the population\nUnequal opportunities for scientific and technological development\nNorris says access to information and knowledge resources within a knowledge society tend to favour the economically privileged who have greater access to technological tools needed to access information and knowledge resources disseminated online and the privatization of knowledge\nInequality in terms of how scientific and technological knowledge is developed around the globe. Developing countries do not have the same opportunities as developed countries to invest in costly large-scale research and expensive research facilities and instrumentation\nOrganizational responsibility and accountability issues\nIntellectual property ownership issues\nInformation overload: Information processing theory asserts that working memory that has a limited capacity and too much information can lead to cognitive overload resulting in loss of information from short-term memory\nKnowledge society is intertwined with changing technology requiring new skills of its workforce. Cutler says that there is the perception that older workers lack experience with new technology and that retaining programs may be less effective and more expensive for older workers. Cascio says that there is a growth of virtual organizations. Saetre & Sornes say that it is a blurring of the traditional time and space boundaries has also led to many cases in the blurring of work and personal life\nNegative impacts of many scientific and technological innovations have on humans and the environment has led to some skepticism and resistance to increasing dependence on technology within the Knowledge Society. Doucet calls for city empowerment to have the courage and foresight to make decisions that are acceptable to its inhabitants rather that succumb to global consumer capitalism and the forces of international corporations on national and local governments\nScientific and technological innovations that have transformed organizational life within a global economy have also supplanted human autonomy and control in work within a technologically oriented workplace\nThe persuasive potential of technology raises the question of \"how sensitive ... designers and programmers [should] be to the ethics of the persuasive technology they design.\" Technoethics can be used to determine the level of ethical responsibility that should be associated with outcomes of the use of technology, whether intended or unintended\nRapidly changing organizational life and the history of unethical business practices have given rise to public debates concerning organizational responsibility and trust. The advent of virtual organizations and increase in remote work has bolstered ethical problems by providing more opportunities for fraud and the production of misinformation. Concerted efforts are required to uphold ethical values in advancing new knowledge and tools within societal relations which do not exclude people or limit liberties of some people at the expense of others\nArtificial Intelligence: Artificial Intelligence seems to be the one of the most talked of challenges when it comes ethics. In order to avoid these ethical challenges some solutions have been established; first and for most it should be developed for the common good and benefit of humanity. Secondly, it should operate on principles of intelligibility and fairness. It should also not be used to diminish the data rights or privacy of individuals, families, or communities. It is also believed that all citizens should have the right to be educated on artificial intelligence in order to be able to understand it. Finally, the autonomous power to hurt, destroy, or deceive humans should never be vested in artificial intelligence.\n\n\n=== Current issues ===\n\n\n==== Copyrights ====\nDigital copyrights are a complicated issue because there are multiple sides to the discussion. There are ethical considerations surrounding the artist, producer, and end user. Not to mention the relationships with other countries and the impact on the use of content housed in their countries. In Canada, national laws such as the Copyright Act and the history behind Bill C-32 are just the beginning of the government's attempt to shape the \"wild west\" of Canadian Internet activities.  The ethical considerations behind Internet activities such a peer-to-peer file sharing involve every layer of the discussion – the consumer, artist, producer, music/movie/software industry, national government, and international relations. Overall, technoethics forces the \"big picture\" approach to all discussions on technology in society. Although time-consuming, this \"big picture\" approach offers some level of reassurance when considering that any law put in place could drastically alter the way we interact with our technology and thus the direction of work and innovation in the country.\nThe use of copyrighted material to create new content is a hotly debated topic. The emergence of the musical \"mashup\" genre has compounded the issue of creative licensing.  A moral conflict is created between those who believe that copyright protects any unauthorized use of content, and those who maintain that sampling and mash-ups are acceptable musical styles and, though they use portions of copyrighted material, the result is a new creative piece which is the property of the creator, and not of the original copyright holder.  Whether or not the mashup genre should be allowed to use portions of copyrighted material to create new content is one which is currently under debate.\n\n\n==== Cybercriminality ====\n\nCybercrime can consist of many subcategories and can be referred to as a big umbrella. Cyber theft such as online fraud, identity theft, and digital piracy can be classified as one sector. Another section of cybercrime can include cyber-violence which can be defined as online behavior that can be anywhere from hate speeches, harassment, cyberstalking, to behavior that leads to physical, psychological, or emotional assault against the well-being of an individual. Cyber obscenity is another section when child sexual exploitation materials are involved. Cyber trespass is when there is unauthorized computer system access. Cybercrime can encompass many other sections where technology and computers are used to assist and commit various forms of crimes.\nFor many years , new technologies took an important place in social, cultural, political, and economic life. Thanks to the democratization of informatics access and the network's globalization, the number of exchanges and transaction is in perpetual progress.\nIn the article, \"The Dark Figure of Online Property Crime: Is Cyberspace Hiding a Crime Wave?\", the authors analyze evidence that reveals cyber criminality rates are increasing as the typical street crimes gradually decrease. With the increase in cyber criminality, it is imperative to research more information on how to increase cyber security. The issue with increasing cyber security is that the more laws to protect people, the more citizens would feel threatened that their freedom is being compromised. One way to avoid making people feel threatened by all the security measures and protocols is by being as clear and straightforward as possible.  Gregory Nojeim in his article \"Cybersecurity and Freedom on the Internet\" state, \"Transparency in the cybersecurity program will build the confidence and trust that is essential to industry and public support for cybersecurity measures.\" It is important to create ethical laws that protect privacy, innovation, and consumers' freedom.\nMany people are exploiting the facilities and anonymity that modern technologies offer in order to commit multiple criminal activities. Cybercrime is one of the fastest growing areas of crime. The problem is that some laws that profess to protect people from those who would do wrong things via digital means also threaten to take away people's freedom.\n\n\n==== Privacy vs. security: Full-body airport scanners ====\nSince the introduction of full body X-ray scanners to airports in 2007, many concerns over traveler privacy have arisen. Individuals are asked to step inside a rectangular machine that takes an alternate wavelength image of the person's naked body for the purpose of detecting metal and non-metal objects being carried under the clothes of the traveler. This screening technology comes in two forms, millimeter wave technology (MM-wave technology) or backscatter X-rays (similar to x-rays used by dentists). Full-body scanners were introduced into airports to increase security and improve the quality of screening for objects such as weapons or explosives due to an increase of terrorist attacks involving airplanes occurring in the early 2000s.\nEthical concerns of both travelers and academic groups include fear of humiliation due to the disclosure of anatomic or medical details, exposure to a low level of radiation (in the case of backscatter X-ray technology), violation of modesty and personal privacy, clarity of operating procedures, the use of this technology to discriminate against groups, and potential misuse of this technology for reasons other than detecting concealed objects. Also people with religious beliefs that require them to remain physically covered (arms, legs, face etc.) at all times will be unable and morally opposed to stepping inside of this virtually intrusive scanning technology. The Centre for Society, Science and Citizenship have discussed their ethical concerns including the ones mentioned above and suggest recommendations for the use of this technology in their report titled \"Whole Body Imaging at airport checkpoints: the ethical and policy context\" (2010).\n\n\n==== Privacy and GPS technologies ====\nThe discourse around GPS tracking devices and geolocation technologies and this contemporary technology's ethical ramifications on privacy is growing as the technology becomes more prevalent in society. As discussed in the New York Times's Sunday Review on September 22, 2012, the editorial focused on the ethical ramifications that imprisoned a drug offender because of the GPS technology in his cellphone was able to locate the criminal's position. Now that most people carry on the person a cell, the authorities have the ability to constantly know the location of a large majority of citizens. The ethical discussion now can be framed from a legal perspective. As raised in the editorial, there are stark infractions that these geolocation devices on citizens' Fourth Amendment and their protection against unreasonable searches. This reach of this issue is not just limited to the United States but affects more democratic state that uphold similar citizens' rights and freedoms against unreasonable searches.\nThese geolocation technologies are not only affecting how citizens interact with their state but also how employees interact with their workplaces. As discussed in article by the Canadian Broadcasting Company, \"GPS and privacy\", that a growing number of employers are installing geolocation technologies in \"company vehicles, equipment and cellphones\" (Hein, 2007). Both academia and unions are finding these new powers of employers to be indirect contradiction with civil liberties. This changing relationship between employee and employer because of the integration of GPS technology into popular society is demonstrating a larger ethical discussion on what are appropriate privacy levels. This discussion will only become more prevalent as the technology becomes more popular.\n\n\n==== Genetically modified organisms (GMOs) ====\nGenetically modified foods have become quite common in developed countries around the world, boasting greater yields, higher nutritional value, and greater resistance to pests, but there are still many ethical concerns regarding their use. Even commonplace genetically modified crops like corn raise questions of the ecological consequences of unintended cross pollination, potential horizontal gene transfer, and other unforeseen health concerns for humans and animals.\nTrademarked organisms like the \"Glofish\" are a relatively new occurrence. These zebrafish, genetically modified to appear in several fluorescent colours and sold as pets in the United States, could have unforeseen effects on freshwater environments were they ever to breed in the wild.\nProviding they receive approval from the U.S. Food and Drug Administration (FDA), another new type of fish may be arriving soon. The \"AquAdvantage salmon\", engineered to reach maturity within roughly 18 months (as opposed to three years in the wild), could help meet growing global demand. There are health and environmental concerns associated with the introduction any new GMO, but more importantly this scenario highlights the potential economic impact a new product may have. The FDA does perform an economic impact analysis to weigh, for example, the consequences these new genetically modified fish may have on the traditional salmon fishing industry against the long term gain of a cheaper, more plentiful source of salmon. These technoethical assessments, which regulatory organizations like the FDA are increasingly faced with worldwide, are vitally important in determining how GMOs—with all of their potential beneficial and harmful effects—will be handled moving forward.\n\n\n==== Pregnancy screening technology ====\nFor over 40 years, newborn screening has been a triumph of the 20th century public health system. Through this technology, millions of parents are given the opportunity to screen for and test a number of disorders, sparing the death of their children or complications such as mental retardation. However, this technology is growing at a fast pace, disallowing researchers and practitioners from being able to fully understand how to treat diseases and provide families in need with the resources to cope.\nA version of pre-natal testing, called tandem mass spectrometry, is a procedure that \"measures levels and patterns of numerous metabolites in a single drop of blood, which are then used to identify potential diseases. Using this same drop of blood, tandem mass spectrometry enables the detection of at least four times the number of disorders than was possible with previous technologies.\" This allows for a cost-effective and fast method of pre-natal testing.\nHowever, critics of tandem mass spectrometry and technologies like it are concerned about the adverse consequences of expanding newborn screen technology and the lack of appropriate research and infrastructure needed to provide optimum medical services to patients. Further concerns include \"diagnostic odysseys\", a situation in which the patient aimlessly continues to search for diagnoses where none exists.\nAmong other consequences, this technology raises the issue of whether individuals other than newborn will benefit from newborn screening practices. A reconceptualization of the purpose of this screening will have far reaching economic, health and legal impact. This discussion is only just beginning and requires informed citizenry to reach legal if not moral consensus on how far we as a society are comfortable with taking this technology.\n\n\n==== Citizen journalism ====\n\nCitizen journalism is a concept describing citizens who wish to act as a professional journalist or media person by \"collecting, reporting, analyzing, and disseminating news and information\" According to Jay Rosen, citizen journalists are \"the people formerly known as the audience,\" who \"were on the receiving end of a media system that ran one way, in a broadcasting pattern, with high entry fees and a few firms competing to speak very loudly while the rest of the population listened in isolation from one another—and who today are not in a situation like that at all. ... The people formerly known as the audience are simply the public made realer, less fictional, more able, less predictable\".\nThe internet has provided society with a modern and accessible public space. Due to the openness of the internet, there are discernible effects on the traditional profession of journalism. Although the concept of citizen journalism is a seasoned one, \"the presence of online citizen journalism content in the marketplace may add to the diversity of information that citizens have access to when making decisions related to the betterment of their community or their life\". The emergence of online citizen journalism is fueled by the growing use of social media websites to share information about current events and issues locally, nationally and internationally.\nThe open and instantaneous nature of the internet affects the criteria of information quality on the web. A journalistic code of ethics is not instilled for those who are practicing citizen journalism. Journalists, whether professional or citizen, have needed to adapt to new priorities of current audiences: accessibility, quantity of information, quick delivery and aesthetic appeal. Thus, technology has affected the ethical code of the profession of journalism with the popular free and instant sharing qualities of the internet. Professional journalists have had to adapt to these new practices to ensure that truthful and quality reporting is being distributed. The concept can be seen as a great advancement in how society communicates freely and openly or can be seen as contributing to the decay of traditional journalistic practices and codes of ethics.\nOther issues to consider:\n\nPrivacy concerns: location services on cell devices which tell all users where a person is should they decide to turn on this feature, social media, online banking, new capabilities of cellular devices, Wi-fi, etc.\nNew music technology: People see more electronic music today with the new technology able to create it, as well as more advanced recording technology\n\n\n=== Recent developments ===\nDespite the amassing body of scholarly work related to technoethics beginning in the 1970s, only recently has it become institutionalized and recognized as an important interdisciplinary research area and field of study. In 1998, the Epson Foundation founded the Instituto de Tecnoética in Spain under the direction of Josep Esquirol. This institute has actively promoted technoethical scholarship through awards, conferences, and publications. This helped encourage scholarly work for a largely European audience. The major driver for the emergence of technoethics can be attributed to the publication of major reference works available in English and circulated globally. The \"Encyclopedia of Science, Technology, and Ethics\" included a section on technoethics which helped bring it into mainstream philosophy. This helped to raise further interest leading to the publication of the first reference volume in the English language dedicated to the emerging field of Technoethics. The two volume Handbook of Research on Technoethics explores the complex connections between ethics and the rise of new technologies (e.g., life-preserving technologies, stem cell research, cloning technologies, new forms of surveillance and anonymity, computer networks, Internet advancement, etc.) This recent major collection provides the first comprehensive examination of technoethics and its various branches from over 50 scholars around the globe. The emergence of technoethics can be juxtaposed with a number of other innovative interdisciplinary areas of scholarship which have surfaced in recent years such as technoscience and technocriticism.\n\n\n==== Technology and ethics in the music industry ====\nWith all the developments we've had in technology it has created a lot advancement for the music industry both positive and negative. A main concern is piracy and illegal downloading; with all that is available through the internet a lot of music (TV shows and movies as well) have become easily accessible to download and upload for free. This does create new challenges for artist, producers, and copyright laws. The advances it has positively made for the industry is a whole new genre of music. Computers are being used to create electronic music, as well as synthesizers (computerized/electronic piano). This type of music is becoming rapidly more common and listened to. These advances have allowed the industry to try new things and make new explorations.\nBecause the internet is not controlled by a centralized power, users can maintain anonymity and find loopholes to avoid consequences for using peer-to-peer technology. The peer-to-peer network allows users to connect to a computer network and freely trade songs. Many companies, like Napster, have taken advantage of this because the protection of intellectual property is close to impossible on the internet. Digital and downloadable music has become a severe threat to major record companies.  Associated digital music technologies have changed the power dynamics greatly for major record companies, music consumers, and the artists. Not only has this change in power dynamics provided more opportunities for independent music labels but also reduce costs for music.\nThe digital environment in the music industry is always evolving. \"The industry is beginning to work at adapting to the digital environment and downturns in a business performance like by online distribution and sales; harnessing visibility events for sales momentum; new capabilities for artist management in the digital age and by leveraging online communities to influence product development, among others\". These new capabilities and new developments need strong intellectual property regulations to protect artists.\nTechnology is a pillar in the music industry; therefore, it is imperative to have strong technology ethics. Copyright protections and legislation help artists trademark their music and protect their intellectual property. Protecting intellectual property in the music industry becomes tricky when music firms are in the process of incorporating new technologies and methodologies, which forces firms to be innovative and update the industry standards.\n\n\n==== Technology and ethics during the coronavirus pandemic ====\nAs of April 20, 2020 there has been over 43 contract tracing apps available globally. Countries are in the process of creating their own methods of digitally tracing coronavirus status (symptoms, confirmed infected, exposed). Apple and Google are working together on a shared solution that helps with contract tracing around the world. Since this is a global pandemic with no end in sight, the restriction of some fundamental rights and freedoms may be ethically justifiable. It may be unethical to not use these tracing solutions to slow the spread. The European Convention on Human Rights, the United Nations International Covenant on Civil and Political Rights, and the United Nations Siracusa Principles all indicate when it is ethical to restrict the rights of the population to prevent the spread of infectious disease. All three documents cite that the circumstances for restricting rights must be time-bound, meet standards of necessity, proportionality, and scientific validity. We must evaluate if the gravity of the situation justifies the potential negative impact, if the evidence shows that the technology will work, is timely, will be adopted by enough people and yields accurate data and insights, and evaluate if the technology will only be temporary. These three documents also provide guidelines on how to ethically develop and design technologies. The development and design guidelines are important for being effective and for security reasons.\nThe development of technology has enhanced the ability to obtain, track, and share data. Technology has been mobilized by governments around the world to combat the issue of COVID-19, which has brought attention to several issues surrounding ethics. Governments have implemented technologies such as smartphone metadata and Bluetooth applications to contact trace and notify the public of any important information. There are implications for privacy as technologies such as metadata have the capacity to track every movement of an individual. Due to the Coronavirus Pandemic, contact tracing and other tracking apps have been implemented globally in order to fight against the pandemic. Countries across the globe have developing various methods of digitally tracing corona virus such as outbreak origin, symptoms, confirmed positives, and those who are potentially exposed. Governments around the world combined available technology to identify individuals and surveillance technology while still having a low impact on individuals privacy. In 2020, the Australian government released a Bluetooth connected app that allows phones communicate through Bluetooth opposed to metadata. This allowed the app to connect with surrounding phones through Bluetooth opposed to metadata or GPS, which can have a bigger impact on individual privacy. The technology records individuals who have been in close proximity, by connecting through their phones, and recording the data for a certain time period before deleting itself. The app does not track individual's locations but still can pinpoint if they have had close contact with those who were positive or exposed.\nOn the other hand, some countries such as South Korea utilized metadata technology to closely surveillance their citizens. Metadata can provide a detailed description of an individual's movements by staying regularly in contact with the local cellular towers to maintain reception. In S. Korea, the government utilized individuals' metadata information to convey any public health message to the public. Anonymized information would be released to the public of the locations of individuals who have tested positive for COVID-19. Similarly in Israel, the government approved emergency regulations that allowed authorities to utilize a database that tracks the movements of individuals that have tested positive for COVID-19.\nThe rise of surveillance technologies by the government to track individuals raises many questions of ethic concerns. As lockdowns and Covid protocols continue, the focus on protecting public health can severely conflict with individual autonomy, although it can be necessary to implement certain technologies and protocols.\nEven though these three bodies of government can deem contact tracing ethical, all these contact tracing apps come with a price. They are collecting sensitive personal data including health data. This poses a threat to violate HIPAA and PII if not handled and processed correctly. Even if these apps are only used temporarily, they are storing permanent records of health, movements, and social interactions. Not only do we have to consider the ethical implications of your personal information being stored, but we must also look at the accessibility and digital literacy of the users. Not everyone has access to a smartphone or a cell phone. If we are developing smartphone applications, we will be missing a huge portion of coronavirus data.\n\nWhile it may be necessary to utilize technology to slow the spread of coronavirus, the Government needs to design and deploy the technology in a way that does not breach the public trust. There is a fine line of saving lives and possibly harming the fundamental rights and freedoms of individuals.\n\n\n=== Future developments ===\nThe future of technoethics is a promising, yet evolving field. The studies of e-technology in workplace environments are an evolving trend in technoethics. With the constant evolution of technology, and innovations coming out daily, technoethics is looking to be a rather promising guiding framework for the ethical assessments of new technologies. Some of the questions regarding technoethics and the workplace environment that have yet to be examined and treated are listed below:\n\nAre organizational counter measures not necessary because it invades employee privacy?\nAre surveillance cameras and computer monitoring devices invasive methods that can have ethical repercussions?\nShould organizations have the right and power to impose consequences?\n\n\n==== Artificial intelligence ====\nArtificial intelligence is a large range of technology that deals with building smart machines and data processing so tasks can be performed by machines that are normally completed by humans.  AI may prove to be beneficial to human life, but it can also quickly become pervasive and dangerous. Changes in AI are difficult to anticipate and understand, such as employers spying on workers, facial recognition, deep fakes, etc. Along with AI, the algorithms used to implement the technology may prove to be biased which can have detrimental effects on individuals. For example, in facial recognition technology, the AI may be proven to be biased toward different ethnic and racial groups than others. These challenges have social, racial, ethical, and economic implications.\n\n\n==== Deepfakes ====\nDeepfake is a form of media in which one existing image or video is replaced or altered by someone else. Altering may include acting out fake content, false advertisement, hoaxes, and financial fraud. The technology of deepfakes may also use machine learning or artificial intelligence. Deepfakes propose an ethical dilemma due to how accessible they are as well as the implications on one's integrity it may cause to viewers. Deepfakes reconsider the challenge of trustworthiness of the visual experience and can create negative consequences. Deepfakes contribute to the problem of \"fake news\" by enabling both the more widespread fabrication or manipulation of media that may be deliberately used for the purposes of disinformation. There are four categories of deepfakes: deepfake porn, deepfake political campaigns, deepfake for commercial use, and creative deepfakes. Deepfakes have many harmful effects such as deception, intimidation, and reputational harm. Deception causes views to synthesize a form of reality that did not exist before and may think of it as real footage. The contents of the footage may be detrimental depending on what it is. Detrimental information may include fraudulent voter information, candidate information, money fraud, etc. Intimidation may occur by targeting a certain audience with harmful threats to generate fear. An example of intimidation may be deepfake revenge pornography which also ties into reputational harm. \nAccessibility of deepfakes also raises ethical dilemmas as it can be accessed through apps like FakeApp, Zao, and Impressions. The accessibility to these applications may cause legal action. In 2018 the Malicious Deep Fake Prohibition Act was introduced to protect those who may be harmed by deepfakes. These crimes can result in prosecution for harassment or sentences to imprisonment. Although there can be legal actions for deepfakes, they do become increasingly difficult as many parties are involved in its development. The many parties for a deepfake such as the software developer, the application for amplification, the user of the software, etc. Due to these many different components, it may be difficult to prosecute individuals for deepfakes.\n\n\n==== United Nations Educational, Scientific and Cultural Organization (UNESCO) ====\nUNESCO – a specialized intergovernmental agency of the United Nations, focusing on promotion of education, culture social and natural sciences and communication and information.\nIn the future, the use of principles as expressed in the UNESCO Universal Declaration on Bioethics and Human Rights (2005) will also be analyzed to broaden the description of bioethical reasoning (Adell & Luppicini, 2009).\n\n\n==== User data ====\nIn a digital world, much of users' personal lives are stored on devices such as computers and smartphones, and we trust the companies we store our lives on to take care of our data. A topic of discussion regarding the ethics of technology is just exactly how much data these companies really need and what they are doing with it. Another major cause for concern is the security of our personal data and privacy, whether it is leaked intentionally or not.\nUser data has been one of the main topics regarding ethics as companies and government entities increasingly have access to billions of users' information. Why do companies need so much data regarding their users and are users aware that their data is being tacked? These questions have risen over the years over concerns of how much do companies actually know. Some websites and apps now ask users if they are allowed to track user activity across different apps with the option to decline. Most companies before did not ask or notify users that their app activity would be tracked. Companies over the years have been facing an increased number of data hacks where user's data such as credit cards, social security, phone numbers, and addresses have been leaked. Users of social networks such as Snapchat and Facebook have been facing phone calls from scammers as recent data hacks released users' phone numbers. The most recent breach to affect Facebook leaked over 533 million Facebook users from 106 countries, including 32 million users alone in the U.S. The type of information leaked included user phone numbers, Facebook IDs, full names, locations, birthdates, bios, and email addresses. Hackers and web scrapers have been selling Facebook user data on hacker forums, information for 1 million users can go for $5,000 on these forums.\nLarge companies share their users' data constantly. In 2018, the U.S, government cracked down on Facebook selling user data to other companies after declaring that it had made the data in question inaccessible. One such case was in a scandal regarding Cambridge Analytica, in which Facebook sold user data to the company without consent from the users whose data was being accessed. The data was then used for several political agendas, such as the Brexit vote and the U.S. Presidential Election of 2016. In an interview with CBS' 60 Minutes, Trump campaign manager Brad Parscale described in detail how he used data taken from different social media websites to create ads that were both visually appealing to potential voters and targeted the issues that they felt strongest about.\nBesides swinging political races, the theft of people's data can result in serious consequences on an individual level. In some cases, hackers can breach websites or businesses that have identifying information about a person, such as their credit card number, cell phone number, and address, and upload it to the dark web for sale, if they decide not to use it for their own deviant purposes.\n\n\n==== Drones ====\nIn the book Society and Technological Change, 8th Edition, by Rudi Volti, the author comments on unmanned aerial vehicles, also known as UAVs or drones. Once used primarily as military technology, these are becoming increasingly accessible tools to the common person for hobbies like photography. In the author's belief, this can also cause concern for security and privacy, as these tools allow people with malicious intents easier access to spying.\nOutside of public areas, drones are also able to be used for spying on people in private settings, even in their own homes. In an article by today.com, the author writes about people using drones and taking videos and photographs of people in their most private moments, even in the privacy of their own home.\nFrom an ethical perspective, drones have a multitude of ethical issues many of which are determining current legal policy. Some areas include the ethical military usage of drones, private non-military use by hobbyists for photography or potential spying, drone usage in political campaigns as a way to spread campaign messages, drone usage in the private business sector as a means for delivery, and ethical usage of public/private airspace.\nPet Cloning\nIn 2020 pet cloning is to become something of interest for those who can afford it. For $25k - $50k anyone will be able to clone their house pet but there is no guarantee you will get the exact same pet that you once had. This may seem very appealing to certain animal-lovers, but what about all of those animals that already have no home?\nThere are a few different ethical questions here; the first being how is this fair to the animals that are suffering out in the wilderness with no home? The second being that cloning animals is not only for pets, but for all animals in general. Maybe people are concerned that people are going to clone animals for food purposes.Another question about animal cloning is it is good for the welfare of the animal or will the radiation and other procedural aspects cause the animals life to end earlier? These are just some of many concerns some people have with animal cloning.\n\n\n==== Animal cloning ====\nThe ethical standpoint of animal cloning is a heavily debated topic in a plethora of different career paths. Some of these ethical concerns are the health and well being of the animals, long term side effects, obstetrical complications that occur during cloning, environmental impacts, use of clones in farming/repopulation of endangered species, and the use of clones for other research, specifically in the medical/pharmaceutical field. Many of these concerns are only more recently spoken about due to the advancement of cloning technology in the past decade since humanity's first clone was only twenty-five years ago in 1996 resulting in the birth of a sheep known as Dolly.\n\n\n== Facebook and Meta's ethical concerns ==\n\nFacebook, or rather Meta Platforms, Facebook's parent company is currently one of the top social networking sites, throughout the early to late 2010s and into current times (2022). A variety of issues ranging from privacy concerns, the issue of who bears the responsibility of unhealthy social interactions and other unhealthy behaviors, to deliberate enabling of misinformation on the platform. Recent issues such as Facebook data leaks and circulation of fake news highlights the downside of social media when in the wrong hands. following are a few examples of various ethical concerns raised throughout the years in relation to Facebook.\n\n\n=== Federal Trade Commission v. Facebook ===\nA recent Forbes interview conducted on October 22, 2021, by Curt Steinhorst, a contributor for Forbes, with Michael Thate, an ethics teacher employed at Princeton University, asserts that in addition to the Federal Trade Commission v. Facebook ruling determining that Facebook had engaged in unethical antitrust behaviors with the acquisition of its competing social media platforms Instagram and WhatsApp, \"Facebook developed an algorithm to capture user attention and information into a platform that they knew promoted unhealthy behaviors.\" Firstly the unethical acquisition of smaller competing social media platforms restricts free-market practices and restricts users' choices in, at least in this case, what social media sites they choose to access. In addition to the antitrust, the promotion of unhealthy behaviors and lifestyles to increase user engagement on the platform is considered to be by Michael Thate to be an ethical concern, as users of the social media platform are given a choice between maintaining a healthy lifestyle and engaging in the social media platform that is designed to keep them on the site and actively engaged regardless of its impact on the wellbeing of the user.\n\n\n=== Facebook's algorithm ===\nOn October 4, 2021, CBS News interviewed Frances Haugen, a whistleblower and former employee of Facebook, who revealed Facebook was aware of various concerning ethical practices. \"The complaints say Facebook's own research shows that it amplifies hate, misinformation, and political unrest—but the company hides what it knows. One complaint alleges that Facebook's Instagram harms teenage girls.\" These various unethical practices were all employed to, yet again promote increased user engagement with the social media platform. Fences Haugen stated in the interview: \"The thing I saw at Facebook over and over again was there were conflicts of interest between what was good for the public and what was good for Facebook. And Facebook, over and over again, chose to optimize for its own interests, like making more money.\" An article written on February 10, 2021, by Paige Cooper outlines how Facebook's algorithm has changed over the years highlights the changes made by Facebook to prioritize the more emotional interactions on the site.\n\n\n=== Facebook–Cambridge Analytica ===\n\nThrough the 2010s the British political consulting firm Cambridge Analytica in a conjoined effort with Facebook gathered information and personal data on upwards of 87 million nonconsenting users as stated by a New York Times article titled \"Cambridge Analytica and Facebook: The Scandal and the Fallout So Far\". The illegally obtained data was then utilized in Donald Trump's 2016 presidential campaign to help develop personalized ads and campaign messages based on the data provided by Cambridge Analytica. An article was written by The Guardian on March 18, 2021, interviewing a Cambridge Analytica whistleblower Christopher Wylie. In the interview, Wylie asserted that the data given to him was legally obtained and that he and various other academic analyses were also unaware of the nature to which the data used in the psychological profiles was obtained.\n\n\n== Areas of technoethical inquiry ==\n\n\n=== Biotech ethics ===\n\nBiotech ethics concerned with ethical dilemmas surrounding the use of biotechnologies in fields including medical research, health care, and industrial applications. Topics such as cloning ethics, e-health ethics, telemedicine ethics, genetics ethics, neuroethics, and sport and nutrition ethics fall into this category; examples of specific issues include the debates surrounding euthanasia and reproductive rights.\nTelemedicine is a medical technology that has been used to advance clinical care with the use of video conferencing, text messaging, and applications. With the advantage of telemedicine, there are concerns about its pitfalls such as threats to patient privacy and HIPAA regulations. Cyberattacks in healthcare are a significant concern when implementing technology because there needs to be measures in place to keep patient privacy secure. One type of cyber attack is a medical device hijack also known as medjack where hackers can alter the functionality of implants, and expose patient medical history. When implementing technology, it is important to check for weaknesses that can cause vulnerability to hacking.\nThe use of technology in ethics also becomes a key factor when considering artificial intelligence. AI is not seen as a neutral tool, and policies have been set in place to ensure it is not misused under human bias. Although AI is a valuable tool in medicine, the current ethical policies are not up to standard to accommodate AI as it is a multi-disciplinary approach. AI in healthcare is not available to make clinical decisions; however, it can provide assistance in surgeries, imaging, etc.\n\n\n=== Technoethics and cognition ===\nThis area of technoethical inquiry is concerned with technology's relation to the human mind, artificial agents, and society. Topics of study that would fit into this category would be artificial morality and moral agents, moral outsourcing, technoethical systems and techno-addiction.\n\nAn artificial agent describes any type of technology that is created to act as an agent, either of its own power or on behalf of another agent. An artificial agent may try to advance its own goals or those of another agent.\n\n\n=== Mass surveillance ===\nThe ethics behind mass surveillance has become a highly discussed ethical topic in the twenty-first century, especially in the United States due to the tragedy of 9/11. Some areas of ethical concern involve privacy, discrimination, trust in government, infringement of government-granted rights/basic human rights, conflict of interest, stigmatization, and obtrusiveness. Many of these ethical topics in the timeframe between 2001 and 2021 have become the main topic of discussion in many recent laws all throughout the world. Shortly after 9/11 when the United States began to fear the idea that more terrorist attacks could occur on American soil. A law passed on October 26, 2001, known as the Patriot Act was one of the first larger Mass Surveillance laws passed in the United States. Years later Europe would begin to follow suit with their own set of mass surveillance laws after a string of terrorist attacks. After the 2015 terrorist attacks in France, the French government would move forward with passing the International Electronic Communications Law. The IEC would recognize the power of the French Directorate-General for External Security allowing them to collect, monitor, and intercept all communications sent or received on French territory. In 2016, the United Kingdom would pass the Investigatory Powers Act of 2016, a law allowing the GCHQ to engage in acquisition, interception, and equipment interference of communications/systems sent by anyone on British territory. Finally, in 2016, another law like the Investigatory Powers Act was passed in Germany that was named the Communications Intelligence Gathering Act. This act allowed the German intelligence community to gather foreign nationals communications while they were in German territory. In 2021, Australia passed a law known as the Surveillance Legislation Amendment, which granted the Australian Federal Police and Australian Criminal Intelligence Commission the right to modify or delete data of suspected offenders, Collect intelligence on criminal networks, and finally, forcefully break into a suspected offender's online account. After these laws were passed all throughout Europe, and later on in Australia, a string of protests would begin to arise involving the laws, as citizens from each country would feel it infringed their privacy rights.\nTwo years after the Investigatory Powers Act of 2016 was passed in the United Kingdom the English High Court would rule that the act would have to be rewritten. This ruling occurred due to the High Court finding the law to be incompatible with EU law since the law \"authorizes the UK government to issue retention notices with no prior independent checks, such as review by a court or other body, and for the purpose of investigating crime that is not \"serious crime\"; and (2) subsequent access to any retained data was similarly not subject to any independent authorization and not limited to the purpose of combating \"serious crime\". The origin of this ruling comes from a human rights group known as Liberty who first began to battle the act shortly after it was enacted as they stated it violates the United Kingdom's citizens the right to privacy. In 2020, Four years after Germany enacted the Communications Intelligence Gathering Act it would also make its way to court to be reviewed. Receiving heavy backlash from multiple members of the German public and Non-German citizens. Many of these complaints continued to dwell on the same issue of the privacy of both German and non-German citizens. After a two day trial, the high German court did rule that the law was unconstitutional and gave the German parliament until 2021 to make corrections to the Act.\nThough, as of recent in the year 2020 during the height of the COVID-19 Pandemic. The ethical atmosphere regarding public health surveillance began to take center stage due to its overall use during the height of the pandemic. The purpose of this mass surveillance was for data collection of  the transmission of the COVID-19. Though, many individuals around the world cited they felt this form of surveillance infringed on their privacy and basic human rights. Another concern regarding this level of surveillance was the lack of government or institutional policy documents regarding how to address the ethical challenges around mass surveillance to track a pandemic transmission rate. The use of this mass surveillance was used on a far larger scale compared to some of the other acts passed in recent years, as this had a more global focus due to the want to bring the transmission of COVID-19 to a halt. For example, on March 16, 2020, the Israeli government allowed emergency regulations regarding mass location tracking of citizens to slow the spread of the disease. Singapore and Taiwan also did something similar, yet their method of mass surveillance was allowing their law-enforcement agencies to monitor quarantine orders.\n\n\n=== Technoethics and society ===\nThis field is concerned with the uses of technology to ethically regulate aspects of a society. For example: digital property ethics, social theory, law, science, organizational ethics and global ethics.\nDigital property rights or DPR refers to individual rights on information available online such as email accounts, online website accounts, posts, blogs, pictures, and other digital media. Digital property rights can be regulated and protected by making the digital property tamper-proof, by adding legal clause to the digital properties, and limiting the sharing of software code.\nSocial theory refers to how societies change and develop over time in terms of behavior and explanation of behaviors. Technology has a great impact on social change. As technology evolves and upgrades, human interaction goes along with the changes. \"Technological theory suggests that technology is an important factor for social change, and it would initiate changes in the arrangement of social relationships\".\nOrganizational ethics refers to the code of conduct and the way an organization responds to stimulus. Techno ethics plays a role in organizational ethics because technology can be embedded and incorporated in many different aspects of ethical values.\n\n\n=== Technofeminism ===\nTechnoethics has concerned itself with society as a general group and made no distinctions between the genders, but considers technological effects and influences on each gender individually. This is an important consideration as some technologies are created for use by a specific gender, including birth control, abortion, fertility treatments, and Viagra. Feminists have had a significant influence on the prominence and development of reproductive technologies. Technoethical inquiry must examine these technologies' effects on the intended gender while also considering their influence on the other gender. Another dimension of technofeminism concerns female involvement in technological development: women's participation in the field of technology has broadened society's understanding of how technology affects the female experience in society.\n\n\n=== Information and communication technoethics ===\nInformation and communication technoethics is \"concerned with ethical issues and responsibilities arising when dealing with information and communication technology in the realm of communication.\" This field is related to internet ethics, rational and ethical decision making models, and information ethics. A major area of interest is the convergence of technologies: as technologies become more interdependent and provide people with multiple ways of accessing the same information, they transform society and create new ethical dilemmas. This is particularly evident in the realms of the internet. In recent years, users have had the unprecedented position of power in creating and disseminating news and other information globally via social networking; the concept of \"citizen journalism\" primarily relates to this. With developments in the media, has led to open media ethics as Ward writes, leading to citizen journalism.\nIn cases such as the 2004 Indian Ocean Tsunami or the 2011 Arab Spring movements, citizen journalists were seen to have been significant sources of facts and information in relation to the events. These were re-broadcast by news outlets, and more importantly, re-circulated by and to other internet users. As Jay David Bolter and Richard Grusin state in their book Remediation: Understanding New Media (1999): \"The liveness of the Web is a refashioned version of the liveness of broadcast television\" However, it is commonly political events (such as 'Occupy' movements or the Iran Elections of 2009) that tend to raise ethical questions and concerns. In the latter example, there had been efforts made by the Iranian government in censoring and prohibiting the spread of internal happenings to the outside by its citizen journalists. This occurrence questioned the importance of the spread of crucial information regarding the issue, and the source from which it came from (citizen journalists, government authorities, etc.). This goes to prove how the internet \"enables new forms of human action and expression [but] at the same time it disables [it]\" Information and Communication Technoethics also identifies ways to develop ethical frameworks of research structures in order to capture the essence of new technologies.\n\n\n=== Educational and professional technoethics ===\n\nTechnoethical inquiry in the field of education examines how technology impacts the roles and values of education in society. This field considers changes in student values and behavior related to technology, including access to inappropriate material in schools, online plagiarism using material copied directly from the internet, or purchasing papers from online resources and passing them off as the student's own work. Educational technoethics also examines the digital divide that exists between educational institutions in developed and developing countries or between unequally-funded institutions within the same country: for instance, some schools offer students access to online material, while others do not. Professional technoethics focuses on the issue of ethical responsibility for those who work with technology within a professional setting, including engineers, medical professionals, and so on. Efforts have been made to delineate ethical principles in professions such as computer programming (see programming ethics).\n\n\n=== Environmental and engineering technoethics ===\n\nEnvironmental technoethics originate from the 1960s and 1970s' interest in environment and nature. The field focuses on the human use of technologies that may impact the environment; areas of concern include transport, mining, and sanitation. Engineering technoethics emerged in the late 19th century. As the Industrial Revolution triggered a demand for expertise in engineering and a need to improve engineering standards, societies began to develop codes of professional ethics and associations to enforce these codes. Ethical inquiry into engineering examines the \"responsibilities of engineers combining insights from both philosophy and the social sciences.\"\n\n\n=== Technoethical assessment and design ===\n\nA technoethical assessment (TEA) is an interdisciplinary, systems-based approach to assessing ethical dilemmas related to technology. TEAs aim to guide actions related to technology in an ethical direction by advancing knowledge of technologies and their effects; successful TEAs thus produce a shared understanding of knowledge, values, priorities, and other ethical aspects associated with technology. TEAs involve five key steps:\n\nEvaluate the intended ends and possible side effects of the technology in order to discern its overall value (interest).\nCompare the means and intended ends in terms of technical and non-technical (moral and social) aspects.\nReject those actions where the output (overall value) does not balance the input in terms of efficiency and fairness.\nConsider perspectives from all stakeholder groups.\nExamine technological relations at a variety of levels (e.g. biological, physical, psychological, social, and environmental).\nTechnoethical design (TED) refers to the process of designing technologies in an ethical manner, involving stakeholders in participatory design efforts, revealing hidden or tacit technological relations, and investigating what technologies make possible and how people will use them. TED involves the following four steps:\n\nEnsure that the components and relations within the technological system are explicitly understood by those in the design context.\nPerform a TEA to identify relevant technical knowledge.\nOptimize the technological system in order to meet stakeholders' and affected individuals' needs and interests.\nConsult with representatives of stakeholder and affected groups in order to establish consensus on key design issues.\nBoth TEA and TED rely on systems theory, a perspective that conceptualizes society in terms of events and occurrences resulting from investigating system operations. Systems theory assumes that complex ideas can be studied as systems with common designs and properties which can be further explained using systems methodology. The field of technoethics regards technologies as self-producing systems that draw upon external resources and maintain themselves through knowledge creation; these systems, of which humans are a part, are constantly in flux as relations between technology, nature, and society change. TEA attempts to elicit the knowledge, goals, inputs, and outputs that comprise technological systems. Similarly, TED enables designers to recognize technology's complexity and power, to include facts and values in their designs, and to contextualize technology in terms of what it makes possible and what makes it possible.\n\n\n== Organizational technoethics ==\nRecent advances in technology and their ability to transmit vast amounts of information in a short amount of time has changed the way information is being shared amongst co-workers and managers throughout organizations across the globe. Starting in the 1980s with information and communications technologies (ICTs), organizations have seen an increase in the amount of technology that they rely on to communicate within and outside of the workplace. However, these implementations of technology in the workplace create various ethical concerns and in turn a need for further analysis of technology in organizations. As a result of this growing trend, a subsection of technoethics known as organizational technoethics has emerged to address these issues.\n\n\n== Key scholarly contributions ==\nKey scholarly contributions linking ethics, technology, and society can be found in a number of seminal works:\n\nThe Imperative of Responsibility: In Search of Ethics for the Technological Age (Hans Jonas, 1979).\n On Technology, Medicine and Ethics (Hans Jonas, 1985).\n The Real World of Technology (Franklin, 1990).\nThinking Ethics in Technology: Hennebach Lectures and Papers, 1995-1996 (Mitcham, 1997).\nTechnology and the Good Life (Higgs, Light & Strong, 2000).\nReadings in the Philosophy of Technology (Kaplan, 2004).\nEthics and technology: Ethical issues in an age of information and communication technology (Tavani, 2004).\nThis resulting scholarly attention to ethical issues arising from technological transformations of work and life has helped given rise to a number of key areas (or branches) of technoethical inquiry under various research programs (i.e., computer ethics, engineering ethics, environmental technoethics, biotech ethics, nanoethics, educational technoethics, information and communication ethics, media ethics, and Internet ethics).\n\n\n== See also ==\nAlgorithmic bias\nDemocratic transhumanism\nEngineering ethics\nEthics of artificial intelligence\nInformation ethics\nInformation privacy\nOrganizational technoethics\nPhilosophy of technology\nRobotic governance\nTechno-progressivism\nTechnocriticism\nDigital public goods\n\n\n== References ==\n\nHans Jonas, The Imperative of Responsibility: In Search of Ethics for the Technological Age (1979).\nHans Jonas, On Technology, Medicine and Ethics (1985).\nMelanie G. Snyders, CyberEthics and Internet Downloads: An Age by Age Guide to Teaching Children what they need to know (2005).\n\n\n== Further reading ==\n\n\n=== General ===\nHans Jonas (2003). \"Toward a Philosophy of Technology\" (PDF). Oxford: Blackwell Publishing. Archived from the original (PDF) on 2017-08-09. Retrieved 2013-08-22.\nKristin Shrader-Frechette. (2003). \"Technology and Ethics,\" in Philosophy of Technology:  The Technological Condition, Oxford:  Blackwell Publishing.\nEugene Mirman. (2009) \"The Will To Whatevs: A Guide to Modern Life.\" Harper Perennial.\nDaniel A. Vallero. (2007) \"Biomedical Ethics for Engineers: Ethics and Decision Making in Biomedical and Biosystem Engineering.\" Amsderdam: Academic Press.\n\n\n=== Ethics, technology and engineering ===\nFleddermann, C.B. (2011). Engineering Ethics. Prentice Hall. 4th edition.\nHarris, C.E., M.S. Pritchard, and M.J. Rabins (2008). Engineering Ethics: Concepts and Cases. Wadsworth Publishing, 4th edition.\nHauser-Katenberg, G., W.E. Katenberg, and D. Norris (2003). \"Towards Emergent Ethical Action and the Culture of Engineering,\" Science and Engineering Ethics, 9, 377–387.\nHuesemann M.H., and J.A. Huesemann (2011). Technofix: Why Technology Won't Save Us or the Environment, Chapter 14, \"Critical Science and Social Responsibility\", New Society Publishers.\nLayton, E. (1986). The Revolt of the Engineers: Social Responsibility and the American Engineering Profession. The Johns Hopkins University Press.\nMartin, M.W., and R. Schinzinger (2004). Ethics in Engineering. McGraw-Hill. 4th edition.\nPeterson, M. (2017). The Ethics of Technology: A Geometric Analysis of Five Moral Principles. Oxford University Press.\nMitcham, C. (1984). Thinking through technology, the path between engineering and philosophy. Chicago:  The University of Chicago Press.\nVan de Poel, I., and L. Royakkers (2011). Ethics, Technology, and Engineering: An Introduction. Wiley-Blackwell.\n\n\n=== Education and technology ===\nMarga, A. (2004). \"University Reforms in Europe:  Some Ethical Considerations,\" Higher Education in Europe, Vol. 79, No. 3, pp. 432–820.\n\n\n== External links ==\nNational Academies of Engineering's Center for Engineering, Ethics, and Society\nStanford Law School's Center for Internet and Society\nCalifornia Polytechnic State University's Ethics + Emerging Sciences Group\nUniversity of Notre Dame's Reilly Center for Science, Technology, and Values\nArizona State University's Lincoln Center for Applied Ethics\nSanta Clara University's Markkula for Applied Ethics\nCentre for Applied Philosophy and Public Ethics, Australia\nYale University's Interdisciplinary Center for Bioethics\nCase Western Reserve University's Inamori Center for Ethics and Excellence\nUniversity of Delaware's Center for Science, Ethics, and Public Policy\nUniversity of Oxford's Future of Humanity Institute\nUNESCO - Ethics of Science and Technology\n4TU.Centre for Ethics and Technology\nCyber Crime Archived 2018-12-22 at the Wayback Machine\n\n\n=== Journals ===\nStanford Encyclopedia of Philosophy\nJournal of Ethics and Social Philosophy\nPhilosophy and Technology\nEthics and Information Technology\nJournal of Responsible Innovation\nTechnology in Society\nMinds and Machines\nJournal of Information, Communication and Ethics in Society\n\n\n=== Organizations ===\nEthics and Emerging Sciences Group\nW. Maurice Centre for Applied Ethics\nUnited Nations Educational, Scientific and Cultural Organization UNESCO\nInstitute for Ethics in Artificial intelligence\nInstitute for Ethics and Emerging Technologies\nInstitute for Ethics in AI\n\n\n=== Technoethics ===\nAhmad Al Khabaz vs Dawson college\nAdam-swartz case\nBagheri, A. (2011). The Impact of the UNESCO Declaration in Asian and Global Bioethics. Asian Bioethics Review, Vol. 3(2), 52–64.\nBolter, J. D., Grusin, R., & Grusin, R. A. (2000). Remediation: Understanding new media. MIT Press.\nBorgmann, A. (1984). Technology and the character of contemporary life: A philosophical inquiry. Chicago: University of Chicago Press.\nCoyne, R., 1995, Designing information technology in the postmodern age: From method to metaphor. Cambridge MA: MIT Press.\nCastells, M. (2000). The rise of the network society. The information age: economy, society and culture (Vol. 1). Malden, UK:Blackwell.\nCanada Foundation for Innovation: www.innovation.ca\nPuig de la Bellacasa, M. (2017). Matters of care : speculative ethics in more than human worlds. Minneapolis: University of Minnesota Press.\nDreyfus, H.L., 1999, \"Anonymity versus commitment: The dangers of education on the internet,\" Ethics and Information Technology, 1/1, p. 15-20, 1999\nGert, Bernard. 1999, \"Common Morality and Computing,\" Ethics and Information Technology, 1/1, 57–64.\nFleddermann, C.B. (2011). Engineering Ethics. Prentice Hall. 4th edition.\nHarris, C.E., M.S. Pritchard, and M.J. Rabins (2008). Engineering Ethics: Concepts and Cases. Wadsworth Publishing, 4th edition.\nHeidegger, M., 1977, The Question Concerning Technology and Other Essays, New York: Harper Torchbooks.\nHuesemann M.H., and J.A. Huesemann (2011). Technofix: Why Technology Won't Save Us or the Environment, Chapter 14, \"Critical Science and Social Responsibility\", New Society Publishers, ISBN 0865717044, 464 pp.\nIhde, D. 1990, Technology and the Lifeworld: From garden to earth. Bloomington and Indianapolis: Indiana University Press.\nJonas, H. (1979). The Imperative of Responsibility: In Search of Ethics for the Technological Age, Chicago: Chicago University Press.\nJonas, H. (1985). On technology, medicine and ethics. Chicago: Chicago University Press.\nLevinas, E., 1991, Otherwise than Being or Beyond Essence, Dordrecht: Kluwer Academic Publishers.\nLuppicini, R., (2008). The emerging field of Technoethics. In R. Luppicini and R. Adell (eds.). Handbook of Research on Technoethics (pp. 49–51). Hershey: Idea Group Publishing.\nLuppicini, R., (2010).  Technoethics and the Evolving Knowledge Society: Ethical Issues in Technological Design, Research, Development and Innovation.  Hershey, PA: IGI Global.\nMartin, M.W., and R. Schinzinger (2004). Ethics in Engineering. McGraw-Hill. 4th edition.\nMitcham, C. (1994). Thinking through technology. University of Chicago Press.\nMitcham, C. (1997). Thinking ethics in technology: Hennebach lectures and papers, 1995–1996. Golden, CO: Colorado School of Mines Press.\nMitcham, C. (2005). Encyclopedia of science, technology, and ethics. Detroit: Macmillan Reference.\nSullins, J. (2010). RoboWarfare: can robots be more ethical than humans on the battlefield. Journal of Ethics and Information Technology, Vol. 12(3), 263–275.\nTavani, H. T. (2004). Ethics and technology: Ethical issues in an age of information and communication technology. Hoboken, NJ: John Wiley & Sons.\nTurkle, S. 1996, \"Parallel lives: Working on identity in virtual space.\" in D. Grodin & T. R. Lindlof, (eds.), Constructing the self in a mediated world, London: Sage, 156–175.\nVan de Poel, I., and L. Royakkers (2011). Ethics, Technology, and Engineering: An Introduction. Wiley-Blackwell.\nWard, S. & Wasserman, T. (2010). \"Towards and open ethics: implications of new media platforms for global ethics discourse\". Journal of Mass Media Ethics. 25 (4): 275–292. doi:10.1080/08900523.2010.512825. S2CID 143463760.",
  "links": {
    "1970s in science and technology": "",
    "1980s in science and technology": "",
    "1990s in science and technology": "",
    "2000s in science and technology": "",
    "2004 Indian Ocean earthquake and tsunami": "",
    "2010s in science and technology": "",
    "9/11": "",
    "ARPANET": "",
    "A Theory of Justice": "",
    "A Treatise of Human Nature": ""
  },
  "url": "https://en.wikipedia.org/wiki/Ethics_of_technology"
}