{
  "title": "Existence",
  "content": "Existence is the state of having being or reality in contrast to nonexistence and nonbeing. Existence is often contrasted with essence: the essence of an entity is its essential features or qualities, which can be understood even if one does not know whether the entity exists.\nOntology is the philosophical discipline studying the nature and types of existence. Singular existence is the existence of individual entities while general existence refers to the existence of concepts or universals. Entities present in space and time have concrete existence in contrast to abstract entities, like numbers and sets. Other distinctions are between possible, contingent, and necessary existence and between physical and mental existence. The common view is that an entity either exists or not with nothing in between, but some philosophers say that there are degrees of existence, meaning that some entities exist to a higher degree than others.\nThe orthodox position in ontology is that existence is a second-order property or a property of properties. For example, to say that lions exist means that the property of being a lion is possessed by an entity. A different view states that existence is a first-order property or a property of individuals. This means existence is similar to other properties of individuals, like color and shape. Alexius Meinong and his followers accept this idea and say that not all individuals have this property; they state that there are some individuals, such as Santa Claus, that do not exist. Universalists reject this view; they see existence as a universal property of every individual.\nThe concept of existence has been discussed throughout the history of philosophy and already played a role in ancient philosophy, including Presocratic philosophy in Ancient Greece, Hindu and Buddhist philosophy in Ancient India, and Daoist philosophy in ancient China. It is relevant to fields such as logic, mathematics, epistemology, philosophy of mind, philosophy of language, and existentialism.\n\n\n== Definition and related terms ==\nDictionaries define existence as the state of being real and to exist as having being or participating in reality. Existence sets real entities apart from imaginary ones, and can refer both to individual entities or to the totality of reality. The word \"existence\" entered the English language in the late 14th century from old French and has its roots in the medieval Latin term ex(s)istere, which means \"to stand forth\", \"to appear\", and \"to arise\". Existence is studied by the subdiscipline of metaphysics known as ontology.\nThe terms \"being\", \"reality\", and \"actuality\" are often used as synonyms of \"existence\", but the exact definition of existence and its connection to these terms is disputed. According to metaphysician Alexius Meinong (1853–1920), all entities have being but not all entities have existence. He argues merely possible objects like Santa Claus have being but lack existence. Ontologist Takashi Yagisawa (20th century–present) contrasts existence with reality; he sees \"reality\" as the more-fundamental term because it equally characterizes all entities and defines existence as a relative term that connects an entity to the world it inhabits. According to philosopher Gottlob Frege (1848–1925), actuality is narrower than existence because only actual entities can produce and undergo changes, in contrast to non-actual existing entities like numbers and sets. According to some philosophers, like Edmund Husserl (1859–1938), existence is an elementary concept, meaning it cannot be defined in other terms without involving circularity. This would imply characterizing existence or talking about its nature in a non-trivial manner may be difficult or impossible.\nDisputes about the nature of existence are reflected in the distinction between thin and thick concepts of existence. Thin concepts of existence understand existence as a logical property that every existing thing shares; they do not include any substantial content about the metaphysical implications of having existence. According to one view, existence is the same as the logical property of self-identity. This view articulates a thin concept of existence because it merely states what exists is identical to itself without discussing any substantial characteristics of the nature of existence. Thick concepts of existence encompass a metaphysical analysis of what it means that something exists and what essential features existence implies. According to one proposal, to exist is to be present in space and time, and to have effects on other things. This definition is controversial because it implies abstract objects such as numbers do not exist. Philosopher George Berkeley (1685–1753) gave a different thick concept of existence; he stated: \"to be is to be perceived\", meaning all existence is mental.\nExistence contrasts with nonexistence, a lack of reality. Whether objects can be divided into existent and nonexistent objects is a subject of controversy. This distinction is sometimes used to explain how it is possible to think of fictional objects like dragons and unicorns but the concept of nonexistent objects is not generally accepted; some philosophers say the concept is contradictory. Closely related contrasting terms are nothingness and nonbeing. Existence is commonly associated with mind-independent reality but this position is not universally accepted because there could also be forms of mind-dependent existence, such as the existence of an idea inside a person's mind. According to some idealists, this may apply to all of reality.\nAnother contrast is made between existence and essence. Essence refers to the intrinsic nature or defining qualities of an entity. The essence of something determines what kind of entity it is and how it differs from other kinds of entities. Essence corresponds to what an entity is, while existence corresponds to the fact that it is. For instance, it is possible to understand what an object is and grasp its nature even if one does not know whether this object exists. According to some philosophers, there is a difference between entities and the fundamental characteristics that make them the entities they are. Martin Heidegger (1889–1976) introduced this concept; he calls it the ontological difference and contrasts individual beings with being. According to his response to the question of being, being is not an entity but the background context that makes all individual entities intelligible.\n\n\n== Types of existing entities ==\nMany discussions of the types of existing entities revolve around the definitions of different types, the existence or nonexistence of entities of a specific type, the way entities of different types are related to each other, and whether some types are more fundamental than others. Examples are the existence or nonexistence of souls; whether there are abstract, fictional, and universal entities; and the existence or nonexistence of possible worlds and objects besides the actual world. These discussions cover the topics of the basic stuff or constituents underlying all reality and the most general features of entities.\n\n\n=== Singular and general ===\nThere is a distinction between singular existence and general existence. Singular existence is the existence of individual entities. For example, the sentence \"Angela Merkel exists\" expresses the existence of one particular person. General existence pertains to general concepts, properties, or universals. For instance, the sentence \"politicians exist\" states the general term \"politician\" has instances without referring to a particular politician.\nSingular and general existence are closely related to each other, and some philosophers have tried to explain one as a special case of the other. For example, according to Frege, general existence is more basic than singular existence. One argument in favor of this position is that singular existence can be expressed in terms of general existence. For instance, the sentence \"Angela Merkel exists\" can be expressed as \"entities that are identical to Angela Merkel exist\", where the expression \"being identical to Angela Merkel\" is understood as a general term. Philosopher Willard Van Orman Quine (1908–2000) defends a different position by giving primacy to singular existence and arguing that general existence can be expressed in terms of singular existence.\nA related question is whether there can be general existence without singular existence. According to philosopher Henry S. Leonard (1905–1967), a property only has general existence if there is at least one actual object that instantiates it. Philosopher Nicholas Rescher (1928–2024), by contrast, states that properties can exist if they have no actual instances, like the property of \"being a unicorn\". This question has a long philosophical tradition in relation to the existence of universals. According to Platonists, universals have general existence as Platonic forms independently of the particulars that exemplify them. According to this view, the universal of redness exists independently of the existence or nonexistence of red objects. Aristotelianism also accepts the existence of universals but says their existence depends on particulars that instantiate them and that they are unable to exist by themselves. According to this view, a universal that is not present in the space and time does not exist. According to nominalists, only particulars have existence and universals do not exist.\n\n\n=== Concrete and abstract ===\nThere is an influential distinction in ontology between concrete and abstract objects. Many concrete objects, like rocks, plants, and other people, are encountered in everyday life. They exist in space and time. They have effects on each other, like when a rock falls on a plant and damages it, or a plant grows through rock and breaks it. Abstract objects, like numbers, sets, and types, have no location in space and time, and lack causal powers. The distinction between concrete objects and abstract objects is sometimes treated as the most-general division of being.\nThe existence of concrete objects is widely agreed upon but opinions about abstract objects are divided. Realists such as Plato accept the idea that abstract objects have independent existence. Some realists say abstract objects have the same mode of existence as concrete objects; according to others, they exist in a different way. Anti-realists state that abstract objects do not exist, a view that is often combined with the idea that existence requires a location in space and time or the ability to causally interact.\n\n\n=== Possible, contingent, and necessary ===\nA further distinction is between merely possible, contingent, and necessary existence. An entity has necessary existence if it must exist or could not fail to exist. This means that it is not possible to newly create or destroy necessary entities. Entities that exist but could fail to exist are contingent; merely possible entities do not exist but could exist.\n\nMost entities encountered in ordinary experience, like telephones, sticks, and flowers, have contingent existence. The contingent existence of telephones is reflected in the fact that they exist in the present but did not exist in the past, meaning that it is not necessary that they exist. It is an open question whether any entities have necessary existence. According to some nominalists, all concrete objects have contingent existence while all abstract objects have necessary existence.\nAccording to some theorists, one or several necessary beings are required as the explanatory foundation of the cosmos. For instance, the philosophers Avicenna (980–1037) and Thomas Aquinas (1225–1274) say that God has necessary existence. A few philosophers, like Baruch Spinoza (1632–1677), see God and the world as the same thing, and say that all entities have necessary existence to provide a unified and rational explanation of everything.\nThere are many academic debates about the existence of merely possible objects. According to actualism, only actual entities have being; this includes both contingent and necessary entities but excludes merely possible entities. Possibilists reject this view and state there are also merely possible objects besides actual objects. For example, metaphysician David Lewis (1941–2001) states that possible objects exist in the same way as actual objects so as to provide a robust explanation of why statements about what is possible and necessary are true. According to him, possible objects exist in possible worlds while actual objects exist in the actual world. Lewis says the only difference between possible worlds and the actual world is the location of the speaker; the term \"actual\" refers to the world of the speaker, similar to the way the terms \"here\" and \"now\" refer to the spatial and temporal location of the speaker.\nThe problem of contingent and necessary existence is closely related to the ontological question of why there is anything at all or why is there something rather than nothing. According to one view, the existence of something is a contingent fact, meaning the world could have been totally empty. This is not possible if there are necessary entities, which could not have failed to exist. In this case, global nothingness is impossible because the world needs to contain at least all necessary entities.\n\n\n=== Physical and mental ===\nEntities that exist on a physical level include objects encountered in everyday life, like stones, trees, and human bodies, as well as entities discussed in modern physics, like electrons and protons. Physical entities can be observed and measured; they possess mass and a location in space and time. Mental entities like perceptions, experiences of pleasure and pain as well as beliefs, desires, and emotions belong to the realm of the mind; they are primarily associated with conscious experiences but also include unconscious states like unconscious beliefs, desires, and memories.\nThe mind–body problem concerns the ontological status of and relation between physical and mental entities and is a frequent topic in metaphysics and philosophy of mind. According to materialists, only physical entities exist on the most-fundamental level. Materialists usually explain mental entities in terms of physical processes; for example, as brain states or as patterns of neural activation. Idealism, a minority view in contemporary philosophy, rejects matter as ultimate and views the mind as the most basic reality. Dualists like René Descartes (1596–1650) believe both physical and mental entities exist on the most-fundamental level. They state they are connected to one another in several ways but that one cannot be reduced to the other.\n\n\n=== Other types ===\nFictional entities are entities that exist as inventions inside works of fiction. For example, Sherlock Holmes is a fictional character in Arthur Conan Doyle's book A Study in Scarlet and flying carpets are fictional objects in the folktales One Thousand and One Nights. According to anti-realism, fictional entities do not form part of reality in any substantive sense. Possibilists, by contrast, see fictional entities as a subclass of possible objects; creationists say that they are artifacts that depend for their existence on the authors who first conceived them.\nIntentional inexistence is a similar phenomenon concerned with the existence of objects within mental states. This happens when a person perceives or thinks about an object. In some cases, the intentional object corresponds to a real object outside the mental state, like when accurately perceiving a tree in the garden. In other cases, the intentional object does not have a real counterpart, like when thinking about Bigfoot. The problem of intentional inexistence is the challenge of explaining how one can think about entities that do not exist since this seems to have the paradoxical implication that the thinker stands in a relation to a nonexisting object.\n\n\n== Modes and degrees of existence ==\nClosely related to the problem of different types of entities is the question of whether their modes of existence also vary. This is the case according to ontological pluralism, which states entities belonging to different types differ in both their essential features and in the ways they exist. This position is sometimes found in theology; it states God is radically different from his creation and emphasizes his uniqueness by saying the difference affects both God's features and God's mode of existence.\nAnother form of ontological pluralism distinguishes the existence of material objects from the existence of space-time. According to this view, material objects have relative existence because they exist in space-time; the existence of space-time itself is not relative in this sense because it just exists without existing within another space-time.\nThe topic of degrees of existence is closely related to the problem of modes of existence. This topic is based on the idea that some entities exist to a higher degree or have more being than other entities, similar to the way some properties, such as heat and mass, have degrees. According to philosopher Plato (428/427–348/347 BCE), for example, unchangeable Platonic forms have a higher degree of existence than physical objects.\nThe view that there are different types of entities is common in metaphysics but the idea that they differ from each other in their modes or degrees of existence is often rejected, implying that a thing either exists or does not exist without in-between alternatives. Metaphysician Peter van Inwagen (1942–present) uses the idea that there is an intimate relationship between existence and quantification to argue against different modes of existence. Quantification is related to the counting of objects; according to Inwagen, if there were different modes of entities, people would need different types of numbers to count them. Because the same numbers can be used to count different types of entities, he concludes all entities have the same mode of existence.\n\n\n== Theories of the nature of existence ==\n\nTheories of the nature of existence aim to explain what it means for something to exist. A central dispute in the academic discourse about the nature of existence is whether existence is a property of individuals. An individual is a unique entity, like Socrates or a particular apple. A property is something that is attributed to an entity, like \"being human\" or \"being red\", and usually expresses a quality or feature of that entity. The two main theories of existence are first-order and second-order theories. First-order theories understand existence as a property of individuals while second-order theories say existence is a second-order property, that is, a property of properties.\nA central challenge for theories of the nature of existence is an understanding of the possibility of coherently denying the existence of something, like the statement: \"Santa Claus does not exist\". One difficulty is explaining how the name \"Santa Claus\" can be meaningful even though there is no Santa Claus.\n\n\n=== Second-order theories ===\nSecond-order theories understand existence as a second-order property rather than a first-order property. They are often seen as the orthodox position in ontology. For instance, the Empire State Building is an individual object and \"being 443.2 meters (1,454 ft) tall\" is a first-order property of it. \"Being instantiated\" is a property of \"being 443.2 meters tall\" and therefore a second-order property. According to second-order theories, to talk about existence is to talk about which properties have instances. For example, this view says that the sentence \"God exists\" means \"Godhood is instantiated\" rather than \"God has the property of existing\".\nA key reason against characterizing existence as a property of individuals is that existence differs from regular properties. Regular properties, such as being a building and being 443.2 meters tall, express what an object is like but do not directly describe whether or not that building exists. According to this view, existence is more fundamental than regular properties because an object cannot have any properties if it does not exist.\nAccording to second-order theorists, quantifiers rather than predicates express existence. Predicates are expressions that apply to and classify objects, usually by attributing features to them, such as \"is a butterfly\" and \"is happy\". Quantifiers are terms that talk about the quantity of objects that have certain properties. Existential quantifiers express that there is at least one object, like the expressions \"some\" and \"there exists\", as in \"some cows eat grass\" and \"there exists an even prime number\". In this regard, existence is closely related to counting because to assert that something exists is to assert that the corresponding concept has one or more instances.\nSecond-order views imply a sentence like \"egg-laying mammals exist\" is misleading because the word \"exist\" is used as a predicate in them. These views say the true logical form is better expressed in reformulations like \"there exist entities that are egg-laying mammals\". This way, \"existence\" has the role of a quantifier and \"egg-laying mammals\" is the predicate. Quantifier constructions can also be used to express negative existential statements; for instance, the sentence \"talking tigers do not exist\" can be expressed as \"it is not the case that there exist talking tigers\".\n\nMany ontologists accept that second-order theories provide a correct analysis of many types of existential sentences. It is, however, controversial whether it is correct for all cases. Some problems relate to assumptions associated with everyday language about sentences like \"Ronald McDonald does not exist\". This type of statement is called negative singular existential and the expression Ronald McDonald is a singular term that seems to refer to an individual. It is not clear how the expression can refer to an individual if, as the sentence asserts, this individual does not exist. According to a solution philosopher Bertrand Russell (1872–1970) proposed, singular terms do not refer to individuals but are descriptions of individuals. This theory states negative singular existentials deny an object matching the descriptions exists without referring to a nonexistent individual. Following this approach, the sentence \"Ronald McDonald does not exist\" expresses the idea: \"it is not the case there is a unique happy hamburger clown\".\n\n\n=== First-order theories ===\nAccording to first-order theories, existence is a property of individuals. These theories are less-widely accepted than second-order theories but also have some influential proponents. There are two types of first-order theories: Meinongianism and universalism.\n\n\n==== Meinongianism ====\nMeinongianism, which describes existence as a property of some but not all entities, was first formulated by Alexius Meinong. Its main assertion is that there are some entities that do not exist, meaning objecthood is independent of existence. Proposed examples of nonexistent objects are merely possible objects such as flying pigs, as well as fictional and mythical objects like Sherlock Holmes and Zeus. According to this view, these objects are real and have being, even though they do not exist. Meinong states there is an object for any combination of properties. For example, there is an object that only has the single property of \"being a singer\" with no other properties. This means neither the attribute of \"wearing a dress\" nor the absence of it applies to this object. Meinong also includes impossible objects like round squares in this classification.\n\nAccording to Meinongians, sentences describing Sherlock Holmes and Zeus refer to nonexisting objects. They are true or false depending on whether these objects have the properties ascribed to them. For instance, the sentence \"Pegasus has wings\" is true because having wings is a property of Pegasus, even though Pegasus lacks the property of existing.\nOne key motivation of Meinongianism is to explain how negative singular existentials like \"Ronald McDonald does not exist\" can be true. Meinongians accept the idea that singular terms like \"Ronald McDonald\" refer to individuals. For them, a negative singular existential is true if the individual it refers to does not exist.\nMeinongianism has important implications for understandings of quantification. According to an influential view defended by Willard Van Orman Quine, the domain of quantification is restricted to existing objects. This view implies quantifiers carry ontological commitments about what exists and what does not exist. Meinongianism differs from this view by saying the widest domain of quantification includes both existing and nonexisting objects.\nSome aspects of Meinongianism are controversial and have received substantial criticism. According to one objection, one cannot distinguish between being an object and being an existing object. A closely related criticism states objects cannot have properties if they do not exist. A further objection is that Meinongianism leads to an \"overpopulated universe\" because there is an object corresponding to any combination of properties. A more specific criticism rejects the idea that there are incomplete and impossible objects.\n\n\n==== Universalism ====\nUniversalists agree with Meinongians that existence is a property of individuals but deny there are nonexistent entities. Instead, universalists state existence is a universal property; all entities have it, meaning everything exists. One approach is to say existence is the same as self-identity. According to the law of identity, every object is identical to itself or has the property of self-identity. This can be expressed in predicate logic as \n  \n    \n      \n        ∀\n        x\n        (\n        x\n        =\n        x\n        )\n      \n    \n    {\\displaystyle \\forall x(x=x)}\n  \n.\nAn influential argument in favor of universalism is that the denial of the existence of something is contradictory. This conclusion follows from the premises that one can only deny the existence of something by referring to that entity and that one can only refer to entities that exist.\nUniversalists have proposed different ways of interpreting negative singular existentials. According to one view, names of fictional entities like \"Ronald McDonald\" refer to abstract objects, which exist even though they do not exist in space and time. This means, when understood in a strict sense, all negative singular existentials are false, including the assertion that \"Ronald McDonald does not exist\". Universalists can interpret such sentences slightly differently in relation to the context. In everyday life, for example, people use sentences like \"Ronald McDonald does not exist\" to express the idea that Ronald McDonald does not exist as a concrete object, which is true. Another approach is to understand negative singular existentials as neither true nor false but meaningless because their singular terms do not refer to anything.\n\n\n== History ==\n\n\n=== Western philosophy ===\nWestern philosophy originated with the Presocratic philosophers, who aimed to replace earlier mythological accounts of the universe by providing rational explanations based on foundational principles of all existence. Some, like Thales (c. 624–545 BCE) and Heraclitus (c. 540–480 BCE), suggested concrete principles like water and fire are the root of existence. Anaximander (c. 610–545 BCE) opposed this position; he believed the source must lie in an abstract principle that is beyond the world of human perception.\n\nPlato (428/427–348/347 BCE) argued that different types of entities have different degrees of existence and that shadows and images exist in a weaker sense than regular material objects. He said unchangeable Platonic forms have the highest type of existence, and saw material objects as imperfect and impermanent copies of Platonic forms.\nPhilosopher Aristotle (384–322 BCE) accepted Plato's idea that forms are different from matter, but he challenged the idea that forms have a higher type of existence. Instead, he believed forms cannot exist without matter. He stated: \"being is said in many ways\" and explored how different types of entities have different modes of existence. For example, he distinguished between substances and their accidents, and between potentiality and actuality.\nNeoplatonists like Plotinus (204–270 CE) suggested reality has a hierarchical structure. They believed a transcendent entity, called \"the One\" or \"the Good\", is responsible for all existence. From it emerges the intellect, which in turn gives rise to the soul and the material world.\n\nIn medieval philosophy, Anselm of Canterbury (1033–1109 CE) formulated the influential ontological argument, which aims to deduce the existence of God from the concept of God. Anselm defined God as the greatest conceivable being. He reasoned that an entity that did not exist outside his mind would not be the greatest conceivable being, leading him to the conclusion God exists.\nThomas Aquinas (1224–1274 CE) distinguished between the essence of a thing and its existence. According to him, the essence of a thing constitutes its fundamental nature. He argued it is possible to understand what an object is and grasp its essence, even if one does not know whether the object exists. He concluded from this observation that existence is not part of the qualities of an object and should be understood as a separate property. Aquinas also considered the problem of creation from nothing and said only God has the power to truly bring new entities into existence. These ideas later inspired metaphysician Gottfried Wilhelm Leibniz's (1646–1716) theory of creation; Leibniz said to create is to confer actual existence to possible objects.\nThe philosophers David Hume (1711–1776) and Immanuel Kant (1724–1804) rejected the idea that existence is a property. According to Hume, objects are bundles of qualities. He said existence is not a property because there is no impression of existence besides the bundled qualities. Kant came to a similar conclusion in his criticism of the ontological argument; according to him, this proof fails because one cannot deduce from the definition of a concept whether entities described by this concept exist. Kant said existence does not add anything to the concept of the object; it only indicates this concept is exemplified. According to philosopher Georg Wilhelm Friedrich Hegel (1770–1831), there is no pure being or pure nothing, only becoming.\n\nPhilosopher and psychologist Franz Brentano (1838–1917) agreed with Kant's criticism and his position that existence is not a real predicate. Brentano used this idea to develop his theory of judgments, which states all judgments are existential judgments; they either affirm or deny the existence of something. He stated judgments like \"some zebras are striped\" have the logical form \"there is a striped zebra\" while judgments like \"all zebras are striped\" have the logical form \"there is not a non-striped zebra\".\nGottlob Frege (1848–1925) and Bertrand Russell (1872–1970) aimed to refine the idea of what it means that existence is not a regular property. They distinguished between regular first-order properties of individuals and second-order properties of other properties. According to their view, existence is the second-order property of \"being instantiated\". Russell further developed the idea that general sentences like \"lions exist\" are at their most fundamental form about individuals by stating that there is an individual that is a lion.\nWillard Van Orman Quine (1908–2000) followed Frege and Russell in accepting existence as a second-order property. He drew a close link between existence and the role of quantification in formal logic. He applied this idea to scientific theories and stated a scientific theory is committed to the existence of an entity if the theory quantifies over this entity. For example, if a theory in biology asserts that \"there are populations with genetic diversity\", this theory has an ontological commitment to the existence of populations with genetic diversity. Alexius Meinong (1853–1920) was an influential critic of second-order theories and developed the alternative view that existence is a property of individuals and that not all individuals have this property.\n\n\n=== Eastern philosophy ===\n\nMany schools of thought in Eastern philosophy discuss the problem of existence and its implications. For instance, the ancient Hindu school of Samkhya articulated a metaphysical dualism according to which the two types of existence are pure consciousness (Purusha) and matter (Prakriti). Samkhya explains the manifestation of the universe as the interaction between these two principles. The Vedic philosopher Adi Shankara (c. 700–750 CE) developed a different approach in his school of Advaita Vedanta. Shankara defended a metaphysical monism by defining the divine (Brahman) as the ultimate reality and the only existent. According to this view, the impression that there is a universe consisting of many distinct entities is an illusion (Maya). The essential features of ultimate reality are described as Sat Chit Ananda—meaning existence, consciousness, and bliss.\nA central doctrine in Buddhist philosophy is called the \"three marks of existence\", which are aniccā (impermanence), anattā (absence of a permanent self), and dukkha (suffering). Aniccā is the doctrine that all of existence is subject to change, meaning everything changes at some point and nothing lasts forever. Anattā expresses a similar state in relation to persons by stating that people do not have a permanent identity or a separate self. Ignorance about aniccā and anattā is seen as the main cause of dukkha by leading people to form attachments that cause suffering.\n\nA central idea in many schools of Chinese philosophy, like Laozi's (6th century BCE) Daoism, is that a fundamental principle known as dao is the source of all existence. The term is often translated as \"the way\" and is understood as a cosmic force that governs the natural order of the world. Chinese metaphysicians debated whether dao is a form of being or whether, as the source of being, it belongs to non-being.\nThe concept of existence played a central role in Arabic-Persian philosophy. The Islamic philosophers Avicenna (980–1037 CE) and Al-Ghazali (1058–1111 CE) discussed the relationship between existence and essence, and said the essence of an entity is prior to its existence. The additional step of instantiating the essence is required for the entity to come into existence. Philosopher Mulla Sadra (1571–1636 CE) rejected this priority of essence over existence, and said essence is only a concept that is used by the mind to grasp existence. Existence, by contrast, encompasses the whole of reality, according to his view.\n\n\n=== Other traditions ===\nIndigenous American philosophies tend to emphasize the interconnectedness of all existence and the importance of maintaining balance and harmony with nature. This is often combined with an animist outlook that ascribes a spiritual essence to some or all entities, including plants, rocks, and places.\nThe interest in the relational aspect of existence is also found in African philosophy, which explores how all entities are causally linked to form an ordered world. African philosophy also examines the idea of an underlying and all-pervading life force responsible for animating entities and their influence on each other.\n\n\n== In various disciplines ==\n\n\n=== Formal logic ===\n\nFormal logic studies deductively valid arguments. In first-order logic, which is the most-commonly used system of formal logic, existence is expressed using the existential quantifier (\n  \n    \n      \n        ∃\n      \n    \n    {\\displaystyle \\exists }\n  \n). For example, the formula \n  \n    \n      \n        ∃\n        x\n        \n          Horse\n        \n        (\n        x\n        )\n      \n    \n    {\\displaystyle \\exists x{\\text{Horse}}(x)}\n  \n can be used to state horses exist. The variable x ranges over all elements in the domain of quantification and the existential quantifier expresses that at least one element in this domain is a horse. In first-order logic, all singular terms like names refer to objects in the domain and imply the object exists. Because of this, one can deduce \n  \n    \n      \n        ∃\n        x\n        \n          Honest\n        \n        (\n        x\n        )\n      \n    \n    {\\displaystyle \\exists x{\\text{Honest}}(x)}\n  \n (someone is honest) from \n  \n    \n      \n        \n          Honest\n        \n        (\n        B\n        i\n        l\n        l\n        )\n      \n    \n    {\\displaystyle {\\text{Honest}}(Bill)}\n  \n (Bill is honest). If only one object matching the description exists, the unique existential quantifier \n  \n    \n      \n        ∃\n        !\n      \n    \n    {\\displaystyle \\exists !}\n  \n can be used.\nMany logical systems that are based on first-order logic also follow this idea. Free logic is an exception because it allows the presence of empty names that do not refer to an object in the domain. With this modification, it is possible to apply logical reasoning to fictional objects instead of limiting it to regular objects. In free logic one can express that Pegasus is a flying horse using the formula \n  \n    \n      \n        \n          Flyinghorse\n        \n        (\n        P\n        e\n        g\n        a\n        s\n        u\n        s\n        )\n      \n    \n    {\\displaystyle {\\text{Flyinghorse}}(Pegasus)}\n  \n. As a consequence of this modification, one cannot infer from this type of statement that something exists. This means the inference from \n  \n    \n      \n        \n          Flyinghorse\n        \n        (\n        P\n        e\n        g\n        a\n        s\n        u\n        s\n        )\n      \n    \n    {\\displaystyle {\\text{Flyinghorse}}(Pegasus)}\n  \n to \n  \n    \n      \n        ∃\n        x\n        \n          Flyinghorse\n        \n        (\n        x\n        )\n      \n    \n    {\\displaystyle \\exists x{\\text{Flyinghorse}}(x)}\n  \n is invalid in free logic, even though it is valid in first-order logic. Free logic uses an additional existence predicate (\n  \n    \n      \n        E\n        !\n      \n    \n    {\\displaystyle E!}\n  \n) to say a singular term refers to an existing object. For example, the formula \n  \n    \n      \n        E\n        !\n        (\n        H\n        o\n        m\n        e\n        r\n        )\n      \n    \n    {\\displaystyle E!(Homer)}\n  \n can be used to say Homer exists while the formula \n  \n    \n      \n        ¬\n        E\n        !\n        (\n        P\n        e\n        g\n        a\n        s\n        u\n        s\n        )\n      \n    \n    {\\displaystyle \\lnot E!(Pegasus)}\n  \n states Pegasus does not exist.\n\n\n=== Others ===\nThe disciplines of epistemology, philosophy of mind, and philosophy of language deal with mental and linguistic representations in their attempt to understand the nature of knowledge, the mind, and language. This brings with it the problem of reference or how representations can refer to existing objects. Examples of such representations are beliefs, thoughts, perceptions, words, and sentences. For instance, in the sentence \"Barack Obama is a Democrat\", the name \"Barack Obama\" refers to a particular individual. The problem of reference also affects the epistemology of perception. In particular, this concerns the problem of whether perceptual impressions establish a direct contact with reality.\nClosely related to the problem of reference is the relationship between true representations and existence. According to truthmaker theory, true representations require a truthmaker, i.e., an entity whose existence is responsible for the representation being true. For example, the sentence \"kangaroos live in Australia\" is true because there are kangaroos in Australia; the existence of these kangaroos is the truthmaker of the sentence. Truthmaker theory states there is a close relationship between truth and existence; there exists a truthmaker for every true representation.\nMany of the individual sciences are concerned with the existence of particular types of entities and the laws governing them, such as physical things in physics and living entities in biology. The natural sciences employ a great variety of concepts to classify entities; these are known as natural kinds, and include categories like protons, gold, and elephants. According to scientific realists, these entities have mind-independent being; scientific anti-realists say the existence of these entities and categories is based on human perceptions, theories, and social constructs.\nA similar problem concerns the existence of social kinds, which are basic concepts used in the social sciences, such as race, gender, disability, money, and nation state. Social kinds are often understood as social constructions that, while useful for describing the complexities of human social life, do not form part of objective reality on the most fundamental level. According to the controversial Sapir–Whorf hypothesis, the social institution of language influences or fully determines how people perceive and understand the world.\nExistentialism is a school of thought that explores the nature of human existence. Among its key ideas is that existence precedes essence. This means that existence is more basic than essence. As a result, the nature and purpose of human beings are not pre-existing but develop in the process of living. According to this view, humans are thrown into a world that lacks pre-existing intrinsic meaning. They must determine for themselves their purpose and what meaning their life should have. Existentialists use this idea to explore the role of freedom and responsibility in actively shaping one's life. Feminist existentialists investigate the effects of gender on human existence, for example, on the experience of freedom. Influential existentialists include Søren Kierkegaard (1813–1855), Friedrich Nietzsche (1844–1900), Jean-Paul Sartre (1905–1980), and Simone de Beauvoir (1908–1986). Existentialism has influenced reflections on the role of human existence in sociology. Existentialist sociology examines the ways humans experience the social world and construct reality. Existence theory is a relatively recent approach that focuses on the temporal aspect of existence in society. It explores how the existential milestones to which people aspire influence their lives.\nMathematicians are often interested in the existence of certain mathematical objects. For example, number theorists ask how many prime numbers exist within a certain interval. The statement that at least one mathematical object matching a certain description exists is called an existence theorem. Metaphysicians of mathematics investigate whether mathematical objects exist not only in relation to mathematical axioms but also as part of the fundamental structure of reality. This position is affirmed by Platonists, while nominalists believe mathematical objects lack a more-substantial form of existence, for instance, because they are merely useful fictions.\nMany debates in theology revolve around the existence of the divine, and arguments have been presented for and against God's existence. Cosmological arguments state that God must exist as the first cause to explain facts about the existence and aspects of the universe. According to teleological arguments, the only way to explain the order and complexity of the universe and human life is by reference to God as the intelligent designer. An influential argument against the existence of God relies on the problem of evil since it is not clear how evil could exist if there was an all-powerful, all-knowing, and benevolent God. Another argument points to a lack of concrete evidence for God's existence.\n\n\n== See also ==\n\nCogito, ergo sum\nSolipsism\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Citations ===\n\n\n=== Sources ===\n\n\n== External links ==\n\n Quotations related to Existence at Wikiquote\nThe Concept of Existence: History and Definitions from Leading Philosophers",
  "links": {
    "A Study in Scarlet": "",
    "A Treatise Concerning the Principles of Human Knowledge": "",
    "Abhidharma": "",
    "Absolute idealism": "",
    "Abstract and concrete": "",
    "Abstract object": "",
    "Abstract object theory": "",
    "Academic Skepticism": "",
    "Accident (philosophy)": "",
    "Achintya Bheda Abheda": ""
  },
  "url": "https://en.wikipedia.org/wiki/Existence"
}