{
  "title": "Goal setting",
  "content": "Goal setting involves the development of an action plan designed in order to motivate and guide a person or group toward a goal. Goals are more deliberate than desires and momentary intentions. Therefore, setting goals means that a person has committed thought, emotion, and behavior towards attaining the goal. In doing so, the goal setter has established a desired future state which differs from their current state thus creating a mismatch which in turn spurs future actions. Goal setting can be guided by goal-setting criteria (or rules) such as SMART criteria. Goal setting is a major component of personal-development and management literature. Studies by Edwin A. Locke and his colleagues, most notably, Gary Latham have shown that more specific and ambitious goals lead to more performance improvement than easy or general goals. Difficult goals should be set ideally at the 90th percentile of performance, assuming that motivation and not ability is limiting attainment of that level of performance. As long as the person accepts the goal, has the ability to attain it, and does not have conflicting goals, there is a positive linear relationship between goal difficulty and task performance.\nThe theory of Locke and colleagues states that the simplest, most direct motivational explanation of why some people perform better than others is because they have different performance goals. The essence of the theory is:\n\nDifficult specific goals lead to significantly higher performance than easy goals, no goals, or even the setting of an abstract goal such as urging people to do their best.\nHolding ability constant, and given that there is goal commitment, the higher the goal the higher the performance.\nVariables such as praise, feedback, or the participation of people in decision-making about the goal only influence behavior to the extent that they lead to the setting of and subsequent commitment to a specific difficult goal.\n\n\n== History ==\nGoal setting theory has been developed through both in the field and laboratory settings. Cecil Alec Mace carried out the first empirical studies in 1935.\nEdwin A. Locke began to examine goal setting in the mid-1960s and continued researching goal setting for more than 30 years. He found that individuals who set specific, difficult goals performed better than those who set general, easy goals. Locke derived the idea for goal-setting from Aristotle's form of final causality. Aristotle speculated that purpose can cause action; thus, Locke began researching the impact goals have on human activity. Locke developed and refined his goal-setting theory in the 1960s, publishing his first article on the subject, \"Toward a Theory of Task Motivation and Incentives\", in 1968. This article established the positive relationship between clearly identified goals and performance.\n\n\n== Main idea ==\nAfter controlling for ability, goals that are difficult to achieve and specific tend to increase performance far more than easy goals, no goals or telling people to do their best. It therefore follows that the simplest motivational explanation of why some individuals outperform others is that they have different goals. A goal can be made more specific by:\n\nSetting goals can affect outcomes in four ways:\n\nChoice\nGoals may narrow someone's attention and direct their efforts toward goal-relevant activities and away from goal-irrelevant actions.\n\nEffort\nGoals may make someone more effortful. For example, if someone usually produces 4 widgets per hour but wants to produce 6 widgets per hour, then they may work harder to produce more widgets than without that goal.\n\nPersistence\nGoals may make someone more willing to work through setbacks.\n\nCognition\nGoals may cause someone to develop and change their behavior.\n\n\n== Secondary ideas ==\n\n\n=== Goal commitment ===\nPeople perform better when they are committed to achieving certain goals. Through an understanding of the effect of goal setting on individual performance, organizations are able to use goal setting to benefit organizational performance. In addition, another aspect that goes with goal commitment is also goal acceptance. This is an individual's willingness to pursue their specific goal. Locke and Latham (2002) have indicated three moderators that indicate goal setting success:\n\nExpanding the three from above, the level of commitment is influenced by external factors. Such as the person assigning the goal, setting the standard for the person to achieve/perform. This influences the level of commitment by how compliant the individual is with the one assigning the goal.   An external factor can also be the role models of the individual. For example, say an individual looks up to their manager and cares about their opinion, the individual is more likely to listen to goal-setting strategies from that individual, and ultimately become more committed to their desired goal.\nInternal factors can derive from their participation level in the work to achieve the goal. What they expect from themselves can either flourish their success, or destroy it. Also, the individual may want to appear superior to their peers or competitors. They want to achieve the goal the best and be known for it. The self-reward of accomplishing a goal is usually one of the main keys that keeps individuals committed. For example, if an individual was working toward becoming the president of their company, if they achieve their goal, they could reward themselves with something of importance to them.\nAnother route individuals can take to set their goals is to follow (STD) that is, setting their goals to be Specific, Time-bound, and Difficult. Specifically, an individual's goal should be set at the 90th percentile of difficulty. \n\n\n=== Goal–performance relationship ===\nLocke and colleagues (1981) examined the behavioral effects of goal-setting, concluding that 90% of laboratory and field studies involving specific and challenging goals led to higher performance than did easy or no goals. This is because if an individual is intrinsically motivated by a goal, they will want to conquer the goal to receive internal rewards, and will be satisfied because of it.\nLocke and Latham (2006) argue that it is not sufficient to urge employees to \"do their best\". \"Doing one's best\" has no external reference, which makes it useless in eliciting specific behavior. To elicit some specific form of behavior from another person, it is important that this person has a clear view of what is expected from them. A goal is thereby of vital importance because it helps an individual to focus their efforts in a specified direction. In other words, goals canalize behavior. However, when faced with complex tasks and directions that are difficult to specify, telling someone to \"do their best\", with a focus on learning, can sometimes lead to the discovery of better strategies whereby specific goals can then be set.: 707  A solution to this apparent contradiction where the \"do your best\" condition can lead to greater task performance than a high specific performance goal under certain conditions is resolved when task complexity is taken into account. Specifically, in a complex task where the prerequisite skills and knowledge to perform the task are not yet in place, the \"do your best\" condition can outperform the performance goal condition. If a high, specific learning goal is set instead then the goal-performance relationship is maintained and the (learning) goal setting condition outperforms the \"do your best\" condition.\n\n\n=== Feedback ===\nFeedback and goal setting are highly interrelated and more effective when used in conjunction with each other.: 708  Feedback cannot be given without goals in the same way that goals can not be established without providing feedback.\nGoal setting can lead to the creation of feedback loops, either negative or positive comparison of the output to the goal. Negative feedback loops lead to increasing the input associated with goal attainment to improve output in the next loop cycle. Positive feedback loops, if not sufficiently reinforced, can lead to subsequent setting of goals at a less difficult level. \nNegative feedback can be reframed and errors seen as beneficial to the learning and goal achievement process and in turn increase participant resilience. This reframing process can be taught through error management training and with clear instructions about how to engage with errors. Error management training involves participants practicing metacognitive activities of planning, monitoring, and evaluation.\nNegative feedback also interacts with goal type, perceived tension and conscientiousness. People with high conscientiousness and performance goals experience high tension following negative feedback which leads to lower performance. This is not the case with learning goals where the effect of negative feedback is less detrimental.\nWithout proper feedback channels it is impossible for employees to adapt or adjust to the required behavior. Managers should keep track of performance to allow employees to see how effective they have been in attaining their goals. Providing feedback on short-term objectives helps to sustain motivation and commitment to the goal. There are two forms of feedback in which the employee can receive (Outcome and Process feedback). Outcome feedback is after the goal or activity is finished, and process feedback is during the completion of a goal. Feedback should be provided on the strategies followed to achieve the goals and on the final outcomes achieved.\n\n\n=== Honing goal setting using temporal motivation theory ===\nLocke and Latham (2004) note that goal-setting theory lacks \"the issue of time perspective\". Taking this into consideration, Steel and Konig (2006) utilize their temporal motivation theory (TMT) to account for goal setting's effects, and suggest new hypotheses regarding a pair of its moderators: goal difficulty and proximity. The effectiveness of goal setting can be explained by two aspects of TMT: the principle of diminishing returns and temporal discounting. Similar to the expression \"the sum of the parts can be greater than the whole\", a division of a project into several, immediate, subgoals appears to take advantage of these two elements.\n\n\n== Superordinate goals ==\nGoals can be modelled as forming a hierarchy, within such a hierarchy superordinate goals are the goals at a higher level of abstraction. Superordinate goals tend to less concrete and lack a specific endpoint but have some advantages of more concrete subordinate goal.\n\n\n== Self-regulated learning ==\n\nWhile the literature on self-regulated learning covers a broad variety of theoretical perspectives and concepts such as control theory, self-efficacy, action regulation, and resource allocation, goal-setting is a crucial component of virtually all of these approaches as the initiator of self-regulation mechanisms such as planning, monitoring, metacognition, attention, learning strategies, persistence, time management, environmental structuring, help seeking, emotion control, motivation, effort, and self-efficacy.\n\n\n== Goal setting in groups ==\n\n\n=== Objectives and key results ===\n\nBased initially on Drucker's management by objectives (MBO) model, a popular applied version of goal setting theory for business is the objectives and key results model (OKR). Originally developed at Intel by Andy Grove, the tool was designed to set individual and collaborative goal team goals that are specific, concrete, challenging, ambitious and have measurable and time bound key results. OKRs were later introduced to many other companies and foundations such as Google and the Gates Foundation by Grove disciple John Doerr whose book Measure what Matters outlines the use of OKRs across a wide range of organizational settings.\n\n\n== Goal setting in sports and fitness ==\nThe tenets of Goal setting theory generally hold true in physical domains. In a study of high school students using sit up tests all students set a specific and challenging goal out performed students with a non-specific goal supporting the principles of goal specificity and goal difficulty from general goal setting theory. Goal setting appears to be especially beneficial to athletes with self-inflated narcissism by protecting athletes with that personality trait from their tendency to underperform in tedious but necessary training with no audience present.\n\n\n== Goal setting in workplaces ==\nIn business, goal setting remains a popular evidence based approach to align efforts across organizations, communicate objectives, and improve motivation as well as task performance for individuals and groups. Goal setting encourages participants to put in substantial effort over and above a \"do your best condition\". Also, because every member has defined expectations for their role, little room is left for inadequate, marginal effort to go unnoticed\n\n\n=== Employee motivation ===\n\nThe more employees are motivated, the more they are stimulated and interested in accepting goals. These success factors are interdependent. For example, the expected outcomes of goals are positively influenced when employees are involved in the goal setting process. Not only does participation increase commitment in attaining the goals that are set, participation influences self-efficacy as well. Additionally, feedback is necessary to monitor one's progress. When feedback is not presented, an employee might think they are not making enough progress. This can reduce self-efficacy and thereby harm the performance outcomes in the long run.\n\n\n=== Workplace training ===\nGoal setting is used to improve training outcomes. For example, Tomokazu Kishiki and colleagues performed a randomized controlled trial on surgical trainees to determine whether or not their participation in a goal-setting program would improve performance and testing scores; the addition of achievable goals appeared to be beneficial to the trainees. When goal setting is applied optimally during training processes, both employee motivation and organizational commitment can increase.\nFurthermore, training in goal setting has been linked to higher levels of performance among adults and children with mild to severe intellectual disability.\n\n\n=== Work-life balance ===\nGoal setting is also used by some companies with a stated aim of ensuring that employee work life balance is maintained. The idea behind this is that employees set a non-work related goal to improve their well-being, and managers help team members stick to those goals. An example of this in practice is \"One Simple Thing\", a goal-setting well-being practice employed by Google.\n\n\n=== Impact on individual performance ===\nManagers cannot constantly drive motivation, or keep track of an employee's work on a continuous basis. Goals are therefore an important tool for managers, since goals have the ability to function as a self-regulatory mechanism that helps employees prioritize tasks.\nFour mechanisms through which goal setting can affect individual performance are:\n\nGoals focus attention toward goal-relevant activities and away from goal-irrelevant activities.\nGoals serve as an energizer: Higher goals induce greater effort, while low goals induce lesser effort.\nGoals affect persistence; constraints with regard to resources affect work pace.\nGoals activate cognitive knowledge and strategies that help employees cope with the situation at hand.\n\n\n== Interventions in education ==\n\n\n=== Domain general benefits from goal setting ===\nGoal setting research has shown positive results as an effective, and inexpensive to implement intervention for a broad range of academic purposes across a range of age groups. Beginning with struggling undergraduate students, there is some evidence that when compared to a control group, students who had set general rather than domain specific academic goals experienced the following benefits in the semester after the intervention namely, i) increased GPA, ii) a higher probability of maintaining a full course load, iii) a reduction in self reported negative affect. While goal setting research tends to be domain specific, these results among others, does suggest that benefits from goal setting may have broader benefits for goal setters even beyond the domain of the goal itself.\nFurther work with undergraduates has suggested that these broader benefits apply even if non-academic goals are set. This could imply that the original goal setting theory can be modified to include a more domain general \"spread\" effect from superordinate life goals and that writing about general life goals regardless of domain can improve academic performance. Developing these life goals can include linked procedures such as i) reflecting on/envisaging one's best possible life, ii) listing good quality goals relevant to achieving this best possible life, iii) strategizing on how to achieve their attainment, iv) reflect in writing about anticipated obstacles, v) developing specific plans for overcoming these anticipated obstacles.\n\n\n=== Closing achievement gaps based on gender and ethnicity ===\nGoal setting interventions have shown promising and scalable results in terms of closing persistent gender (ongoing male underperformance) and ethnicity achievement gaps in the areas of academic achievement and increased retention rates. In one study persistent male underperformance in tertiary education was almost entirely closed to achieve parity with females after one year of the intervention. Similar albeit slower positive impacts in closing the ethnicity achievement gap by the second year of the same goal setting intervention were reported. These findings suggest that a goal setting intervention early in students' academic careers can significantly and substantially reduce gender and ethnic minority inequalities in academic achievement at least at the tertiary level. More work remains to be done to see if similar conclusions can be drawn at the level of secondary education.\n\n\n=== Use of reflection diaries for goal setting ===\nGoal-setting activities with final-year university students focused around self-reflective and personal growth through setting three growth goals and recording progress in reflective diaries shows that goal setting and making progress towards the goals can have many positive impacts. These include increased self-esteem, time and improved stress management and self-monitoring skills as well as motivating, and energizing effects. These suggest that, at least with undergraduates, the setting of growth goals with a reflective diary element can be a useful addition to academic programs.\n\n\n=== Online learning and massive open online courses (MOOCs) ===\n\nGoal-setting activities including the setting of both performance and learning goals have been associated with both increased performance and completion rates for MOOC participants. Students who completed a goal setting writing activity at the start of a course achieved more over a longer period of time than those who did not set goals. For online learning more generally, students who have a better understanding of the tasks set better more detailed goals and in turn achieve higher performance suggesting that instructional time spent explaining learning tasks can be beneficial.\n\n\n=== Behavior management ===\nProperly implemented taught goal-setting programs are effective in K-12 schools for behavior and emotional management interventions. In particular, programs that included student input on the goal setting process as well as the collection of targeting data to monitor progress and ensure the delivery of high quality feedback to students on progress towards goals were more effective behavior management interventions. In order to ensure a properly designed goal setting intervention for behavior management some variation of a checklist can be an effective addition to behavioral management programs. A typical such checklist could include the following factors:\n\nIdentify and define behavior\nEstablish a behavior monitoring plan\nCollect baseline data\nSet goals\nMonitor progress towards goals\nReview data\nGoal-setting also works effectively either or its own or as part of a package of other behavior management interventions.\n\n\n== In personal life ==\n\n\n=== Identifying sub-goals ===\nCommon personal goals include losing weight, achieving good grades, and saving money. The strategy for goal setting begins with the big picture; taking a look at the big picture before breaking it into smaller components allows one to focus on the primary goal. Once the main goal is set, breaking it up into smaller, more achievable components helps in the planning portion of setting the goal. These smaller, more obtainable objectives promote self-esteem and provide instant feedback to keep the individual on task.\n\n\n=== Time and task management ===\nTime management is the practice of systematically finishing tasks assigned by superiors or one's self in an efficient and timely manner. Time management steps require identifying the objective and laying out a plan that maximizes efficiency and execution of the objective. There are many useful mobile apps that help with personal goal setting; some of the categories include budgeting, wellness, calendar and productivity apps.\nThe book What They Don't Teach You in the Harvard Business School is known for citing a study which found that written goals have a significant effect on financial success, but in 1996 Fast Company determined that this study did not occur. In 2015, a research study on goals found those who wrote them down accomplished them at a significantly higher rate than those who did not.\n\n\n=== Life goals ===\nThere is evidence that setting and reflecting on progress life goals are an effective intervention to provide both a sense of purpose and increase happiness. In particular, setting life goals based on others leads to more positive emotions and therefore has a more positive impact on happiness than goals focused on oneself. Further evidence for this effect is provided by the more broader personal benefits of prosocial behavior and acts of kindness towards others rather than self care/focusing on oneself.\n\n\n=== Recovery from illness and injury ===\nThere is evidence from randomized control trials that goal setting treatments improved executive function, attention/working memory, and learning in stroke patients. As well as suggesting that there is a motivational element to vascular cognitive impairment caused by strokes, or at least in terms of recovering from them, goal setting does appear to be a useful, easy to implement and cost effective solution to improve cognitive outcomes in stroke patients.\n\n\n== Limitations and side effects ==\nGoal-setting has limitations and there is some evidence of potentially harmful side effects to both individuals and organizations from misuse of goals and in particular the use of performance/outcome goals.\n\n\n=== Leader and organization goal misalignment ===\nIn an organization, a goal of a manager may not align with the goals of the organization as a whole. In such cases, the goals of an individual may come into direct conflict with the employing organization. Without clearly aligning goals between the organization and the individual, overall performance may suffer.\n\n\n=== Unethical behavior ===\n\nAdditionally, there is evidence that suggests that goal-setting can foster unethical behavior when people do not achieve their desired goals. Schweitzer et al. found empirical support for their hypotheses that specific goals, rather than \"do your best\" goals, would lead participants to overstate performance if their true performance fell short of the goal, with the overstatement frequency increasing as the performance-goal gap narrowed.  Niven and Healy found that a subset of the population having a relatively high tendency to morally justify behavior was more likely to engage in the kind of cheating identified by Schweitzer et al.  Particular side effects associated with goal setting include a narrow focus that neglects non-goal areas, more unethical behavior, distorted risk preferences, damage to organizational culture, and reduced intrinsic motivation. High performance goal seem particularly likely to induce unethical behaviour under certain circumstances by creating the desire to achieve the goal but also altering moral reasoning processes and in particular, moral disengagement and encourage moral motivated reasoning due to the focus on attaining the goal.\nGoals may also result in overly singleminded competition within organizations if two or more people have goals that encourage competition rather than cooperation. This can include withholding information or ideas, obstructing the goal progress of others or becoming indifferent to their progress and so withdrawing completely from interaction with other organization members. A solution to some of these potential issues is to set a unifying organizational vision or superordinate goal.: 180–181 \n\n\n=== Tunnel vision ===\nGoal setting may have the drawback of inhibiting implicit learning if the required knowledge and strategic awareness are not in place: goal setting may encourage simple focus on an outcome without openness to exploration, understanding, or growth and result in lower performance than simply encouraging people to \"do their best\".: 68–69  A solution to this limitation is to set learning goals as well as performance goals, so that learning is expected as part of the process of reaching goals. The section on learning goals has more information on this effect and how to counter it. Goal setting also may impair performance in certain situations. Such situations include when an individual becomes overly focused on accomplishing a previously-set goal that they end up underperforming on current tasks.\n\n\n=== Narrow focus ===\nGoal setting theory has been criticized for being too narrow in focus to be a complete theory of work motivation as goals alone are not sufficient to address all aspects of workplace motivation. In particular, it does not address why some people choose goals they dislike or how to increase intrinsic rather than extrinsic motivation.  This raises the possibility that goal setting may in turn be subsumed within a more comprehensive theory of work motivation in time.\n\n\n== Developments in theory ==\n\n\n=== Self efficacy ===\nAn important addition to goal setting theory was the incorporation of self-efficacy from Bandura's social cognitive theory. Broadly defined as task specific self-confidence, goal setting theory incorporates self-efficacy in the following ways:\n\nPeople with higher self-efficacy set harder goals which as per the terms of the theory lead to higher motivation and task performance\nPeople with higher self-efficacy are more committed to the goals they have set and in turn more likely to achieve them.\nPeople with higher self-efficacy are more likely to respond positively to negative feedback and use it productively rather than be discouraged.\nAppropriately challenging leader assigned goals and communicating these powerfully can increase follower self-efficacy as they directly imply that the leader has confidence in the employees' ability to achieve them.\nLeaders can also increase follower self-efficacy, and in turn goal commitment and task performance, by providing quality training and either modeling task performance themselves or providing appropriate performance models.\nSelf-efficacy levels can also influence how people react to not meeting specific challenging goals. People with high self-efficacy redouble their efforts whereas people with low self-efficacy expend less effort and coast along. Goal achievement also interacts with self-efficacy and goal achievement does not necessarily lead to increased efforts as after meeting challenging goals some can be reluctant to expend a similar level of effort again and will settle for the goal they have.\n\n\n=== Goal choice ===\nSelf-efficacy, past experiences, and various other social factors influence goal setting. Failure to achieve previous goals often leads to setting more achievable goals.\n\n\n=== Learning goals ===\nThere are times when having specific performance goals is not a best option; this is the case when the goal requires skills or knowledge that have not yet been acquired. Tunnel vision can be a consequence of specific performance goals; if a person is too focused on attaining a specific goal, they may ignore the need to learn new skills or acquire new information. This concept is illustrated well by the \"basketball game task\" study in which observers watched a video of a group of people wearing white shirts and black shirts who are passing a basketball back and forth, and the observers were instructed to count the number of times a basketball is passed between only the players wearing white shirts. During the video, a woman carrying an open umbrella walks across the screen. Of 28 observers who were focused on counting the number of passes between only the players wearing white shirts, only 6 reported noticing the woman carrying the umbrella. When observers watched the video without focusing on a specific task, all of the observers noticed the umbrella woman. In situations where the risk of tunnel vision is high, the best option is to set a learning goal. A learning goal is a generalized goal to achieve knowledge in a certain topic or field, but it can ultimately lead to better performance in more complex tasks related to the learning goals.\nFurther to the above, learning goals can be more specifically operationalized as \"a desired number of strategies, processes, or procedures to be developed in order to master a task'\".  Some specific examples of learning goals from the literature are below:\n\n\"Discover and implement four shortcuts to performing a scheduling task'\n\"Find ten ways of developing a relationship with end-users of our products.\"\nLocke and Latham (2006) attribute this response to metacognition. They believe that \"a learning goal facilitates or enhances metacognition—namely, planning, monitoring, and evaluating progress toward goal attainment\". This is necessary in environments with little or no guidance and structure. Although jobs typically have set goals, individual goals and achievement can benefit from metacognition. Some possible uses of learning goals follow:\n\nLearning goals are likely to help leaders of globally diverse organizations find ways to effectively manage social identity groups and minimize intolerance within a multicultural workforce.\nLearning goals are likely to be effective when leaders confront a situation with a great deal of unknowns and need to make sense of problems, as the learning goals encourage employees to collaborate with others to bring multiple experiences to solve the problem.\n\n\n=== Framing ===\nFraming, or how goals are viewed, influences performance. When one feels threatened and or intimidated by a high goal they perform poorer than those who view the goal as a challenge. Individuals who identify situations as challenge perform better under difficult performance goal conditions. Individuals who view situations as threats get better results using learning goals focused on developing strategy to achieve the task. These results connect goal setting theory to Folkman and Lazurus' Transactional Model of Stress and Coping which focused on the subjective appraisal of stress as being crucial to performance under challenging conditions.\n\n\n=== Habits ===\n\nHabits, defined as \"behavioral tendencies tied to specific contexts, such as time of day, location, the presence of particular people, preceding actions, or even one's mood\", habits develop through context, repetition, and reward and interact closely with goals to impact (often negatively) goal attainment. While goal setting can initiate behaviour change, it does appear likely that interventions combining goal setting with habit management strategies through disrupting bad habits by making them harder to fall into are more likely to be successful. Habits also reduce cognitive load and therefore good habit formation may be of benefit in particular to learning goal achievement which is often associated with more complex tasks by freeing up the cognitive resources needed to work towards the learning goal.\n\n\n=== Affect ===\nRealization of goals has an effect on affect—that is, feelings of success and satisfaction. Achieving goals has a positive effect, and failing to meet goals has negative consequences. However, the effect of goals is not exclusive to one realm. Success in one's job can compensate for feelings of failure in one's personal life.\n\n\n=== Group goals ===\nThe relationship between group goals and individual goals influences group performance; when goals are compatible there is a positive effect, but when goals are incompatible the effects can be detrimental to the group's performance. There is another factor at work in groups, and that is the sharing factor; a positive correlation exists between sharing information within the group and group performance. In the case of group goals, feedback needs to be related to the group, not individuals, in order for it to improve the group's performance.\nGoal concordance (agreement) among members of groups as well as concordance across hierarchies in organizations has positive performance impacts. Research evaluating effects of goals on employee commitment found an indirect relationship mediated by employee perception of organizational support, suggesting that leaders directly support goal setting by individual employees.\nOverall, the available evidence suggests that group goals can have a robust effect on group performance. Less clearly, individual goals may promote group performance if used cautiously as in interdependent groups there is a potential for goal conflict between individual and group goals which could hinder group performance. There does appear to be a need for more work in this area.\n\n\n=== Values ===\n\nIn goal setting terms, values can be defined as trans-situational goals with goals being more specific than values which are higher order and more general. In this sense goals can be defined further as the mechanism by which values lead to action. Goals can provide a vehicle for closing the value-action gap.\n\n\n=== Sub-goals or proximal goals ===\nGoal setting theory generally, but not always, supports the use of sub-goals (also known as proximal goals) which are intermediate/stepping stone goals on the way to goals (also known as distal goals). Proximal goals work by providing immediate incentives to maintain current performance, whereas distal goals are too far removed to have the same effect. In complex problem-solving tasks, setting subgoals increased initial self-efficacy and attaining proximal goals increased self-efficacy, performance satisfaction, and task persistence. One of the ways to reduce self-defeating while accomplishing sub-goals is to make sure to have deadlines for each sub-goal. Setting these deadlines adds a factor of accountability and helps to check on ourselves. The main reason why we don't usually accomplish sub-goals is because we don't put a timeframe to them.\nWhile generally positive, setting too many sub-goals can have negative impacts such as reduced satisfaction (it's not an achievement to complete a goal that is too easy) and send the signal that managers do not have faith in employee ability to achieve challenging goals.\n\n\n=== Goals and traits ===\nOn a basic level, the two types of goals are learning goals and performance goals; each possesses different traits associated with the selected goal.\nLearning goals involve tasks where skills and knowledge can be acquired, whereas performance goals involve easy-to-accomplish tasks that will make one appear successful (thus tasks where error and judgment may be possible are avoided).\nA more complex trait-mediation study is the one conducted by Lee, Sheldon, and Turban (2003), which yielded the following results:\n\nAmotivated orientation (low confidence in one's capabilities) is associated with goal-avoidance motivation, and more generally, associated with lower goals levels and lower performance.\nControl orientation (extrinsic motivation) is associated with both avoidance and approach goals. Approach goals are associated with higher goal levels and higher performance.\nAutonomy goals (intrinsic motivation) leads to mastery goals, enhanced focus, and therefore enhanced performance.\n\n\n=== Goal orientation ===\n\nWhereas goal setting theory was developed in the sub-domain organizational psychology and primarily focuses on motivation and measuring task performance, the related but distinct literature around goal orientation was developed in the sub-domain of educational psychology and tends to focus on ability and trait measurement, this division has led to attempts to integrate the two literatures which in turn has led to the following conclusions:\n\nFor complex tasks a specific, challenging learning goal has a significant positive impact on performance.\nIn contrast, goal orientation affects performance when goals are vague rather than specific and challenging.\nThese conclusions have led to the following inferences:\n\nAs goal setting skills, including how to set a hard, specific goal and when to set a performance rather than a learning goal, are trainable and have greater influence than goal orientation in terms of determining performance, then it follows that the usefulness of tests of goal orientation for recruitment are limited and perhaps most suitable for solitary jobs that offer little training.\nAs well crafted appropriate goals mask the effect of goal orientation it seems likely that new employees assigned specific, high learning goals rather than performance goals will have better job performance regardless of goal orientation.\n\n\n=== Macro-level goals ===\nMacro-level goals refer to goal setting that is applied to the company as a whole. Cooperative goals reduce the negative feelings that occur as a result of alliances and the formation of groups. The most common parties involved are the company and its suppliers. The three motivators for macro-level goals are: self-efficacy, growth goals, and organizational vision.\n\n\n=== Sub-conscious goals ===\n\nRecent reviews of the available evidence suggests that goal setting theory applies to subconscious goals as well as consciously set goals. Subconsciously priming achievement goals through achievement related words and/or suitably triumphal photographs can significantly improve task and therefore job performance. Further enhancing this effect, context specific primes appear to induce substantially stronger goal effects. Furthermore, primed goals and consciously set goals work better together in improving task/job performance. Inevitably the use of sub-conscious goal with employees to improve work performance carries with it many potential ethical issues and concerns.\n\n\n=== General action and inaction goals ===\nAction goals encourage people to engage in more active behaviors, whereas inactive goals tend to result as inactive behaviors. Common action goals can be to do something, perform a certain act, or to go someplace, whereas typical inaction goals can take the form of having a rest or to stop doing something.\nGoal-regulated overall activity and inactivity tendency result from both biological conditions and social-cultural environment. Recent research revealed that most nations hold more favorable attitude towards action rather than inaction, even though some countries value action and inaction slightly differently than others.\nRecent research suggested that people tend to choose inaction goals when they are making decisions among choices where uncertainty could result in negative outcomes, but they prefer action over inaction in their daily behaviors when no deliberation is needed. Timothy D. Wilson and colleagues found that many people \"preferred to administer electric shocks to themselves instead of being left alone with their thoughts\".\n\n\n=== Combining learning and performance goals ===\nIn workplace settings employees are often expected to achieve performance outcomes at tasks that are moderately complex and require learning new things. As noted above, setting performance goals can cause difficulties and lower performance compared to a \"do your best\" condition when prerequisite skills, strategies and knowledge are not in place which may be due to a cognitive load effect arising from the demands of complex tasks for relative novices.  For these sorts of complex task situations learning and performance goals can be used effectively in combination if logically connected. Furthermore, while learning goals do tend to be most effective for new and complex tasks requiring complex application of strategy to achieve the task this does not mean that learning goals will be motivational enough on their own to ensure that the new strategies are used and an additional performance goal could motivate employees to actually use the discovered or acquired strategies to attain the desired outcome.\n\n\n=== Stretch goals ===\nStretch or extremely hard to reach goals remain a subject of considerable debate with arguments both for and against their use. Among the potential negative side effects of stretch goals include them being dismissed as absurd or ignored by employees. Even if taken seriously, stretch goals can lead to employee burn out attempting to achieve them. Caveats aside, there are some ways that stretch goals can be valuable in spurring creative solutions to problems and new directions especially if used alongside more normal goals and without the need to achieve them but instead measure how much progress was made towards them.\n\n\n== Controversies, responses and resolutions ==\nAs a theory developed through induction there have been, and continue to be, circumstances where goal setting theory has been challenged and/or conflicting results have been reported. Specific examples of these controversies and resolutions to them are discussed below.\n\n\n=== Assigned goals versus participatively set goals ===\nThe question of whether or not participatively set goals are more motivating than supervisor set goals arose due to differences in findings between Erez and her colleagues and those of Latham and colleagues. Erez and her colleagues found evidence that under certain circumstances Latham's earlier conclusion that performance was the same regardless of whether or not goals were set by supervisors or participatively, was wrong. This disagreement was resolved through a process beginning with a conversation between Erez and Latham with Locke as the neutral interlocutor which in turn led to both Erez and Latham jointly designing an experiment to explore the reasons for their disagreement. This collaboration of two researchers with differing views is an early example of adversarial collaboration and led to the following published findings that resolved the disagreement:\n\nSupervisor set goals are equally as motivating if they are accompanied by a reason for the goal.\nParticipation in goal setting and decision making improves employee performance through increasing self-efficacy and aiding the discovery of suitable task strategies to achieve goals.\n\n\n=== The Dark Side of Goal Setting ===\nA 2009 article, \"Goals Gone Wild\" by Ordonez et al., sparked controversy by suggesting goal setting might lead to unethical behavior. The authors argued that the benefits of goal setting are often overstated, while its downsides are underreported.\nOne concern is that specific, challenging goals can lead to narrow thinking. Employees become laser-focused on achieving the goal, potentially neglecting other important aspects of their job. For instance, the article cites the case of Ford Motor Company. Under pressure to build a lighter car, safety measures were overlooked. This exemplifies how a singular focus on achieving a goal can have negative consequences.\nOrdonez et al. further argue that setting too many goals or offering excessive rewards for quick results can pressure employees to prioritize quantity over quality and even resort to unethical shortcuts. Additionally, the authors suggest that goal setting might decrease intrinsic motivation by emphasizing extrinsic rewards.\nThis perspective challenges the traditional view of goal setting as a universally positive tool. Locke and Latham countered these arguments, while leveling accusations of Ordonez et al. having violated principles of good scholarship. Locke and Latham emphasized the importance of goals in organizational behavior and for individual purpose setting. A further reply from Ordonez et al. disputed Locke and Latham's points. The debate continues, with some scholars proposing learning goals as a potential solution to ethical concerns arising from performance goals.\nWhile goal setting is a powerful tool for motivation and performance, it requires careful handling. Overemphasizing specific, challenging goals without considering potential downsides can lead to ethical lapses and counterproductive behavior. A more balanced approach is necessary, involving thoughtful goal design, awareness of potential side effects, and ongoing monitoring. By taking a critical look at goal setting, organizations can ensure it fosters both ethical conduct and successful outcomes.\n\n\n== See also ==\n\n\n== References ==",
  "links": {
    "Academy of Management Journal": "",
    "Academy of Management Perspectives": "",
    "Academy of Management Review": "",
    "Action (philosophy)": "",
    "Action theory (philosophy)": "",
    "Adversarial collaboration": "",
    "Affect (psychology)": "",
    "Agency (philosophy)": "",
    "Agency (psychology)": "",
    "Agency (sociology)": ""
  },
  "url": "https://en.wikipedia.org/wiki/Goal_setting"
}