{
  "title": "History",
  "content": "History (derived from Ancient Greek  ἱστορία (historía) 'inquiry; knowledge acquired by investigation') is the systematic study and documentation of the past. History is an academic discipline which uses a narrative to describe, examine, question, and analyse past events, and investigate their patterns of cause and effect. Historians debate which narrative best explains an event, as well as the significance of different causes and effects. Historians debate the nature of history as an end in itself, and its usefulness in giving perspective on the problems of the present.\nThe period of events before the invention of writing systems is considered prehistory. \"History\" is an umbrella term comprising past events as well as the memory, discovery, collection, organization, presentation, and interpretation of these events. Historians seek knowledge of the past using historical sources such as written documents, oral accounts or traditional oral histories, art and material artefacts, and ecological markers.\nStories common to a particular culture, but not supported by external sources (such as the tales surrounding King Arthur), are usually classified as cultural heritage or legends. History differs from myth in that it is supported by verifiable evidence. However, ancient cultural influences have helped create variant interpretations of the nature of history, which have evolved over the centuries and continue to change today. The modern study of history is wide-ranging, and includes the study of specific regions and certain topical or thematic elements of historical investigation. History is taught as a part of primary and secondary education, and the academic study of history is a major discipline in universities.\nHerodotus, a 5th-century BCE Greek historian, is often considered the \"father of history\", as one of the first historians in the Western tradition, though he has been criticized as the \"father of lies\". Along with his contemporary Thucydides, he helped form the foundations for the modern study of past events and societies. Their works continue to be read today, and the gap between the culture-focused Herodotus and the military-focused Thucydides remains a point of contention or approach in modern historical writing. In East Asia a state chronicle, the Spring and Autumn Annals, was reputed to date from as early as 722 BCE, though only 2nd-century BCE texts have survived. The title \"father of history\" has also been attributed, in their respective societies, to Sima Qian, Ibn Khaldun, and Kenneth Dike.\n\n\n== Definition ==\nAs an academic discipline, history is the study of the past. It conceptualizes and describes what happened by collecting and analysing evidence to construct narratives. These narratives cover not only how events unfolded but also why they happened and in which contexts, providing an explanation of relevant background conditions and causal mechanisms. History further examines the meaning of historical events and the underlying human motives driving them.\nIn a slightly different sense, history refers to the past events themselves. In this sense, history is what happened rather than the academic field studying what happened. When used as a countable noun, a history is a representation of the past in the form of a history text. History texts are cultural products involving active interpretation and reconstruction. The narratives presented in them can change as historians discover new evidence or reinterpret already-known sources. The nature of the past itself, by contrast, is static and unchangeable. Some historians focus on the interpretative and explanatory aspects to distinguish histories from chronicles, arguing that chronicles only catalogue events in chronological order, whereas histories aim at a comprehensive understanding of their causes, contexts, and consequences.\nTraditionally, history was primarily concerned with written documents. It focused on recorded history since the invention of writing, leaving prehistory to other fields, such as archaeology. Today, history has a broader scope that includes prehistory, starting with the earliest human origins several million years ago.\nIt is controversial whether history is a social science or forms part of the humanities. Like social scientists, historians formulate hypotheses, gather objective evidence, and present arguments based on this evidence. At the same time, history aligns closely with the humanities because of its reliance on subjective aspects associated with interpretation, storytelling, human experience, and cultural heritage. Some historians strongly support one or the other classification while others characterize history as a hybrid discipline that does not belong to one category at the exclusion of the other. History contrasts with pseudohistory, which deviates from historiographical standards by relying on disputed historical evidence, selectively ignoring genuine evidence, or using other means to distort the historical record. Often motivated by specific ideological agendas, pseudohistorians mimic historical methodology to promote misleading narratives that lack rigorous analysis and scholarly consensus.\n\n\n=== Purpose ===\nVarious suggestions about the purpose or value of history have been made. Some historians propose that its primary function is the pure discovery of the truth about the past. This view emphasizes that the disinterested pursuit of truth is an end in itself, while external purposes, associated with ideology or politics, threaten to undermine the accuracy of historical research by distorting the past. In this role, history also challenges traditional myths lacking factual support.\nA different perspective suggests that the main value of history lies in the lessons it teaches for the present. This view is based on the idea that an understanding of the past can guide decision-making, for example, to avoid repeating previous mistakes. A related perspective focuses on a general understanding of the human condition, making people aware of the diversity of human behaviour across different contexts—similar to what one can learn by visiting foreign countries. History can also foster social cohesion by providing people with a collective identity through a shared past, helping to preserve and cultivate cultural heritage and values across generations.\nHistory is sometimes used for political or ideological purposes, for instance, to justify the status quo by making certain traditions appear respectable or to promote change by highlighting past injustices. Pushed to extreme forms, this can result in pseudohistory or historical denialism when evidence is intentionally ignored or misinterpreted to construct a misleading narrative serving external interests.\n\n\n=== Etymology ===\n\nThe word history comes from the Ancient Greek term ἵστωρ (histōr), meaning 'learned, wise man'. It gave rise to the Ancient Greek word ἱστορία (historiā), which had a wide meaning associated with inquiry in general and giving testimony. The term was later adopted into Classical Latin as historia. In Hellenistic and Roman times, the meaning of the term shifted, placing more emphasis on narrative aspects and the art of presentation rather than focusing on investigation and testimony.\nThe word entered Middle English in the 14th century via the Old French term histoire. At this time, it meant 'story, tale', encompassing both factual and fictional narratives. In the 15th century, its meaning shifted to cover the branch of knowledge studying the past in addition to narratives about the past. In the 18th and 19th centuries, the word history became more closely associated with factual accounts and evidence-based inquiry, coinciding with the professionalization of historical inquiry. The dual meaning, referring to both mere stories and factual accounts of the past, is present in the terms for history in many other European languages. They include the French histoire, the Italian storia, and the German Geschichte.\n\n\n== Areas of study ==\nHistory is a wide field of inquiry encompassing many branches. Some branches focus on a specific time period. Others concentrate on a particular geographic region or a distinct theme. Specializations of different types can usually be combined. For example, a work on economic history in ancient Egypt merges temporal, regional, and thematic perspectives. For topics with a broad scope, the amount of primary sources is often too extensive for an individual historian to review. This forces them to either narrow the scope of their topic or rely on secondary sources to arrive at a wide overview.\n\n\n=== By period ===\nChronological division is a common approach to organizing the vast expanse of history into more manageable segments. Different periods are often defined based on dominant themes that characterize a specific time frame and significant events that initiated these developments or brought them to an end. Depending on the selected context and level of detail, a period may be as short as a decade or longer than several centuries. A traditionally influential approach divides human history into prehistory, ancient history, post-classical history, early modern history, and modern history. Depending on the region and theme, the time frames covered by these periods can vary and historians may use entirely different periodizations. For example, traditional periodizations of Chinese history follow the main dynasties, and the division into pre-Columbian, colonial, and post-colonial periods plays a central role in the history of the Americas.\n\nPrehistory started with the evolution of human-like species several million years ago, leading to the emergence of anatomically modern humans about 200,000 years ago. Subsequently, humans migrated out of Africa to populate most of the earth. Towards the end of prehistory, technological advances in the form of new and improved tools led many groups to give up their established nomadic lifestyle, based on hunting and gathering, in favour of a sedentary lifestyle supported by early forms of agriculture. The absence of written documents from this period presents researchers with unique challenges. It results in an interdisciplinary approach relying on other forms of evidence from fields such as archaeology, anthropology, paleontology, and geology.\nAncient history, starting roughly 3500 BCE, saw the emergence of the first major civilizations in Mesopotamia, Egypt, the Indus Valley, China, and Peru. The new social, economic, and political complexities necessitated the development of writing systems. Thanks to advancements in agriculture, surplus food allowed these civilizations to support larger populations, accompanied by urbanization, the establishment of trade networks, and the emergence of regional empires. Meanwhile, influential religious systems and philosophical ideas were first formulated, such as Hinduism, Buddhism, Confucianism, Judaism, and Greek philosophy.\nIn post-classical history, beginning around 500 CE, the influence of religions continued to grow. Missionary religions, like Buddhism, Christianity, and Islam, spread rapidly and established themselves as world religions, marking a cultural shift as they gradually replaced local belief systems. Meanwhile, inter-regional trade networks flourished, leading to increased technological and cultural exchange. Conquering many territories in Asia and Europe, the Mongol Empire became a dominant force during the 13th and 14th centuries.\nIn early modern history, starting roughly 1500 CE, European states rose to global power. As gunpowder empires, they explored and colonized large parts of the world. As a result, the Americas were integrated into the global network, triggering a vast biological exchange of plants, animals, people, and diseases. The Scientific Revolution prompted major discoveries and accelerated technological progress. It was accompanied by other intellectual developments, such as humanism and the Enlightenment, which ushered in secularization.\n\nIn modern history, beginning at the end of the 18th century, the Industrial Revolution transformed economies by introducing more efficient modes of production. Western powers established vast colonial empires, gaining superiority through industrialized military technology. The increased international exchange of goods, ideas, and people marked the beginning of globalization. Various social revolutions challenged autocratic and colonial regimes, paving the way for democracies. Many developments in fields like science, technology, economy, living standards, and human population accelerated at unprecedented rates. This happened despite the widespread destruction caused by two world wars, which rebalanced international power relations by undermining European dominance.\n\n\n=== By geographic location ===\nAreas of historical study can also be categorized by the geographic locations they examine. Geography plays a central role in history through its influence on food production, natural resources, economic activities, political boundaries, and cultural interactions. Some historical works limit their scope to small regions, such as a village or a settlement. Others focus on broad territories that encompass entire continents, like the histories of Africa, Asia, Europe, the Americas, and Oceania.\n\nThe history of Africa stands at the dawn of human history with the evolution of anatomically modern humans about 200,000 years ago. The invention of writing and the establishment of civilization happened in ancient Egypt in the 4th millennium BCE. Over the next millennia, other notable civilizations and kingdoms formed in Nubia, Axum, Carthage, Ghana, Mali, and Songhay. Islam began spreading across North Africa in the 7th century CE and became the dominant faith in many empires. Meanwhile, trade along the trans-Saharan route intensified. Beginning in the 15th century, millions of Africans were enslaved and forcibly transported to the Americas as part of the Atlantic slave trade. Most of the continent was colonized by European powers in the late 19th and early 20th centuries. Among rising nationalism, African states gradually gained independence in the aftermath of World War II, a period that saw economic progress, rapid population growth, and struggles for political stability.\n\nIn the history of Asia, anatomically modern humans arrived around 100,000 years ago. As one of the cradles of civilization, Asia was home to some of the first ancient civilizations in Mesopotamia, the Indus Valley, and China, which began to emerge in the 4th and 3rd millennia BCE. In the following millennia, all major world religions and several influential philosophical traditions were conceived and spread, such as Hinduism, Buddhism, Confucianism, Taoism, Christianity, and Islam. The Silk Road facilitated trade and cultural exchange across Eurasia, while powerful empires rose and fell, such as the Mongol Empire, which dominated the continent during the 13th and 14th centuries CE. European influence grew over the following centuries, culminating in the 19th and early 20th centuries when many parts of Asia came under direct colonial control until the end of World War II. The post-independence period was characterized by modernization, economic growth, and a steep increase in population.\nThe history of Europe began about 45,000 years ago with the arrival of the first anatomically modern humans. The Ancient Greeks laid the foundations of Western culture, philosophy, and politics in the first millennium BCE. Their cultural heritage continued in the Roman Empire and later the Byzantine Empire. The medieval period began with the fall of the Western Roman Empire in the 5th century CE and was marked by the spread of Christianity. Starting in the 15th century, European exploration and colonization interconnected the globe, while cultural, intellectual, and scientific developments transformed Western societies. From the late 18th to the early 20th centuries, European global dominance was further solidified by the Industrial Revolution and the establishment of large overseas colonies. It came to an end because of the devastating effects of two world wars. In the following Cold War era, the continent was divided into a Western and an Eastern bloc. They pursued political and economic integration after the Cold War ended.\nIn the history of the Americas, the first anatomically modern humans arrived around 20,000 to 15,000 years ago. The Americas were home to some of the earliest civilizations, like the Norte Chico civilization in South America and the Maya and Olmec civilizations in Central America. Over the next millennia, major empires arose beside them, such as the Teotihuacan, Aztec, and Inca empires. Following the arrival of the Europeans from the late 15th century onwards, the spread of newly introduced diseases drastically reduced the local population. Together with colonization and the massive influx of African slaves, it led to the collapse of major empires as demographic and cultural landscapes were reshaped. Independence movements in the 18th and 19th centuries led to the formation of new nations across the Americas. In the 20th century, the United States emerged as a dominant global power and a key player in the Cold War.\nThe history of Oceania starts with the arrival of anatomically modern humans about 60,000 to 50,000 years ago. They established diverse regional societies and cultures, first in Australia and Papua New Guinea and later also on other Pacific Islands. The arrival of the Europeans in the 16th century prompted significant transformations. By the end of the 19th century, most of the region had come under Western control. Oceania was dragged into various conflicts during the world wars and experienced decolonization in the post-war period.\n\n\n=== By theme ===\nHistorians often limit their inquiry to a specific theme belonging to a particular field. Some historians propose a general subdivision into three major themes: political history, economic history, and social history. However, the boundaries between these branches are vague and their relation to other thematic branches, such as intellectual history, is not always clear.\nPolitical history studies the organization of power in society, examining how power structures arise, develop, and interact. Throughout most of recorded history, states or state-like structures have been central to this field of study. It explores how a state was organized internally, like factions, parties, leaders, and other political institutions. It also examines which policies were implemented and how the state interacted with other states. Political history has been studied since antiquity, making it the oldest branch of history, while other major subfields have only become established branches in the past century.\n\nDiplomatic and military history are closely related to political history. Diplomatic history examines international relations between states. It covers foreign policy topics such as negotiations, strategic considerations, treaties, and conflicts between nations as well as the role of international organizations in these processes. Military history studies the impact and development of armed conflicts in human history. This includes the examination of specific events, like the analysis of a particular battle and the discussion of the different causes of a war. It also involves more general considerations about the evolution of warfare, including advancements in military technology, strategies, tactics, and institutions.\nEconomic history examines how commodities are produced, exchanged, and consumed. It covers economic aspects such as the use of land, labour, and capital, the supply and demand of goods, the costs and means of production, and the distribution of income and wealth. Economic historians typically focus on general trends in the form of impersonal forces, such as inflation, rather than the actions and decisions of individuals. If enough data is available, they rely on quantitative methods, like statistical analysis. For periods before the modern era, available data is often limited, forcing economic historians to rely on scarce sources and extrapolate information from them. \nSocial history is a broad field investigating social phenomena, but its precise definition is disputed. Some theorists understand it as the study of everyday life outside the domains of politics and economics, including cultural practices, family structures, community interactions, and education. A closely related approach focuses on experience rather than activities, examining how members of particular social groups, like social classes, races, genders, or age groups, experienced their world. Other definitions see social history as the study of social problems, like poverty, disease, and crime, or take a broader perspective by examining how whole societies developed. Closely related fields include cultural history, gender history, and religious history.\nIntellectual history is the history of ideas. It studies how concepts, philosophies, and ideologies have evolved. It is particularly interested in academic fields but not limited to them, including the study of the beliefs and prejudices of ordinary people. In addition to studying intellectual movements themselves, it also examines the cultural and social contexts that shaped them and their influence on other historical developments. As closely related fields, the history of philosophy investigates the development of philosophical thought while the history of science studies the evolution of scientific theories and practices. The history of art, another connected discipline, examines historical works of art and the development of artistic activities, styles, and movements.\nEnvironmental history studies the relation between humans and their environment. It seeks to understand how humans and the rest of nature have affected each other in the course of history. Other thematic branches include constitutional history, legal history, urban history, business history, history of technology, medical history, history of education, and people's history.\n\n\n=== Others ===\nSome branches of history are characterized by the methods they employ, such as quantitative history and digital history, which rely on quantitative methods and digital media. Comparative history compares historical phenomena from distinct times, regions, or cultures to examine their similarities and differences. Unlike most other branches, oral history relies on oral reports rather than written documents. It reflects the personal experiences and interpretations of what common people remember about the past, encompassing eyewitness accounts, hearsay, and communal legends. Counterfactual history uses counterfactual thinking to examine alternative courses of history, exploring what could have happened under different circumstances. Certain branches of history are distinguished by their theoretical outlook, such as Marxist and feminist history.\n\nSome distinctions focus on the scope of the studied topic. Big history is the branch with the broadest scope, covering everything from the Big Bang to the present. World history is another branch with a wide topic. It examines human history as a whole, starting with the evolution of human-like species. The terms macrohistory, mesohistory, and microhistory refer to different scales of analysis, ranging from large-scale patterns that affect the whole globe to detailed studies of small communities, particular individuals, or specific events. Closely related to microhistory is the genre of historical biography, which recounts an individual's life in its historical context and the legacy it left.\nPublic history involves activities that present history to the general public. It usually happens outside the traditional academic settings in contexts like museums, historical sites, and popular media.\n\n\n== Methods ==\n\nThe historical method is a set of techniques historians use to research and interpret the past, covering the processes of collecting, evaluating, and synthesizing evidence. It seeks to ensure scholarly rigour, accuracy, and reliability in how historical evidence is chosen, analysed, and interpreted. Historical research often starts with a research question to define the scope of the inquiry. Some research questions focus on a simple description of what happened. Others aim to explain why a particular event occurred, refute an existing theory, or confirm a new hypothesis.\n\n\n=== Sources and source criticism ===\nTo answer research questions, historians rely on various types of evidence to reconstruct the past and support their conclusions. Historical evidence is usually divided into primary and secondary sources. A primary source is a source that originated during the period that is studied. Primary sources can take various forms, such as official documents, letters, diaries, eyewitness accounts, photographs, and audio or video recordings. They also include historical remains examined in archaeology, geology, and the medical sciences, such as artefacts and fossils unearthed from excavations. Primary sources offer the most direct evidence of historical events.\n\nA secondary source is a source that analyses or interprets information found in other sources. Whether a document is a primary or a secondary source depends not only on the document itself but also on the purpose for which it is used. For example, if a historian writes a text about slavery based on an analysis of historical documents, then the text is a secondary source on slavery and a primary source on the historian's opinion. Consistency with available sources is one of the main standards of historical works. For instance, the discovery of new sources may lead historians to revise or dismiss previously accepted narratives. To find and access primary and secondary sources, historians consult archives, libraries, and museums. Archives play a central role by preserving countless original sources and making them available to researchers in a systematic and accessible manner. Thanks to technological advances, historians increasingly rely on online resources, which offer vast digital databases with efficient methods to search and access specific documents.\nSource criticism is the process of analysing and evaluating the information a source provides. Typically, this process begins with external criticism, which evaluates the authenticity of a source. It addresses the questions of when and where the source was created and seeks to identify the author, understand their reason for producing the source, and determine if it has undergone some type of modification since its creation. Additionally, the process involves distinguishing between original works, mere copies, and deceptive forgeries.\nInternal criticism evaluates the content of a source, typically beginning with the clarification of the meaning within the source. This involves disambiguating individual terms that could be misunderstood but may also require a general translation if the source is written in an ancient language. Once the information content of a source is understood, internal criticism is specifically interested in determining accuracy. Critics ask whether the information is reliable or misrepresents the topic and further question whether the source is comprehensive or omits important details. One way to make these assessments is to evaluate whether the author was able, in principle, to provide a faithful presentation of the studied event and to consider the influences of their intentions and prejudices. Being aware of the inadequacies of a source helps historians decide whether and which aspects of it to trust, and how to use it to construct a narrative.\n\n\n=== Synthesis and schools of thought ===\nThe selection, analysis, and criticism of sources result in the validation of a large collection of mostly isolated statements about the past. As a next step, sometimes termed historical synthesis, historians examine how the individual pieces of evidence fit together to form part of a larger story. Constructing this broader perspective is crucial for a comprehensive understanding of the topic as a whole. It is a creative aspect of historical writing that reconstructs, interprets, and explains what happened by showing how different events are connected. In this way, historians address not only which events occurred but also why they occurred and what consequences they had. While there are no universally accepted techniques for this synthesis, historians rely on various interpretative tools and approaches in this process.\nOne tool to provide an accessible overview of complex developments is the use of periodization. It divides a timeframe into different periods, each organized around central themes or developments that shaped the period. For example, the three-age system divides early human history into Stone Age, Bronze Age, and Iron Age based on the predominant materials and technologies during these periods. Another methodological tool is the examination of silences, gaps or omissions in the historical record of events that occurred but did not leave significant evidential traces. Silences can happen when contemporaries find information too obvious to document but may also occur if there were specific reasons to withhold or destroy information. Conversely, when large datasets are available, quantitative approaches can be used. For instance, economic and social historians commonly employ statistical analysis to identify patterns and trends associated with large groups.\nDifferent schools of thought often come with their own methodological implications for how to write history. Positivists emphasize the scientific nature of historical inquiry, focusing on empirical evidence to discover objective truths.  In contrast, postmodernists reject grand narratives that claim to offer a single, objective truth. Instead, they highlight the subjective nature of historical interpretation, which leads to a multiplicity of divergent perspectives. Marxists interpret historical developments as expressions of economic forces and class struggles. The Annales school highlights long-term social and economic trends while relying on quantitative and interdisciplinary methods. Feminist historians study the role of gender in history, with a particular interest in the experiences of women to challenge patriarchal perspectives.\n\n\n== Related fields ==\n\n\n=== Historiography ===\n\nHistoriography is the study of the methods and development of historical research. Historiographers examine what historians do, resulting in a metatheory in the form of a history of history. Some theorists use the term historiography in a different sense to refer to written accounts of the past.\nA central topic in historiography as a metatheory focuses on the standards of evidence and reasoning in historical inquiry. Historiographers examine and codify how historians use sources to construct narratives about the past, including the analysis of the interpretative assumptions from which they proceed. Closely related issues include the style and rhetorical presentation of works of history.\nBy comparing the works of different historians, historiographers identify schools of thought based on shared research methods, assumptions, and styles. For example, they examine the characteristics of the Annales school, like its use of quantitative data from various disciplines and its interest in economic and social developments taking place over extended periods. Comparisons also extend to whole eras from ancient to modern times. This way, historiography traces the development of history as an academic discipline, highlighting how the dominant methods, themes, and research goals have changed over time.\n\n\n=== Philosophy ===\n\nThe philosophy of history investigates the theoretical foundations of history. It is interested both in the past itself as a series of interconnected events and in the academic field studying this process. Insights and approaches from various branches of philosophy are relevant to this endeavour, such as metaphysics, epistemology, hermeneutics, and ethics.\nIn examining history as a process, philosophers explore the basic entities that make up historical phenomena. Some approaches rely primarily on the beliefs and actions of individual humans, while others include collective and other general entities, such as civilizations, institutions, ideologies, and social forces. A related topic concerns the nature of causal mechanisms connecting historic events with their causes and consequences. One view holds that there are general laws of history that determine the course of events, similar to the laws of nature studied in the natural sciences. According to another perspective, causal relations between historic events are unique and shaped by contingent factors. Some philosophers suggest that the general direction of the course of history follows large patterns. According to one proposal, history is cyclic, meaning that on a sufficiently large scale, individual events or general trends repeat. Another theory asserts that history is a linear, teleological process moving towards a predetermined goal.\nA philosophical topic regarding historical research is the possibility of an objective account of history. Various philosophers argue that this ideal is not achievable, pointing to the subjective nature of interpretation, the narrative aspect of history, and the influence of personal values on the perspective and actions of both historic individuals and historians. A different view states that there are hard historic facts about what happened, for example, facts about when a drought occurred or which army was defeated. This view acknowledges that obstacles to a neutral presentation exist but holds that they can be overcome, at least in principle.\nThe topics of philosophy of history and historiography overlap as both are interested in the standards of historical reasoning. Historiographers typically focus more on describing specific methods and developments encountered in the study of history. Philosophers of history, by contrast, tend to explore more general patterns, including evaluative questions about which methods and assumptions are correct. Historical reasoning is sometimes used in philosophy and other disciplines as a method to explain phenomena. This approach, known as historicism, argues that understanding something requires knowledge of its unique history or how it evolved. For instance, historicism about truth states that truth depends on historical circumstances, meaning that there are no transhistorical truths. Historicism contrasts with approaches that seek understanding based on timeless and universal principles.\n\n\n=== Education ===\nHistory is part of the school curriculum in most countries. Early history education aims to make students interested in the past and familiarize them with fundamental concepts of historical thought. By fostering a basic historical awareness, it seeks to instil a sense of identity by helping them understand their cultural roots. It often takes a narrative form by presenting children with simple stories, which may focus on historic individuals or the origins of local holidays, festivals, and food. More advanced history education encountered in secondary school covers a broader spectrum of topics, ranging from ancient to modern history, at both local and global levels. It further aims to acquaint students with historical research methodologies, including the abilities to interpret and critically evaluate historical claims.\nHistory teachers employ a variety of teaching methods. They include narrative presentations of historical developments, questions to engage students and prompt critical thinking, and discussions on historical topics. Students work with historical sources directly to learn how to analyse and interpret evidence, both individually and in group activities. They engage in historical writing to develop the skills of articulating their thoughts clearly and persuasively. Assessments through oral or written tests aim to ensure that learning goals are reached. Traditional methodologies in history education often present numerous facts, like dates of significant events and names of historical figures, which students are expected to memorize. Alternative approaches seek to foster a more active engagement and a deeper understanding of general patterns, focusing not only on what happened but also on why it happened and its lasting historical significance.\nHistory education in state schools serves a variety of purposes. A key skill is historical literacy, the ability to understand, critically analyse, and respond to historical claims. By making students aware of significant developments in the past, they become familiar with various contexts of human life, helping them understand the present and its diverse cultures. At the same time, it fosters a sense of cultural identity and prepares students for active citizenship. Knowledge of a shared past and cultural heritage contributes to the formation of a national identity. This political aspect of history education may spark disputes about which topics school textbooks should cover. In various regions, it has resulted in so-called history wars over the curriculum. It can lead to a biased treatment of controversial topics in an attempt to present the national heritage in a favourable light.\n\nIn addition to the formal education provided in public schools, history is also taught in informal settings outside the classroom. Public history takes place in locations like museums and memorial sites, where selected artefacts are often used to tell specific stories. It includes popular history, which aims to make the past accessible and appealing to a wide audience of non-specialists in media such as books, television programmes, and online content. Informal history education also happens in oral traditions as narratives about the past are transmitted across generations.\n\n\n=== Other fields ===\nHistory employs an interdisciplinary methodology, drawing on findings from various disciplines, such as archaeology, geology, genetics, anthropology, and linguistics. Archaeologists study man-made historical artefacts and other forms of material evidence. Their findings provide crucial insights into past human activities and cultural developments. Geology and other earth sciences help historians understand the environmental contexts and physical processes that affected past societies, including climate conditions, landscapes, and natural events. Genetics provides key information about the evolutionary origins of humans as a species, human migration, ancestry, and demographic changes. Anthropologists investigate human culture and behaviour, such as social structures, belief systems, and ritual practices. This knowledge offers contexts for the interpretation of historical events. Historical linguistics studies the development of languages over time, which can be crucial for the interpretation of ancient documents and can also provide information about migration patterns and cultural exchanges. Historians further rely on evidence from various other fields belonging to the physical, biological, and social sciences as well as the humanities.\nIn virtue of its relation to ideology and national identity, history is closely connected to politics and historical theories can directly impact political decisions. For example, irredentist attempts by one state to annex territory of another state often rely on historical theories claiming that the disputed territory belonged to the first state in the past. History also plays a central role in so-called historical religions, which base some of their core doctrines on historical events. For instance, Christianity is often categorized as a historical religion because it is centred around historical events surrounding Jesus Christ. History is relevant to many fields by studying their past, including the history of science, mathematics, philosophy, and art.\n\n\n== See also ==\n\nGlossary of history\nHistoric recurrence\nOutline of history\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Citations ===\n\n\n=== Sources ===\n\n\n== Further reading ==\n\n\n== External links ==\nOfficial website of BestHistorySites\nOfficial website of BBC History\nInternet History Sourcebooks Project See also Internet History Sourcebooks Project (Collections of public domain and copy-permitted historical texts for educational use)\nLarned, J. N. (1836-1913) at Project Gutenberg including eight History for ready reference items\nHyperHistory - a visual overview of many history timelines\nMacrohistory - a comprehensive timeline of historical events\nGeaCron - an interactive world history atlas",
  "links": {
    "\"Polish death camp\" controversy": "",
    "12-hour clock": "",
    "1948 Palestine war": "",
    "2,500-year celebration of the Persian Empire": "",
    "24-hour clock": "",
    "A. J. P. Taylor": "",
    "ASPRO chronology": "",
    "A Conflict of Visions": "",
    "A Vindication of Natural Society": "",
    "A series and B series": ""
  },
  "url": "https://en.wikipedia.org/wiki/History"
}