{
  "title": "Intuitionistic type theory",
  "content": "Intuitionistic type theory (also known as constructive type theory, or Martin-Löf type theory (MLTT)) is a type theory and an alternative foundation of mathematics.\nIntuitionistic type theory was created by Per Martin-Löf, a Swedish mathematician and philosopher, who first published it in 1972. There are multiple versions of the type theory: Martin-Löf proposed both intensional and extensional variants of the theory and early impredicative versions, shown to be inconsistent by Girard's paradox, gave way to predicative versions. However, all versions keep the core design of constructive logic using dependent types.\n\n\n== Design ==\nMartin-Löf designed the type theory on the principles of mathematical constructivism. Constructivism requires any existence proof to contain a \"witness\". So, any proof of \"there exists a prime greater than 1000\" must identify a specific number that is both prime and greater than 1000. Intuitionistic type theory accomplished this design goal by internalizing the BHK interpretation. A useful consequence is that proofs become mathematical objects that can be examined, compared, and manipulated.\nIntuitionistic type theory's type constructors were built to follow a one-to-one correspondence with logical connectives. For example, the logical connective called implication (\n  \n    \n      \n        A\n        \n        ⟹\n        \n        B\n      \n    \n    {\\displaystyle A\\implies B}\n  \n) corresponds to the type of a function (\n  \n    \n      \n        A\n        →\n        B\n      \n    \n    {\\displaystyle A\\to B}\n  \n). This correspondence is called the Curry–Howard isomorphism. Prior type theories had also followed this isomorphism, but Martin-Löf's was the first to extend it to predicate logic by introducing dependent types.\n\n\n== Type theory ==\nIntuitionistic type theory has three finite types, which are then composed using five different type constructors. Unlike set theories, type theories are not built on top of a logic like Frege's. So, each feature of the type theory does double duty as a feature of both math and logic.\nIf you are unfamiliar with type theory and know set theory, a quick summary is: Types contain terms just like sets contain elements. Terms belong to one and only one type. Terms like \n  \n    \n      \n        2\n        +\n        2\n      \n    \n    {\\displaystyle 2+2}\n  \n and \n  \n    \n      \n        2\n        ⋅\n        2\n      \n    \n    {\\displaystyle 2\\cdot 2}\n  \n compute (\"reduce\") down to canonical terms like 4. For more, see the article on type theory.\n\n\n=== 0 type, 1 type and 2 type ===\nThere are three finite types: The 0 type contains 0 terms. The 1 type contains 1 canonical term. And the 2 type contains 2 canonical terms.\nBecause the 0 type contains 0 terms, it is also called the empty type. It is used to represent anything that cannot exist. It is also written \n  \n    \n      \n        ⊥\n      \n    \n    {\\displaystyle \\bot }\n  \n and represents anything unprovable. (That is, a proof of it cannot exist.) As a result, negation is defined as a function to it: \n  \n    \n      \n        ¬\n        A\n        :=\n        A\n        →\n        ⊥\n      \n    \n    {\\displaystyle \\neg A:=A\\to \\bot }\n  \n.\nLikewise, the 1 type contains 1 canonical term and represents existence. It also is called the unit type.\nFinally, the 2 type contains 2 canonical terms. It represents a definite choice between two values. It is used for Boolean values but not propositions.\nPropositions are instead represented by particular types. For instance, a true proposition can be represented by the 1 type, while a false proposition can be represented by the 0 type. But we cannot assert that these are the only propositions, i.e. the law of excluded middle does not hold for propositions in intuitionistic type theory.\n\n\n=== Σ type constructor ===\nΣ-types contain ordered pairs. As with typical ordered pair (or 2-tuple) types, a Σ-type can describe the Cartesian product, \n  \n    \n      \n        A\n        ×\n        B\n      \n    \n    {\\displaystyle A\\times B}\n  \n, of two other types, \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n and \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n. Logically, such an ordered pair would hold a proof of \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n and a proof of \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n, so one may see such a type written as \n  \n    \n      \n        A\n        ∧\n        B\n      \n    \n    {\\displaystyle A\\wedge B}\n  \n.\nΣ-types are more powerful than typical ordered pair types because of dependent typing. In the ordered pair, the type of the second term can depend on the value of the first term. For example, the first term of the pair might be a natural number and the second term's type might be a sequence of reals of length equal to the first term. Such a type would be written:\n\n  \n    \n      \n        \n          ∑\n          \n            n\n            \n              \n                :\n              \n            \n            \n              \n                N\n              \n            \n          \n        \n        Vec\n        ⁡\n        (\n        \n          \n            R\n          \n        \n        ,\n        n\n        )\n      \n    \n    {\\displaystyle \\sum _{n{\\mathbin {:}}{\\mathbb {N} }}\\operatorname {Vec} ({\\mathbb {R} },n)}\n  \n\nUsing set-theory terminology, this is similar to an indexed disjoint union of sets. In the case of the usual cartesian product, the type of the second term does not depend on the value of the first term. Thus the type describing the cartesian product \n  \n    \n      \n        \n          \n            N\n          \n        \n        ×\n        \n          \n            R\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {N} }\\times {\\mathbb {R} }}\n  \n is written:\n\n  \n    \n      \n        \n          ∑\n          \n            n\n            \n              \n                :\n              \n            \n            \n              \n                N\n              \n            \n          \n        \n        \n          \n            R\n          \n        \n      \n    \n    {\\displaystyle \\sum _{n{\\mathbin {:}}{\\mathbb {N} }}{\\mathbb {R} }}\n  \n\nIt is important to note here that the value of the first term, \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n, is not depended on by the type of the second term, \n  \n    \n      \n        \n          \n            R\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {R} }}\n  \n.\nΣ-types can be used to build up longer dependently-typed tuples used in mathematics and the records or structs used in most programming languages. An example of a dependently-typed 3-tuple is two integers and a proof that the first integer is smaller than the second integer, described by the type:\n\n  \n    \n      \n        \n          ∑\n          \n            m\n            \n              \n                :\n              \n            \n            \n              \n                Z\n              \n            \n          \n        \n        \n          \n            ∑\n            \n              n\n              \n                \n                  :\n                \n              \n              \n                \n                  Z\n                \n              \n            \n          \n          (\n          (\n          m\n          <\n          n\n          )\n          =\n          \n            True\n          \n          )\n        \n      \n    \n    {\\displaystyle \\sum _{m{\\mathbin {:}}{\\mathbb {Z} }}{\\sum _{n{\\mathbin {:}}{\\mathbb {Z} }}((m<n)={\\text{True}})}}\n  \n\nDependent typing allows Σ-types to serve the role of existential quantifier. The statement \"there exists an \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n of type \n  \n    \n      \n        \n          \n            N\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {N} }}\n  \n, such that \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n is proven\" becomes the type of ordered pairs where the first item is the value \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n of type \n  \n    \n      \n        \n          \n            N\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {N} }}\n  \n and the second item is a proof of \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n. Notice that the type of the second item (proofs of \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n) depends on the value in the first part of the ordered pair (\n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n). Its type would be:\n\n  \n    \n      \n        \n          ∑\n          \n            n\n            \n              \n                :\n              \n            \n            \n              \n                N\n              \n            \n          \n        \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle \\sum _{n{\\mathbin {:}}{\\mathbb {N} }}P(n)}\n  \n\n\n=== Π type constructor ===\nΠ-types contain functions. As with typical function types, they consist of an input type and an output type. They are more powerful than typical function types however, in that the return type can depend on the input value. Functions in type theory are different from set theory. In set theory, you look up the argument's value in a set of ordered pairs. In type theory, the argument is substituted into a term and then computation (\"reduction\") is applied to the term.\nAs an example, the type of a function that, given a natural number \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n, returns a vector containing \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n real numbers is written:\n\n  \n    \n      \n        \n          ∏\n          \n            n\n            \n              \n                :\n              \n            \n            \n              \n                N\n              \n            \n          \n        \n        Vec\n        ⁡\n        (\n        \n          \n            R\n          \n        \n        ,\n        n\n        )\n      \n    \n    {\\displaystyle \\prod _{n{\\mathbin {:}}{\\mathbb {N} }}\\operatorname {Vec} ({\\mathbb {R} },n)}\n  \n\nWhen the output type does not depend on the input value, the function type is often simply written with a \n  \n    \n      \n        →\n      \n    \n    {\\displaystyle \\to }\n  \n. Thus, \n  \n    \n      \n        \n          \n            N\n          \n        \n        →\n        \n          \n            R\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {N} }\\to {\\mathbb {R} }}\n  \n is the type of functions from natural numbers to real numbers. Such Π-types correspond to logical implication. The logical proposition \n  \n    \n      \n        A\n        \n        ⟹\n        \n        B\n      \n    \n    {\\displaystyle A\\implies B}\n  \n corresponds to the type \n  \n    \n      \n        A\n        →\n        B\n      \n    \n    {\\displaystyle A\\to B}\n  \n, containing functions that take proofs-of-A and return proofs-of-B. This type could be written more consistently as:\n\n  \n    \n      \n        \n          ∏\n          \n            a\n            \n              \n                :\n              \n            \n            A\n          \n        \n        B\n      \n    \n    {\\displaystyle \\prod _{a{\\mathbin {:}}A}B}\n  \n\nΠ-types are also used in logic for universal quantification. The statement \"for every \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n of type \n  \n    \n      \n        \n          \n            N\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {N} }}\n  \n, \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n is proven\" becomes a function from \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n of type \n  \n    \n      \n        \n          \n            N\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {N} }}\n  \n to proofs of \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n. Thus, given the value for \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n the function generates a proof that \n  \n    \n      \n        P\n        (\n        \n        ⋅\n        \n        )\n      \n    \n    {\\displaystyle P(\\,\\cdot \\,)}\n  \n holds for that value. The type would be\n\n  \n    \n      \n        \n          ∏\n          \n            n\n            \n              \n                :\n              \n            \n            \n              \n                N\n              \n            \n          \n        \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle \\prod _{n{\\mathbin {:}}{\\mathbb {N} }}P(n)}\n  \n\n\n=== = type constructor ===\n=-types are created from two terms. Given two terms like \n  \n    \n      \n        2\n        +\n        2\n      \n    \n    {\\displaystyle 2+2}\n  \n and \n  \n    \n      \n        2\n        ⋅\n        2\n      \n    \n    {\\displaystyle 2\\cdot 2}\n  \n, you can create a new type \n  \n    \n      \n        2\n        +\n        2\n        =\n        2\n        ⋅\n        2\n      \n    \n    {\\displaystyle 2+2=2\\cdot 2}\n  \n. The terms of that new type represent proofs that the pair reduce to the same canonical term. Thus, since both \n  \n    \n      \n        2\n        +\n        2\n      \n    \n    {\\displaystyle 2+2}\n  \n and \n  \n    \n      \n        2\n        ⋅\n        2\n      \n    \n    {\\displaystyle 2\\cdot 2}\n  \n compute to the canonical term \n  \n    \n      \n        4\n      \n    \n    {\\displaystyle 4}\n  \n, there will be a term of the type \n  \n    \n      \n        2\n        +\n        2\n        =\n        2\n        ⋅\n        2\n      \n    \n    {\\displaystyle 2+2=2\\cdot 2}\n  \n. In intuitionistic type theory, there is a single way to introduce =-types and that is by reflexivity:\n\n  \n    \n      \n        refl\n        \n          \n            :\n          \n        \n        \n          ∏\n          \n            a\n            \n              \n                :\n              \n            \n            A\n          \n        \n        (\n        a\n        =\n        a\n        )\n        .\n      \n    \n    {\\displaystyle \\operatorname {refl} {\\mathbin {:}}\\prod _{a{\\mathbin {:}}A}(a=a).}\n  \n\nIt is possible to create =-types such as \n  \n    \n      \n        1\n        =\n        2\n      \n    \n    {\\displaystyle 1=2}\n  \n where the terms do not reduce to the same canonical term, but you will be unable to create terms of that new type. In fact, if you were able to create a term of \n  \n    \n      \n        1\n        =\n        2\n      \n    \n    {\\displaystyle 1=2}\n  \n, you could create a term of \n  \n    \n      \n        ⊥\n      \n    \n    {\\displaystyle \\bot }\n  \n. Putting that into a function would generate a function of type \n  \n    \n      \n        1\n        =\n        2\n        →\n        ⊥\n      \n    \n    {\\displaystyle 1=2\\to \\bot }\n  \n. Since \n  \n    \n      \n        …\n        →\n        ⊥\n      \n    \n    {\\displaystyle \\ldots \\to \\bot }\n  \n is how intuitionistic type theory defines negation, you would have \n  \n    \n      \n        ¬\n        (\n        1\n        =\n        2\n        )\n      \n    \n    {\\displaystyle \\neg (1=2)}\n  \n or, finally, \n  \n    \n      \n        1\n        ≠\n        2\n      \n    \n    {\\displaystyle 1\\neq 2}\n  \n.\nEquality of proofs is an area of active research in proof theory and has led to the development of homotopy type theory and other type theories.\n\n\n=== Inductive types ===\n\nInductive types allow the creation of complex, self-referential types. For example, a linked list of natural numbers is either an empty list or a pair of a natural number and another linked list. Inductive types can be used to define unbounded mathematical structures like trees, graphs, etc.. In fact, the natural numbers type may be defined as an inductive type, either being \n  \n    \n      \n        0\n      \n    \n    {\\displaystyle 0}\n  \n or the successor of another natural number.\nInductive types define new constants, such as zero \n  \n    \n      \n        0\n        \n          \n            :\n          \n        \n        \n          \n            N\n          \n        \n      \n    \n    {\\displaystyle 0{\\mathbin {:}}{\\mathbb {N} }}\n  \n and the successor function \n  \n    \n      \n        S\n        \n          \n            :\n          \n        \n        \n          \n            N\n          \n        \n        →\n        \n          \n            N\n          \n        \n      \n    \n    {\\displaystyle S{\\mathbin {:}}{\\mathbb {N} }\\to {\\mathbb {N} }}\n  \n. Since \n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n  \n does not have a definition and cannot be evaluated using substitution, terms like \n  \n    \n      \n        S\n        0\n      \n    \n    {\\displaystyle S0}\n  \n and \n  \n    \n      \n        S\n        S\n        S\n        0\n      \n    \n    {\\displaystyle SSS0}\n  \n become the canonical terms of the natural numbers.\nProofs on inductive types are made possible by induction. Each new inductive type comes with its own inductive rule. To prove a predicate \n  \n    \n      \n        P\n        (\n        \n        ⋅\n        \n        )\n      \n    \n    {\\displaystyle P(\\,\\cdot \\,)}\n  \n for every natural number, you use the following rule:\n\n  \n    \n      \n        \n          \n            \n              \n                N\n              \n            \n            -\n            e\n            l\n            i\n            m\n          \n        \n        \n        \n          \n            :\n          \n        \n        P\n        (\n        0\n        )\n        \n        →\n        \n          (\n          \n            \n              ∏\n              \n                n\n                \n                  \n                    :\n                  \n                \n                \n                  \n                    N\n                  \n                \n              \n            \n            P\n            (\n            n\n            )\n            →\n            P\n            (\n            S\n            (\n            n\n            )\n            )\n          \n          )\n        \n        →\n        \n          ∏\n          \n            n\n            \n              \n                :\n              \n            \n            \n              \n                N\n              \n            \n          \n        \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle {\\operatorname {{\\mathbb {N} }-elim} }\\,{\\mathbin {:}}P(0)\\,\\to \\left(\\prod _{n{\\mathbin {:}}{\\mathbb {N} }}P(n)\\to P(S(n))\\right)\\to \\prod _{n{\\mathbin {:}}{\\mathbb {N} }}P(n)}\n  \n\nInductive types in intuitionistic type theory are defined in terms of W-types, the type of well-founded trees. Later work in type theory generated coinductive types, induction-recursion, and induction-induction for working on types with more obscure kinds of self-referentiality. Higher inductive types allow equality to be defined between terms.\n\n\n=== Universe types ===\nThe universe types allow proofs to be written about all the types created with the other type constructors. Every term in the universe type \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            0\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{0}}\n  \n can be mapped to a type created with any combination of \n  \n    \n      \n        0\n        ,\n        1\n        ,\n        2\n        ,\n        Σ\n        ,\n        Π\n        ,\n        =\n        ,\n      \n    \n    {\\displaystyle 0,1,2,\\Sigma ,\\Pi ,=,}\n  \n and the inductive type constructor. However, to avoid paradoxes, there is no term in \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            n\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{n}}\n  \n that maps to \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            n\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{n}}\n  \n for any \n  \n    \n      \n        \n          \n            n\n          \n        \n        ∈\n        \n          N\n        \n      \n    \n    {\\displaystyle {\\mathcal {n}}\\in \\mathbb {N} }\n  \n.\nTo write proofs about all \"the small types\" and \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            0\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{0}}\n  \n, you must use \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            1\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{1}}\n  \n, which does contain a term for \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            0\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{0}}\n  \n, but not for itself \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            1\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{1}}\n  \n. Similarly, for \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{2}}\n  \n. There is a predicative hierarchy of universes, so to quantify a proof over any fixed constant \n  \n    \n      \n        k\n      \n    \n    {\\displaystyle k}\n  \n universes, you can use \n  \n    \n      \n        \n          \n            \n              U\n            \n          \n          \n            k\n            +\n            1\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}_{k+1}}\n  \n.\nUniverse types are a tricky feature of type theories. Martin-Löf's original type theory had to be changed to account for Girard's paradox. Later research covered topics such as \"super universes\", \"Mahlo universes\", and impredicative universes.\n\n\n== Judgements ==\nThe formal definition of intuitionistic type theory is written using judgements. For example, in the statement \"if \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n is a type and \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n is a type then \n  \n    \n      \n        \n          \n            ∑\n            \n              a\n              :\n              A\n            \n          \n          B\n        \n      \n    \n    {\\displaystyle \\textstyle \\sum _{a:A}B}\n  \n is a type\" there are judgements of \"is a type\", \"and\", and \"if ... then ...\". The expression \n  \n    \n      \n        \n          \n            ∑\n            \n              a\n              :\n              A\n            \n          \n          B\n        \n      \n    \n    {\\displaystyle \\textstyle \\sum _{a:A}B}\n  \n is not a judgement; it is the type being defined.\nThis second level of the type theory can be confusing, particularly where it comes to equality. There is a judgement of term equality, which might say \n  \n    \n      \n        4\n        =\n        2\n        +\n        2\n      \n    \n    {\\displaystyle 4=2+2}\n  \n. It is a statement that two terms reduce to the same canonical term. There is also a judgement of type equality, say that \n  \n    \n      \n        A\n        =\n        B\n      \n    \n    {\\displaystyle A=B}\n  \n, which means every element of \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n is an element of the type \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n and vice versa. At the type level, there is a type \n  \n    \n      \n        4\n        =\n        2\n        +\n        2\n      \n    \n    {\\displaystyle 4=2+2}\n  \n and it contains terms if there is a proof that \n  \n    \n      \n        4\n      \n    \n    {\\displaystyle 4}\n  \n and \n  \n    \n      \n        2\n        +\n        2\n      \n    \n    {\\displaystyle 2+2}\n  \n reduce to the same value. (Terms of this type are generated using the term-equality judgement.) Lastly, there is an English-language level of equality, because we use the word \"four\" and symbol \"\n  \n    \n      \n        4\n      \n    \n    {\\displaystyle 4}\n  \n\" to refer to the canonical term \n  \n    \n      \n        S\n        S\n        S\n        S\n        0\n      \n    \n    {\\displaystyle SSSS0}\n  \n. Synonyms like these are called \"definitionally equal\" by Martin-Löf.\nThe description of judgements below is based on the discussion in Nordström, Petersson, and Smith.\nThe formal theory works with types and objects.\nA type is declared by:\n\n  \n    \n      \n        A\n         \n        \n          \n            T\n            y\n            p\n            e\n          \n        \n      \n    \n    {\\displaystyle A\\ {\\mathsf {Type}}}\n  \n\nAn object exists and is in a type if:\n\n  \n    \n      \n        a\n        \n          \n            :\n          \n        \n        A\n      \n    \n    {\\displaystyle a{\\mathbin {:}}A}\n  \n\nObjects can be equal\n\n  \n    \n      \n        a\n        =\n        b\n      \n    \n    {\\displaystyle a=b}\n  \n\nand types can be equal\n\n  \n    \n      \n        A\n        =\n        B\n      \n    \n    {\\displaystyle A=B}\n  \n\nA type that depends on an object from another type is declared\n\n  \n    \n      \n        (\n        x\n        \n          \n            :\n          \n        \n        A\n        )\n        B\n      \n    \n    {\\displaystyle (x{\\mathbin {:}}A)B}\n  \n\nand removed by substitution\n\n  \n    \n      \n        B\n        [\n        x\n        \n          /\n        \n        a\n        ]\n      \n    \n    {\\displaystyle B[x/a]}\n  \n, replacing the variable \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n  \n with the object \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n in \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n.\nAn object that depends on an object from another type can be done two ways.\nIf the object is \"abstracted\", then it is written\n\n  \n    \n      \n        [\n        x\n        ]\n        b\n      \n    \n    {\\displaystyle [x]b}\n  \n\nand removed by substitution\n\n  \n    \n      \n        b\n        [\n        x\n        \n          /\n        \n        a\n        ]\n      \n    \n    {\\displaystyle b[x/a]}\n  \n, replacing the variable \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n  \n with the object \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n in \n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n  \n.\nThe object-depending-on-object can also be declared as a constant as part of a recursive type. An example of a recursive type is:\n\n  \n    \n      \n        0\n        \n          \n            :\n          \n        \n        \n          N\n        \n      \n    \n    {\\displaystyle 0{\\mathbin {:}}\\mathbb {N} }\n  \n\n  \n    \n      \n        S\n        \n          \n            :\n          \n        \n        \n          N\n        \n        →\n        \n          N\n        \n      \n    \n    {\\displaystyle S{\\mathbin {:}}\\mathbb {N} \\to \\mathbb {N} }\n  \n\nHere, \n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n  \n is a constant object-depending-on-object. It is not associated with an abstraction. Constants like \n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n  \n can be removed by defining equality. Here the relationship with addition is defined using equality and using pattern matching to handle the recursive aspect of \n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n  \n:\n\n  \n    \n      \n        \n          \n            \n              \n                add\n              \n              \n                \n                \n                  \n                    :\n                  \n                \n                 \n                (\n                \n                  N\n                \n                ×\n                \n                  N\n                \n                )\n                →\n                \n                  N\n                \n              \n            \n            \n              \n                add\n                ⁡\n                (\n                0\n                ,\n                b\n                )\n              \n              \n                \n                =\n                b\n              \n            \n            \n              \n                add\n                ⁡\n                (\n                S\n                (\n                a\n                )\n                ,\n                b\n                )\n              \n              \n                \n                =\n                S\n                (\n                add\n                ⁡\n                (\n                a\n                ,\n                b\n                )\n                )\n                )\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\operatorname {add} &{\\mathbin {:}}\\ (\\mathbb {N} \\times \\mathbb {N} )\\to \\mathbb {N} \\\\\\operatorname {add} (0,b)&=b\\\\\\operatorname {add} (S(a),b)&=S(\\operatorname {add} (a,b)))\\end{aligned}}}\n  \n\n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n  \n is manipulated as an opaque constant - it has no internal structure for substitution.\nSo, objects and types and these relations are used to express formulae in the theory. The following styles of judgements are used to create new objects, types and relations from existing ones:\n\nBy convention, there is a type that represents all other types. It is called \n  \n    \n      \n        \n          \n            U\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}}\n  \n (or \n  \n    \n      \n        Set\n      \n    \n    {\\displaystyle \\operatorname {Set} }\n  \n). Since \n  \n    \n      \n        \n          \n            U\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}}\n  \n is a type, the members of it are objects. There is a dependent type \n  \n    \n      \n        El\n      \n    \n    {\\displaystyle \\operatorname {El} }\n  \n that maps each object to its corresponding type. In most texts \n  \n    \n      \n        El\n      \n    \n    {\\displaystyle \\operatorname {El} }\n  \n is never written. From the context of the statement, a reader can almost always tell whether \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n refers to a type, or whether it refers to the object in \n  \n    \n      \n        \n          \n            U\n          \n        \n      \n    \n    {\\displaystyle {\\mathcal {U}}}\n  \n that corresponds to the type.\nThis is the complete foundation of the theory. Everything else is derived.\nTo implement logic, each proposition is given its own type. The objects in those types represent the different possible ways to prove the proposition. If there is no proof for the proposition, then the type has no objects in it. Operators like \"and\" and \"or\" that work on propositions introduce new types and new objects. So \n  \n    \n      \n        A\n        ×\n        B\n      \n    \n    {\\displaystyle A\\times B}\n  \n is a type that depends on the type \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n and the type \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n. The objects in that dependent type are defined to exist for every pair of objects in \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n and \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n. If \n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n or \n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n has no proof and is an empty type, then the new type representing \n  \n    \n      \n        A\n        ×\n        B\n      \n    \n    {\\displaystyle A\\times B}\n  \n is also empty.\nThis can be done for other types (booleans, natural numbers, etc.) and their operators.\n\n\n== Categorical models of type theory ==\nUsing the language of category theory, R. A. G. Seely introduced the notion of a locally cartesian closed category (LCCC) as the basic model of type theory. This has been refined by Hofmann and Dybjer to Categories with Families or Categories with Attributes based on earlier work by Cartmell.\nA category with families is a category C of contexts (in which the objects are contexts, and the context morphisms are substitutions), together with a functor T : Cop → Fam(Set).\nFam(Set) is the category of families of Sets, in which objects are pairs ⁠\n  \n    \n      \n        (\n        A\n        ,\n        B\n        )\n      \n    \n    {\\displaystyle (A,B)}\n  \n⁠ of an \"index set\" A and a function B: X → A, and morphisms are pairs of functions f : A → A'  and g : X → X' , such that B'  ° g = f ° B – in other words, f maps Ba to Bg(a).\nThe functor T assigns to a context G a set ⁠\n  \n    \n      \n        T\n        y\n        (\n        G\n        )\n      \n    \n    {\\displaystyle Ty(G)}\n  \n⁠ of types, and for each ⁠\n  \n    \n      \n        A\n        :\n        T\n        y\n        (\n        G\n        )\n      \n    \n    {\\displaystyle A:Ty(G)}\n  \n⁠, a set ⁠\n  \n    \n      \n        T\n        m\n        (\n        G\n        ,\n        A\n        )\n      \n    \n    {\\displaystyle Tm(G,A)}\n  \n⁠ of terms. The axioms for a functor require that these play harmoniously with substitution. Substitution is usually written in the form Af or af, where A is a type in ⁠\n  \n    \n      \n        T\n        y\n        (\n        G\n        )\n      \n    \n    {\\displaystyle Ty(G)}\n  \n⁠ and a is a term in ⁠\n  \n    \n      \n        T\n        m\n        (\n        G\n        ,\n        A\n        )\n      \n    \n    {\\displaystyle Tm(G,A)}\n  \n⁠, and f is a substitution from D to G. Here ⁠\n  \n    \n      \n        A\n        f\n        :\n        T\n        y\n        (\n        D\n        )\n      \n    \n    {\\displaystyle Af:Ty(D)}\n  \n⁠ and ⁠\n  \n    \n      \n        a\n        f\n        :\n        T\n        m\n        (\n        D\n        ,\n        A\n        f\n        )\n      \n    \n    {\\displaystyle af:Tm(D,Af)}\n  \n⁠.\nThe category C must contain a terminal object (the empty context), and a final object for a form of product called comprehension, or context extension, in which the right element is a type in the context of the left element. If G is a context, and ⁠\n  \n    \n      \n        A\n        :\n        T\n        y\n        (\n        G\n        )\n      \n    \n    {\\displaystyle A:Ty(G)}\n  \n⁠, then there should be an object ⁠\n  \n    \n      \n        (\n        G\n        ,\n        A\n        )\n      \n    \n    {\\displaystyle (G,A)}\n  \n⁠ final among contexts D with mappings p : D → G, q : Tm(D,Ap).\nA logical framework, such as Martin-Löf's, takes the form of closure conditions on the context-dependent sets of types and terms: that there should be a type called Set, and for each set a type, that the types should be closed under forms of dependent sum and product, and so forth.\nA theory such as that of predicative set theory expresses closure conditions on the types of sets and their elements: that they should be closed under operations that reflect dependent sum and product, and under various forms of inductive definition.\n\n\n== Extensional versus intensional ==\nA fundamental distinction is extensional vs intensional type theory. In extensional type theory, definitional (i.e., computational) equality is not distinguished from propositional equality, which requires proof. As a consequence type checking becomes undecidable in extensional type theory because programs in the theory might not terminate. For example, such a theory allows one to give a type to the Y-combinator; a detailed example of this can be found in Nordstöm and Petersson Programming in Martin-Löf's Type Theory. However, this does not prevent extensional type theory from being a basis for a practical tool; for example, Nuprl is based on extensional type theory.\nIn contrast, in intensional type theory type checking is decidable, but the representation of standard mathematical concepts is somewhat more cumbersome, since intensional reasoning requires using setoids or similar constructions. There are many common mathematical objects that are hard to work with or cannot be represented without this, for example, integer numbers, rational numbers, and real numbers. Integers and rational numbers can be represented without setoids, but this representation is difficult to work with. Cauchy real numbers cannot be represented without this.\nHomotopy type theory works on resolving this problem. It allows one to define higher inductive types, which not only define first-order constructors (values or points), but higher-order constructors, i.e. equalities between elements (paths), equalities between equalities (homotopies), ad infinitum.\n\n\n== Implementations of type theory ==\nDifferent forms of type theory have been implemented as the formal systems underlying a number of proof assistants. While many are based on Per Martin-Löf's ideas, many have added features, more axioms, or a different philosophical background. For instance, the Nuprl system is based on computational type theory and Coq is based on the calculus of (co)inductive constructions. Dependent types also feature in the design of programming languages such as ATS, Cayenne, Epigram, Agda, and Idris.\n\n\n== Martin-Löf type theories ==\nPer Martin-Löf constructed several type theories that were published at various times, some of them much later than when the preprints with their description became accessible to specialists (among others Jean-Yves Girard and Giovanni Sambin). The list below attempts to list all the theories that have been described in a printed form and to sketch the key features that distinguished them from each other. All of these theories had dependent products, dependent sums, disjoint unions, finite types and natural numbers. All the theories had the same reduction rules that did not include η-reduction either for dependent products or for dependent sums, except for MLTT79 where the η-reduction for dependent products is added.\nMLTT71 was the first type theory created by Per Martin-Löf. It appeared in a preprint in 1971. It had one universe, but this universe had a name in itself, i.e., it was a type theory with, as it is called today, \"Type in Type\". Jean-Yves Girard has shown that this system was inconsistent, and the preprint was never published.\nMLTT72 was presented in a 1972 preprint that has now been published. That theory had one universe V and no identity types (=-types). The universe was \"predicative\" in the sense that the dependent product of a family of objects from V over an object that was not in V such as, for example, V itself, was not assumed to be in V. The universe was à la Russell's Principia Mathematica, i.e., one would write directly \"T∈V\" and \"t∈T\" (Martin-Löf uses the sign \"∈\" instead of modern \":\") without an added constructor such as \"El\".\nMLTT73 was the first definition of a type theory that Per Martin-Löf published (it was presented at the Logic Colloquium '73 and published in 1975). There are identity types, which he describes as \"propositions\", but since no real distinction between propositions and the rest of the types is introduced the meaning of this is unclear. There is what later acquires the name of J-eliminator but yet without a name (see pp. 94–95). There is in this theory an infinite sequence of universes V0, ..., Vn, ... . The universes are predicative, à la Russell and non-cumulative. In fact, Corollary 3.10 on p. 115 says that if A∈Vm and B∈Vn are such that A and B are convertible then m = n. This means, for example, that it would be difficult to formulate univalence axiom in this theory—there are contractible types in each of the Vi, but it is unclear how to declare them to be equal since there are no identity types connecting Vi and Vj for i ≠ j.\nMLTT79 was presented in 1979 and published in 1982. In this paper, Martin-Löf introduced the four basic types of judgement for the dependent type theory that has since become fundamental in the study of the meta-theory of such systems. He also introduced contexts as a separate concept in it (see p. 161). There are identity types with the J-eliminator (which already appeared in MLTT73 but did not have this name there) but also with the rule that makes the theory \"extensional\" (p. 169). There are W-types. There is an infinite sequence of predicative universes that are cumulative.\nBibliopolis: there is a discussion of a type theory in the Bibliopolis book from 1984, but it is somewhat open-ended and does not seem to represent a particular set of choices and so there is no specific type theory associated with it.\n\n\n== See also ==\nIntuitionistic logic\nTyped lambda calculus\n\n\n== Notes ==\n\n\n== References ==\nMartin-Löf, Per; Sambin, Giovanni (1984). Intuitionistic type theory (PDF). Napoli: Bibliopolis. ISBN 978-8870881059. OCLC 12731401.\n\n\n== Further reading ==\nPer Martin-Löf's Notes, as recorded by Giovanni Sambin (1980)\nNordström, Bengt; Petersson, Kent; Smith, Jan M. (1990). Programming in Martin-Löf's Type Theory. Oxford University Press. ISBN 9780198538141.\nThompson, Simon (1991). Type Theory and Functional Programming. Addison-Wesley. ISBN 0-201-41667-0.\nGranström, Johan G. (2011). Treatise on Intuitionistic Type Theory. Springer. ISBN 978-94-007-1735-0.\n\n\n== External links ==\nEU Types Project: Tutorials – lecture notes and slides from the Types Summer School 2005\nn-Categories - Sketch of a Definition – letter from John Baez and James Dolan to Ross Street, November 29, 1995",
  "links": {
    "ATS (programming language)": "",
    "Agda (programming language)": "",
    "ArXiv (identifier)": "",
    "Axiom of reducibility": "",
    "Axiomatic system": "",
    "BHK interpretation": "",
    "Bertrand Russell": "",
    "Boolean Algebra": "",
    "Calculus of constructions": "",
    "Cartesian product": ""
  },
  "url": "https://en.wikipedia.org/wiki/Intuitionistic_type_theory"
}