{
  "title": "Kundalini",
  "content": "In Hinduism, kundalini (Sanskrit: कुण्डलिनी, romanized: kuṇḍalinī, lit. 'coiled snake', ) is a form of divine feminine energy (or Shakti) believed to be located at the base of the spine, in the muladhara. It is an important concept in Śhaiva Tantra, where it is believed to be a force or power associated with the divine feminine or the formless aspect of the Goddess. This energy in the body, when cultivated and awakened through tantric practice, is believed to lead to spiritual liberation. Kuṇḍalinī is associated with the goddess Parvati or Adi Parashakti, the supreme being in Shaktism, and with the goddesses Bhairavi and Kubjika. The term, along with practices associated with it, was adopted into Hatha Yoga in the 9th century. It has since then been adopted into other forms of Hinduism as well as modern spirituality and New Age thought.\nKuṇḍalinī awakenings are said to occur by a variety of methods. Many systems of yoga focus on awakening kuṇḍalinī through: meditation, pranayama, the practice of asana, and chanting of mantras. Kundalini yoga is influenced by Shaktism and Tantra schools of Hinduism. It derives its name from its focus upon the awakening of kundalini energy through regular practice of mantra, Tantra, yantra, asanas or meditation. When kundalini is awakened spontaneously or without guidance it can lead to kundalini syndrome which sometimes presents as psychosis.\n\n\n== Etymology ==\nThe concept of Kuṇḍalinī is mentioned in the Upanishads (9th – 7th centuries BCE). The Sanskrit adjective kuṇḍalin means \"circular, annular\". It is mentioned as a noun for \"snake\" (in the sense of \"coiled\") in the 12th-century Rajatarangini chronicle (I.2). Kuṇḍa (a noun meaning \"bowl, water-pot\" is found as the name of a Nāga (serpent deity) in Mahabharata 1.4828). The 8th-century Tantrasadbhava Tantra uses the term kundalī, glossed by David Gordon White as \"she who is ring-shaped\".\nThe use of kuṇḍalī as a name for Goddess Durga (a form of Shakti) appears often in Tantrism and Shaktism from as early as the 11th century in the Śaradatilaka. It was adopted as a technical term in Hatha yoga during the 15th century, and became widely used in the Yoga Upanishads by the 16th century. Eknath Easwaran has paraphrased the term as \"the coiled power\", a force which ordinarily rests at the base of the spine, described as being \"coiled there like a serpent\".\n\n\n== In Shaivism ==\n\nKuṇḍalinī arose as a central concept in Shaiva Tantra, especially among the Śākta sects like the Kaula. In these Tantric traditions, Kuṇḍalinī is \"the innate intelligence of embodied Consciousness\".  The first possible mention of the term is in the Tantrasadbhāva-tantra (eighth century), but other earlier tantras mention the visualization of Shakti in the central channel and the upward movement of prana or vital force (which is often associated with Kuṇḍalinī in later works). According to David Gordon White, this feminine spiritual force is also termed bhogavati, which has a double meaning of \"enjoyment\" and \"coiled\" and signifies her strong connection to bliss and pleasure, both mundane physical pleasure and the bliss of spiritual liberation (moksha), which is the enjoyment of Shiva's creative activity and ultimate union with the Goddess.\nIn the influential Shakta tradition called Kaula, Kuṇḍalinī is seen as a \"latent innate spiritual power\" associated with the Goddess Kubjika (lit. \"the crooked one\"), who is the supreme Goddess (Paradevi). She is also pure bliss and power (Shakti), the source of all mantras, and resides in the six chakras along the central channel. In Shaiva Tantra, various practices like pranayama, bandhas, mantra recitation, and tantric ritual were used to awaken this spiritual power and create a state of bliss and spiritual liberation.\nAccording to Abhinavagupta, the great tantric scholar and master of the Kaula and Trika lineages, there are two main forms of Kuṇḍalinī, an upward moving Kuṇḍalinī (urdhva) associated with expansion, and a downward moving Kuṇḍalinī (adha) associated with contraction. According to the scholar of comparative religion Gavin Flood, Abhinavagupta links Kuṇḍalinī with \"the power that brings into manifestation the body, breath, and experiences of pleasure and pain\", with \"the power of sexuality as the source of reproduction\" and with:\n\nthe force of the syllable ha in the mantra and the concept of aham, the supreme subjectivity as the source of all, with a as the initial movement of consciousness and m its final withdrawal. Thus we have an elaborate series of associations, all conveying the central conception of the cosmos as a manifestation of consciousness, of pure subjectivity, with Kuṇḍalinī understood as the force inseparable from consciousness, who animates creation and who, in her particularised form in the body, causes liberation through her upward, illusion-shattering movement.\n\n\n== In Vaishnavism ==\nDespite mostly being associated with Shaiva and Shakta traditions, the concept of Kundalini Shakti is not at all alien to Vaishnavism. A popular Vaishnava text called Narada Pancharatra gives a detailed, although somewhat different description of Chakras and Kundalini Shakti compared to Shaivism and Shaktism. \n\n\n== Description ==\n\nAccording to William F. Williams, kuṇḍalinī is a type of religious experience within the Hindu tradition, within which it is held to be a kind of \"cosmic energy\" that accumulates at the base of the spine.\nWhen awakened, kuṇḍalinī is described as rising up from the muladhara chakra, through the central nadi (called sushumna) inside or alongside the spine reaching the top of the head. The progress of kuṇḍalinī through the different chakras is believed to achieve different levels of awakening and a mystical experience, until Kundalini finally reaches the top of the head, Sahasrara or crown chakra, producing a profound transformation of consciousness.: 5–6 \nSwami Sivananda Saraswati of the Divine Life Society stated in his book Kundalini Yoga that \"Supersensual visions appear before the mental eye of the aspirant, new worlds with indescribable wonders and charms unfold themselves before the Yogi, planes after planes reveal their existence and grandeur to the practitioner and the Yogi gets divine knowledge, power and bliss, in increasing degrees, when Kuṇḍalinī passes through Chakra after Chakra, making them to bloom in all their glory...\"\n\n\n== Kundalini experiences ==\n\n\n=== Invoking Kundalini experiences ===\nYoga gurus consider that Kuṇḍalinī can be awakened by shaktipat (spiritual transmission by a Guru or teacher), or by spiritual practices such as yoga or meditation.\nThere are two broad approaches to Kuṇḍalinī awakening: active and passive. The active approach involves systematic physical exercises and techniques of concentration, visualization, pranayama (breath practice) and meditation under the guidance of a competent teacher. These techniques come from any of the main branches of yoga, and some forms of yoga, such as Kriya yoga and Kundalini yoga, which emphasize Kuṇḍalinī techniques.\nThe passive approach is instead a path of surrender where one lets go of all the impediments to the awakening rather than trying to actively awaken Kuṇḍalinī. A chief part of the passive approach is shaktipat where one individual's Kuṇḍalinī is awakened by another who already has the experience. Shaktipat only raises Kuṇḍalinī temporarily but gives the student an experience to use as a basis.\nThe twentieth century yogi and mystic Gopi Krishna, who helped to bring the concept of Kuṇḍalinī to the Western world, stated that\n\nAs the ancient writers have said, it is the vital force or prana which is spread over both the macrocosm, the entire Universe, and the microcosm, the human body... The atom is contained in both of these. Prana is life-energy responsible for the phenomena of terrestrial life and for life on other planets in the universe. Prana in its universal aspect is immaterial. But in the human body, ...The brain is alive only because of Prana... an enlightened person ... [becomes] compassionate and more detached. There would be less ego, without any tendency toward violence or aggression or falsehood. The awakened life energy is the mother of morality, because all morality springs from this awakened energy. Since the very beginning, it has been this evolutionary energy that has created the concept of morals in human beings. \nThe American comparative religions scholar Joseph Campbell describes the concept of Kuṇḍalinī as \"the figure of a coiled female serpent—a serpent goddess not of \"gross\" but \"subtle\" substance—which is to be thought of as residing in a torpid, slumbering state in a subtle center, the first of the seven, near the base of the spine: the aim of the yoga then being to rouse this serpent, lift her head, and bring her up a subtle nerve or channel of the spine to the so-called \"thousand-petaled lotus\" (Sahasrara) at the crown of the head...She, rising from the lowest to the highest lotus center will pass through and wake the five between, and with each waking, the psychology and personality of the practitioner will be altogether and fundamentally transformed.\"\n\n\n==== Hatha yoga ====\n\nAccording to the Gorakṣaśataka, or \"Hundred Verses of Goraksa\", hatha yoga practices such as the mudras mula bandha, uddiyana bandha, and jalandhara bandha,  and the pranayama practice of kumbhaka can awaken Kundalini. Another hatha yoga text, the Khecarīvidyā, states that khechari mudra enables one to raise Kundalini and access the stores of amrita in the head, which subsequently flood the body.\n\n\n==== Shaktipat ====\nThe spiritual teacher Meher Baba emphasized the need for a master when actively trying to awaken Kuṇḍalinī:\n\nKundalini is a latent power in the higher body. When awakened, it pierces through six chakras or functional centers and activates them. Without a master, the awakening of the kundalini cannot take anyone very far on the Path; and such indiscriminate or premature awakening is fraught with dangers of self-deception as well as the misuse of powers. The kundalini enables man to consciously cross the lower planes and it ultimately merges into the universal cosmic power of which it is a part, and which also is at times described as kundalini ... [but it] cannot dispense with the need for the grace of a Perfect Master.\nIn his book, Building a Noble World, Shiv R. Jhawar describes his Shaktipat experience at Muktananda's public program at Lake Point Tower in Chicago on 16 September 1974 as follows:\n\nBaba [Swami Muktananda] had just begun delivering his discourse with his opening statement: 'Today's subject is meditation. ... 'Kundalini starts dancing when one repeats Om Namah Shivaya.' Hearing this, I mentally repeated the mantra, I noticed that my breathing was getting heavier. Suddenly, I felt a great impact of a rising force within me. The intensity of this rising kundalini force was so tremendous that my body lifted up a little and fell flat into the aisle; my eyeglasses flew off. As I lay there with my eyes closed, I could see a continuous fountain of dazzling white lights erupting within me. In brilliance, these lights were brighter than the sun but possessed no heat at all. I was experiencing the thought-free state of \"I am\", realizing that \"I\" have always been, and will continue to be, eternal. I was fully conscious and completely aware while I was experiencing the pure \"I am\", a state of supreme bliss. Outwardly, at that precise moment, Baba delightfully shouted from his platform, ‘I didn't do anything. The Energy has caught someone.''\n\n\n=== Kundalini awakening ===\nThe experience of Kuṇḍalinī awakening can happen when one is either prepared or unprepared.\nAccording to Hindu tradition, in order to be able to integrate this spiritual energy, a period of careful purification and strengthening of the body and nervous system is usually required beforehand. Yoga and Tantra propose that Kuṇḍalinī can be awakened by a guru (teacher), but body and spirit must be prepared by yogic austerities, such as pranayama, or breath control, physical exercises, visualization, and chanting. The student is advised to follow the path in an open-hearted manner.\n\n\n== Religious interpretations ==\n\n\n=== Indian interpretations ===\nKuṇḍalinī is considered to occur in the chakra and nadis of the subtle body. Each chakra is said to contain special characteristics and with proper training, moving Kuṇḍalinī through these chakras can help express or open these characteristics.\nKuṇḍalinī is described as a sleeping, dormant potential force in the human organism.\nIt is one of the components of an esoteric description of the \"subtle body\", which consists of nadis (energy channels), chakras (psychic centres), prana (subtle energy), and bindu (drops of essence).\nKuṇḍalinī is described as being coiled up at the base of the spine. The description of the location can vary slightly, from the rectum to the navel.: 229–231  Kuṇḍalinī is said to reside in the triangular sacrum bone in three and a half coils.\nSwami Vivekananda describes Kuṇḍalinī briefly in his book Raja Yoga as follows:\n\nAccording to the Yogis, there are two nerve currents in the spinal column, called Pingalâ and Idâ, and a hollow canal called Sushumnâ running through the spinal cord. At the lower end of the hollow canal is what the Yogis call the \"Lotus of the Kundalini\". They describe it as triangular in a form in which... there is a power called the Kundalini, coiled up. When that Kundalini awakens, it tries to force a passage through this hollow canal, and as it rises step by step, as it were, layer after layer of the mind becomes open... When it reaches the brain, the Yogi is perfectly detached from the body and mind; the soul finds itself free. ... The left is the Ida, the right Pingala, and that hollow canal which runs through the center of the spinal cord is the Sushumna. ... The canal is closed at the lower end, ... near what is called the sacral plexus... The different plexuses that have their centers in the spinal canal can very well stand for the different \"lotuses\" of the Yogi.\nWhen Kuṇḍalinī Shakti is conceived as a goddess, then, when it rises to the head, it unites itself with the Supreme Being of (Lord Shiva). The aspirant then becomes engrossed in deep meditation and infinite bliss. Paramahansa Yogananda in his book God Talks with Arjuna: The Bhagavad Gita states:\n\nAt the command of the yogi in deep meditation, this creative force turns inward and flows back to its source in the thousand-petaled lotus, revealing the resplendent inner world of the divine forces and consciousness of the soul and spirit. Yoga refers to this power flowing from the coccyx to spirit as the awakened kundalini.\nParamahansa Yogananda also states:\n\nThe yogi reverses the searchlights of intelligence, mind and life force inward through a secret astral passage, the coiled way of the kundalini in the coccygeal plexus, and upward through the sacral, the lumbar, and the higher dorsal, cervical, and medullary plexuses, and the spiritual eye at the point between the eyebrows, to reveal finally the soul's presence in the highest center (Sahasrara) in the brain.\nKrishnamacharya, often called the \"father of modern yoga\", described kuṇḍalinī differently. To him, Kuṇḍalinī is not an energy that rises: it is a blockage that prevents prāṇa vāyu (breath) from entering the suṣumnā and rising. This interpretation came partly from his own experience and partly from teachings of two sects of Vishnu-worshiping temple priests.\n\n\n== Western significance ==\nSir John Woodroffe (1865–1936) – also known by his pseudonym Arthur Avalon – was a British Orientalist whose published works stimulated a far-reaching interest in Hindu philosophy and Yogic practices. While serving as a High Court Judge in Calcutta, he studied Sanskrit and Hindu philosophy, particularly as it related to Hindu Tantra. He translated numerous original Sanskrit texts and lectured on Indian philosophy, Yoga and Tantra. His book, The Serpent Power: The Secrets of Tantric and Shaktic Yoga became a major source for many modern Western adaptations of Kundalini yoga practice. It presents an academically and philosophically sophisticated translation of, and commentary on, two key Eastern texts: Shatchakranirūpana (Description and Investigation into the Six Bodily Centers) written by Tantrik Pūrnānanda Svāmī (1526) and the Paduka-Pancakā from the Sanskrit of a commentary by Kālīcharana (Five-fold Footstool of the Guru). The Sanskrit term \"Kundali Shakti\" translates as \"Serpent Power\". Kundalini is thought to be an energy released within an individual using specific meditation techniques. It is represented symbolically as a serpent coiled at the base of the spine.\nWhen Woodroffe later commented upon the reception of his work he clarified his objective, \"All the world (I speak of course of those interested in such subjects) is beginning to speak of Kundalinî Shakti.\" He described his intention as follows: \"We, who are foreigners, must place ourselves in the skin of the Hindu, and must look at their doctrine and ritual through their eyes and not our own.\"\n\n\n=== Carl Jung ===\nWestern awareness of Kuṇḍalinī was strengthened by the interest of Swiss psychiatrist and psychoanalyst Carl Jung (1875–1961).\n\n\"Jung's seminar on Kundalini yoga presented to the Psychological Club in Zurich in 1932 was widely regarded as a milestone in the psychological understanding of Eastern thought and of the symbolic transformations of inner experience. Kundalini yoga presented Jung with a model for the developmental phases of higher consciousness, and he interpreted its symbols in terms of the process of individuation, with sensitivity towards a new generation's interest in alternative religions and psychological exploration.\"\n\nIn the introduction to Jung's book The Psychology of Kundalini Yoga, Sonu Shamdasani puts forth: \n\n\"The emergence of depth psychology was historically paralleled by the translation and widespread dissemination of the texts of yoga... for the depth psychologies sought to liberate themselves from the stultifying limitations of Western thought to develop maps of inner experience grounded in the transformative potential of therapeutic practices. A similar alignment of \"theory\" and \"practice\" seemed to be embodied in the yogic texts that moreover had developed independently of the bindings of Western thought. Further, the initiatory structure adopted by institutions of psychotherapy brought its social organization into proximity with that of yoga. Hence, an opportunity for a new form of comparative psychology opened up.\"\n: xviii–xix \n\n\n=== More recent viewpoints ===\nThe American writer William Buhlman began to conduct an international survey of out-of-body experiences in 1969 in order to gather information about symptoms: sounds, vibrations and other phenomena that commonly occur at the time of the OBE event.  His primary interest was to compare the findings with reports made by yogis such as Gopi Krishna who have referred to similar phenomena, such as the \"vibrational state\" as components of their kundalini-related spiritual experience. He explains:\n\n There are numerous reports of full Kundalini experiences culminating with a transcendental out-of-body state of consciousness. In fact, many people consider this experience to be the ultimate path to enlightenment. The basic premise is to encourage the flow of Kundalini energy up the spine and toward the top of the head—the crown chakra—thus projecting your awareness into the higher heavenly dimensions of the universe. The result is an indescribable expansion of consciousness into spiritual realms beyond form and thought.\nSri Aurobindo was the other great scholarly authority on Kuṇḍalinī, with a viewpoint parallel to that of Woodroffe but of a somewhat different slant - this according to Mary Scott, herself a latter-day scholar on Kuṇḍalinī and its physical basis, and a former member of the Theosophical Society.\n\n\n=== Psychology ===\nAccording to Carl Jung \"the concept of Kundalini has for us only one use, that is, to describe our own experiences with the unconscious\". Jung used the Kundalini system symbolically as a means of understanding the dynamic movement between conscious and unconscious processes.\nAccording to Shamdasani, Jung claimed that the symbolism of Kuṇḍalinī yoga suggested that the bizarre symptomatology that patients at times presented, actually resulted from the awakening of the Kuṇḍalinī. He argued that knowledge of such symbolism enabled much that would otherwise be seen as the meaningless by-products of a disease process to be understood as meaningful symbolic processes, and explicated the often peculiar physical localizations of symptoms.: xxvi \nThe popularization of eastern spiritual practices has been associated with psychological problems in the west. Psychiatric literature notes that \"since the influx of eastern spiritual practices and the rising popularity of meditation starting in the 1960s, many people have experienced a variety of psychological difficulties, either while engaged in intensive spiritual practice or spontaneously.\" Among the psychological difficulties associated with intensive spiritual practice we find \"Kundalini awakening,\" \"a complex physio-psychospiritual transformative process described in the yogic tradition.\" Researchers in the fields of Transpersonal psychology, and Near-death studies have described a complex pattern of sensory, motor, mental, and affective symptoms associated with the concept of Kundalini, sometimes called the Kundalini syndrome.\nThe differentiation between spiritual emergency associated with Kuṇḍalinī awakening may be viewed as an acute psychotic episode by psychiatrists who are not conversant with the culture. The biological changes of increased P300 amplitudes that occurs with certain yogic practices may lead to acute psychosis. Biological alterations by Yogic techniques may be used to warn people against such reactions.\n\n\n== See also ==\nMystical experience\n\n\n== References ==\n\n\n== Further reading ==",
  "links": {
    "Abhinavagupta": "",
    "Acharya": "",
    "Achintya Bheda Abheda": "",
    "Adi Parashakti": "",
    "Adi Shankara": "",
    "Advaita Vedanta": "",
    "Agama (Hinduism)": "",
    "Aghor Yoga": "",
    "Ajñana": "",
    "Akshar Purushottam Darshan": ""
  },
  "url": "https://en.wikipedia.org/wiki/Kundalini"
}