{
  "title": "Math 55",
  "content": "Math 55 is a two-semester freshman undergraduate mathematics course at Harvard University founded by Lynn Loomis and Shlomo Sternberg. The official titles of the course are Studies in Algebra and Group Theory (Math 55a) and Studies in Real and Complex Analysis (Math 55b). Previously, the official title was Honors Advanced Calculus and Linear Algebra. The course has gained reputation for its difficulty and accelerated pace. \n\n\n== Description ==\nIn the past, Harvard University's Department of Mathematics had described Math 55 as \"probably the most difficult undergraduate math class in the country.\" But Math 55 lecturer for 2022 Professor Denis Auroux clarified that \"if you’re reasonably good at math, you love it, and you have lots of time to devote to it, then Math 55 is completely fine for you.\"\nFormerly, students would begin the year in Math 25 (which was created in 1983 as a lower-level Math 55) and, after three weeks of point-set topology and special topics (for instance, in 1994, p-adic analysis was taught by Wilfried Schmid), students would take a quiz. As of 2012, students may choose to enroll in either Math 25 or Math 55 but are advised to \"shop\" both courses and have five weeks to decide on one. \nDepending on the professor teaching the class, the diagnostic exam may still be given after three weeks to help students with their decision. In 1994, 89 students took the diagnostic exam: students scoring more than 50% on the quiz could enroll in Schmid's Math 55 (15 students), students scoring between 10 and 50% could enroll in Benedict Gross's Math 25: Theoretical Linear Algebra and Real Analysis (55 students), and students scoring less than 10% were advised to enroll in a course such as Math 21: Multivariable Calculus (19 students).\nIn the past, problem sets were expected to take from 24 to 60 hours per week to complete, although some claim that it is closer to 20 hours. In 2022, on average, students spend a total of 20 to 30 hours per week on this class, including homework.  Taking many other challenging courses and extracurricular activities in the same semester is ill-advised.\nStudents typically typeset their homework in LaTeX and essentially write their own textbook for this class, which ends with a take-home final exam.\n\n\n=== Historical retention rate ===\nIn 1970, Math 55 covered almost four years worth of department coursework in two semesters, and subsequently, it drew only the most diligent of undergraduates. Of the 75 students who enrolled in the 1970 offering, by course end, only 20 remained due to the advanced nature of the material and time-constraints under which students were given to work. David Harbater, a mathematics professor at the University of Pennsylvania and student of the 1974 Math 55 section at Harvard, recalled of his experience, \"Seventy [students] started it, 20 finished it, and only 10 understood it.\" Scott D. Kominers, familiar with the stated attrition rates for the course, decided to keep an informal log of his journey through the 2009 section: \"...we had 51 students the first day, 31 students the second day, 24 for the next four days, 23 for two more weeks, and then 21 for the rest of the first semester after the fifth Monday\" (the beginning of the fifth week being the drop deadline for students to decide whether to remain in Math 55 or transfer to Math 25).\nNumbers of students dropping are due in part to the tendency of undergraduates to \"shop around\" for appropriate courses at the start of each semester. Even those who passed Advanced Placement Calculus and were veterans of the USA Mathematical Olympiad might feel that Math 55 was too much to handle.\n\n\n== Course content ==\nIn short, Math 55 gives a survey of the entire undergraduate curriculum of mathematics in just two semesters and might even include graduate-level topics. Through 2006, the instructor had broad latitude in choosing the content of the course. Though Math 55 bore the official title \"Honors Advanced Calculus and Linear Algebra,\" advanced topics in complex analysis, point-set topology, group theory, and differential geometry could be covered in depth at the discretion of the instructor, in addition to single and multivariable real analysis as well as abstract linear algebra. In 1970, for example, students studied the differential geometry of Banach manifolds in the second semester of Math 55. In contrast, Math 25 was more narrowly focused, usually covering real analysis, together with the relevant theory of metric spaces and (multi)linear maps. These topics typically culminated in the proof of the generalized Stokes theorem, though, time permitting, other relevant topics (e.g. category theory, de Rham cohomology) might also be covered.  Although both courses presented calculus from a rigorous point of view and emphasized theory and proof writing, Math 55 was generally faster paced, more abstract, and demanded a higher level of mathematical sophistication. \nLoomis and Sternberg's textbook Advanced Calculus, an abstract treatment of calculus in the setting of normed vector spaces and on differentiable manifolds, was tailored to the authors' Math 55 syllabus and served for many years as an assigned text. Instructors for Math 55 and Math 25 have also selected Rudin's Principles of Mathematical Analysis, Ahlfors' Complex Analysis, Spivak's Calculus on Manifolds, Axler's Linear Algebra Done Right, Halmos's Finite-Dimensional Vector Spaces, Munkres' Topology, and Artin's Algebra as textbooks or references.\nFrom 2007 onwards, the scope of the course (along with that of Math 25) was changed to more strictly cover the contents of four semester-long courses in two semesters: Math 25a (linear algebra and real analysis) and Math 122 (group theory and vector spaces) in Math 55a; and Math 25b (real analysis) and Math 113 (complex analysis) in Math 55b. The name was also changed to \"Honors Abstract Algebra\" (Math 55a) and \"Honors Real and Complex Analysis\" (Math 55b).  Fluency in formulating and writing mathematical proofs is listed as a course prerequisite for Math 55, while such experience is considered \"helpful\" but not required for Math 25. In practice, students of Math 55 have usually had extensive experience in proof writing and abstract mathematics, with many being the past winners of prestigious national or international mathematical Olympiads (such as USAMO or IMO) or attendees of research programs (such as RSI). Typical students of Math 25 have also had previous exposure to proof writing through mathematical contests or university-level mathematics courses.\n\n\n== Notable alumni ==\nMany students who complete the course become professors in quantitative fields. Among those who took Math 55 were UC San Diego mathematician and former Harvard Dean Benedict Gross, Harvard mathematician Joe Harris, Columbia mathematical physicist Peter Woit, Harvard physicist Lisa Randall, Oxford geophysicist Raymond Pierrehumbert, Harvard economists Andrei Shleifer and Eric Maskin, and UC Berkeley economist Brad DeLong. Other alumni of Math 55 include business magnate and computer programmer Bill Gates, computer programmer and free-software promoter Richard Stallman, and television writer and executive producer Al Jean.\n\n\n== Demographics ==\nA 2006 article in The Harvard Crimson reported that only 17 women completed the class between 1990 and 2006, and a 2017 article said that enrollment had been less than 7% female in the previous five years. Math 25 has more women: in 1994–95, Math 55 had no women, while Math 25 had about 10 women in the 55-person course.  In 2006, the class was 45 percent Jewish (5 students), 18 percent Asian (2 students), 100 percent male (11 students).\n\n\n== In popular culture ==\nMath 55 is mentioned in Season 10, Episode 21 (\"Mr. Scratch\") of the police procedural crime drama Criminal Minds.\n\n\n== Instructors ==\n1996–1997: Alexander Polishchuk\n1997–1999: Pavel Etingof\n1999–2000: Noam Elkies\n2000–2001: Wilfried Schmid\n2002–2003: Noam Elkies\n2004–2005: Yum-Tong Siu\n2005–2006: Noam Elkies\n2008–2010: Curtis T. McMullen\n2010–2011: Noam Elkies\n2011–2012: Yum-Tong Siu\n2013–2015: Dennis Gaitsgory\n2015–2016: Yum-Tong Siu\n2016–2018: Noam Elkies\n2018–2020: Joe Harris\n2020–2022: Denis Auroux\n2022–2024: Joe Harris\n2024-2025: Denis Auroux\n\n\n== See also ==\n\nMathematics education in the United States\nWilliam Lowell Putnam Mathematical Competition\nPart III of the Mathematical Tripos\n\n\n== References ==\n\n\n== Further reading ==\nLoomis, Lynn; Sternberg, Shlomo (1990) [1968]. Advanced Calculus (Revised ed.). Jones and Bartlett Publishers, Inc. ISBN 0-86720-122-3. Retrieved December 9, 2018.\n\"Harvard Mathematics Department 21, 23, 25, or 55?\". Archived from the original on October 19, 2017. Retrieved December 9, 2018.\nProblem sets from Math 55 from 1999-2006\n1983: \"Math Faculty Committee Proposes Curriculum Revision\". The Harvard Crimson. Retrieved 2024-09-13.\n1999: \"Math 55: Rite of Passage for Dept.'s Elite Intimidates Many\". The Harvard Crimson. Retrieved 2024-09-13.\n2000: \"Math 55 student gets laid, considered for Fields Medal\". Satire V. Archived from the original on 2002-06-18.\n2005: Noam Elkies. \"Math 55a\".\n2009/10: Math 55a, Math 55b – Curtis McMullen\n2010/11: Math 55a, Math 55b – Noam Elkies",
  "links": {
    "AP Calculus": "",
    "Academic regalia of Harvard University": "",
    "Adams House (Harvard College)": "",
    "Al Jean": "",
    "Alan Garber": "",
    "Andrei Shleifer": "",
    "Arnold Arboretum": "",
    "Arthur M. Sackler Museum": "",
    "Ash Center for Democratic Governance and Innovation": "",
    "Baker Library/Bloomberg Center": ""
  },
  "url": "https://en.wikipedia.org/wiki/Math_55"
}