{
  "title": "Memory improvement",
  "content": "Memory improvement is the act of enhancing one's memory. Factors motivating research on improving memory include conditions such as amnesia, age-related memory loss, people’s desire to enhance their memory, and the search to determine factors that impact memory and cognition. There are different techniques to improve memory, some of which include cognitive training, psychopharmacology, diet, stress management, and exercise. Each technique can improve memory in different ways. \n\n\n== Memory function factors ==\n\n\n=== Neuroplasticity ===\nNeuroplasticity is the mechanism by which the brain encodes experience, learns new behaviors, and can relearn behaviors lost due to brain damage.\n\nExperience-dependent neuroplasticity suggests that the brain changes in response to experiences. After the learning of London taxicab drivers, who memorize maps of the city while studying to drive taxis, was studied over a period of time, it was found that the grey matter volume increased in the posterior hippocampus, an area in the brain involved heavily in memory. The longer taxi drivers navigated the streets of London, the higher the volume of the gray matter in their posterior hippocampus. This suggests a correlation between mental training or exercise and the brain's capacity to manage greater volume and more complex information. The increase in volume led to a decrease in the taxi drivers' ability to acquire new visuo-spatial information.\n\n\n=== Stress ===\nResearch has found that chronic and acute stress have adverse effects on memory processing systems.\n\nChronic stress has been shown to have negative impacts on the brain, especially in memory processing systems. The hippocampus is vulnerable to repeated stress due to adrenal steroid stress hormones.  Elevated glucocorticoids, a class of adrenal steroid hormones, results in increased cortisol, a well known stress response hormone in the brain, and glucocorticoids are known to affect memory. Prolonged high cortisol levels, as seen in chronic stress, have been shown to result in reduced hippocampal volume as well as deficits in hippocampal-dependent memory, as seen in impaired declarative, episodic, spatial, and contextual memory performance. Chronic, long-term high cortisol levels affect the degree of hippocampal atrophy, resulting in as much as a 14% hippocampal volume reduction and impaired hippocampus-dependent memory when compared to elderly subjects with decreased or moderate cortisol levels. Relative to other brain regions, the hippocampus has a high concentration of glucocorticoid receptors. The anterior hippocampus of London taxi drivers was hypothesized to decrease in volume as a result of elevated cortisol levels from stress.\nAcute stress, a more common form of stress, results in the release of adrenal steroids resulting in impaired short-term and working memory processes such as selective attention, memory consolidation, as well as long-term potentiation.  The human brain has a limited short-term memory capacity to process information, which results in constant competition between stimuli to become processed. Cognitive control processes such as selective attention reduce this competition by prioritizing where attention is distributed. In memory processing, attention enhances encoding and strength of memory traces. Memory is best when relevant information is attended to and irrelevant information is ignored.\nAnimal and human studies report that acute stress impairs the maintenance of short-term memory and working memory and aggravates neuropsychiatric disorders involved in short-term and working memory such as depression and schizophrenia. Studies with rats have also shown that exposure to acute stress reduces the survival of hippocampal neurons.\nOne of the roles of the central nervous system (CNS) is to help adapt to stressful environments. It has been suggested that acute stress may have a protective function for individuals more vulnerable to their own stress hormones. Some individuals, for example, are not able to decrease or habituate their cortisol elevation, which plays a major role in hippocampal atrophy. This over-response of the central nervous system to stress therefore causes maladaptive chronic stress-like effects to memory processing systems.\n\n\n== Strategies ==\n\n\n=== Cognitive training ===\nDiscovering that the brain can change as a result of experience has resulted in the development of cognitive training. Cognitive training improves cognitive functioning, which can increase working memory capacity and improve cognitive skills and functions in clinical populations with working memory deficiencies.  Cognitive training may focus on factors such as attention, speed of processing, neurofeedback, dual-tasking and perceptual training.\nCognitive training has been shown to improve cognitive abilities for up to five years. In one experiment studying how the cognitive functions of older adults were impacted by cognitive training involving memory, reasoning, and speed of processing, it was found that improvements in cognitive ability were maintained over time and had a positive transfer effect on everyday functioning. The results indicate that each type of cognitive training can produce immediate and lasting improvements in each kind of cognitive ability, thus suggesting that training can be beneficial to improving memory.\nCognitive training in areas other than memory has been seen to generalize and transfer to memory systems. The Improvement in Memory with Plasticity-based Adaptive Cognitive Training (IMPACT) study by the American Geriatrics Society in 2009 demonstrated that cognitive training designed to improve the accuracy and speed of the auditory system also improved memory and attention system functioning.\n\nCognitive training can be categorized as strategy training or core training.\n\nStrategy training is used to help individuals remember larger amounts of information of a particular type. It involves teaching approaches to encoding, maintaining, and recalling memories. The main goal of strategy training is to increase performance in tasks requiring retention of information. Studies strongly support the claim that the amount of information remembered can be increased by rehearsing out loud, telling a story with stimuli, or using imagery to make stimuli stand out. Strategy training has been used for children with Down syndrome and in older adult populations.\nCore training involves the repetition of demanding working memory tasks. Some core training programs involve a combination of several tasks with widely varying stimulus types. The diversity of exercises increases the chance that they will produce desired training-related gains. A goal of cognitive training is to impact the ease and success of cognitive performance in one's daily life. Core training can reduce the symptoms of attention deficit hyperactivity disorder (ADHD) and improve the quality of life of patients who have had conditions such as multiple sclerosis, schizophrenia, and strokes.\nThe manner in which a training study is conducted may affect outcomes or perceptions of them. Expectancy and effort effects occur when the experimenter subconsciously influences the participants to perform a desired result. One form of expectancy bias is the placebo effect, which is caused by the expectation that a training will have a positive influence on cognition. Control groups may be used to eliminate this bias because participants in them would not expect to benefit from the training. Researchers sometimes generalize their results, which can be misleading. An example is to generalize findings of a single task and interpret the observed improvements as a broadly defined cognitive ability.  The study may result in inconsistency if there are a variety of comparison groups used in working memory training, which is impacted by training and assessment timeline, assessment conditions, training setting and control group selection.\nThe Five x Five System is a set of memory enhancement tools that are scientifically validated. The system was created by Dr. Peter Marshall for research purposes at Royal Holloway, University of London. The system involves five groups of five tactics designed to maximize storage and recall at each stage of the process of registering, short-term storage, long-term storage, consolidation and retrieval and was designed to test efficacy of memory training in school curricula. Each section is of equal text length so that it can be taught verbatim in the same amount of time by all competent teachers.\n\n\n=== Personal application and intellectual conception ===\nGeneration effect\nThe generation effect relies on the involvement of the individual in creating their own study materials in order to enhance encoding and long-term retrieval. Though the underlying mechanisms of the generation effect are not fully understood, an analysis concluded that the effect is real.\nTesting effect\nThe testing effect is a derivative of the generation effect as it involves generating the self-testing material. Moreover, it is known that repeatedly testing oneself enhances encoding, thus improving memory. The testing effect happens when most of the learning is allocated to declarative knowledge and long term memory is enhanced. Practice is necessary for retrieving memories.  The more frequently that a person practices memorization, the more capable they are of remembering it later. The development of a retrieval structure that makes it easier to access long-term memories is facilitated by using repeated retrieval practice. The testing effect occurs because of the development of an adequate retrieval structure. The testing effect is different from re-reading because the information being learned is being practiced and tested, forcing the information to be drawn from memory to recall. The testing effect allows for information to be recalled over a longer period, as it is used as a self-testing tool, and aids in recalling information in the future. This strategy is effective when using memory recall for information such as that being tested on and needing to be in long-term memory.\nSpacing effect\nTaking scheduled breaks and having short study sessions has proven to be more effective for memory compared to one long study session. It is also known that memory can be improved by sleeping after learning. Longer breaks between study sessions have been associated with better learning and retention. Encountering previously learned information after a break helps improve long- and short-term retention.\nIllusion of learning\nIllusions of learning should be avoided when improving memory. Some learning and studying strategies people use may seem more effective than they actually are. This creates a problem where the individual thinks they know the material, when they don't necessarily. This could be caused by fluency and the familiarity effect. As people reread the material over and over, it becomes easier to read, creating a sense of fluency. However, this fluency does not indicate that encoding or retrieval of the material is being enhanced. The familiarity effect creates an illusion of learning; when the individual recognizes a word or concept to be familiar, they may interpret that as knowing and understanding the material.\nState-dependent learning\nRetrieval is known to be improved when the environment/mood state that the encoding happened in, matches the environment/mood state at the time of retrieval. \nConcept Maps “are diagrams that link word concepts in a fluid manner to central key concepts.”  They center around a main topic or idea, with lines protruding from the center with related information. Other concepts and ideas are then written at the end of each of the lines with new, related information. These related ideas are usually one or two words in length, giving only the essence of what is needed for memory retrieval. Related ideas can also be drawn at the ends of the lines. This may be especially useful, given the drawing effect (people remember images better than words). These diagrams are beneficial because they require the creator to link and integrate different ideas, which improve critical thinking and leads to more meaningful learning. Concept maps also help to facilitate the storage of material in long term memory, as well as help to show visually any knowledge gaps that may be present. Concept maps have been shown to improve people's ability to complete novel problem solving tasks.\nThe Drawing Effect is another way to improve memory. Studies show that images are better remembered than words, something that is now known as the picture-superiority effect. Furthermore, another study found that when people are studying vocabulary, they remember more when they draw the definition, in comparison to writing it. This is thought to be because drawing uses 3 different types of memory- elaborative, motor, and pictorial. The benefit of using pictures to enhance memory is even seen at an older age, including in dementia patients.\n\n\n==== Method of loci and visual memory ====\nThe method of loci is a technique utilized for memory recall when items to be remembered are associated with different locations that are well known to the learner. Method of loci is one of the oldest and most effective mnemonics based on visual imagery. The more that visual memory is exercised through using objects to recall information, the higher the memory recall. The locations that are utilized when using the method of loci aid in the effectiveness of memory recall. Using the location of a driving route to work is more effective than using a room within a home because items in a room can be moved around while a route to work is more constant without items being moved around. There are limitations when using method of loci, since it is difficult to recall any given item without working one's way through the list sequence, which can be time consuming. Another limitation is that it is not useful when an individual is trying to learn and remember the real world. This and other mnemonic techniques are effective because they allow the learner to apply their own knowledge to increase their memory recall.\n\n\n=== Psychopharmacology ===\n\nPsychopharmacology is the scientific study of the actions of drugs and their effects on mood, sensation, thought, and behavior.\nThere is evidence that aspects of memory can be improved by action on selective neurotransmitter systems, such as the cholinergic system, which releases acetylcholine, which may have therapeutic benefits for patients with cognitive disorders.\nFindings from studies have indicated that acute administration of nicotine can improve cognitive performance (particularly for tasks that require attention), short-term episodic memory and prospective memory task performance. Chronic usage of low-dose nicotine in animals has been found to increase the number of neuronal nicotinic acetylcholine receptors (nAChRs) and improve performance on learning and memory tasks.\nShort-term nicotine treatment, utilizing nicotine skin patches, have shown that it may be possible to improve cognitive performance in a variety of groups such as normal non-smoking adults, Alzheimer's disease patients, schizophrenics, and adults with attention-deficit hyperactivity disorder. Similarly, evidence suggests that smoking improves visuospatial working memory impairments in schizophrenic patients, which may explain the high rate of tobacco smoking found in people with schizophrenia.\n\n\n=== Stress management ===\n\nMeditation, a form of mental training to focus attention, has been shown to increase the control over brain resource distribution, improving both attention and self-regulation. The changes are potentially long-lasting, as meditation may be able to strengthen neuronal circuits as selective attention improves. Meditation may also increase cognitive limited capacity, affecting the way in which stimuli are processed.\nMeditation practice has also been associated with physical changes in brain structure. Magnetic resonance imaging (MRI) of Buddhist insight meditation practitioners who practiced mindfulness meditation found that they had an increase in cortical thickness and hippocampus volume compared to the control group. This research provides evidence that practicing meditation promotes neural plasticity and experience-dependent cortical plasticity. Mindfulness, which is also known to increase openness to experiences out of curiosity, interest and acceptance, can increase one's capacity to focus and their awareness momentarily. Research shows that mindfulness can improve memory, which influences stress processing pathways in the amygdala and prefrontal cortex. Mindfulness meditation works in association with the sympathetic nervous system (SNS) to regulate the hypothalamic-pituitary-adrenal (HPA) system and the sympathomedullary pathway (SAM) to maintain homeostasis on stress-reactive physiology.\n\n\n=== Exercise ===\n\nIn both human and animal studies, exercise has been shown to improve cognitive performance on encoding and retrieval tasks. The Morris water maze and radial arm water maze studies of rodents found that, when compared to sedentary animals, exercised mice showed improved performance traversing the water maze and improved memory of the location of an escape platform. Human studies have shown that cognitive performance is improved due to physiological arousal, which made mental processes faster and improved memory storage and retrieval. Ongoing exercise interventions have been found to favorably impact memory processes in older adults and children.\nExercise has been found to positively regulate hippocampal neurogenesis, which is considered an explanation for the positive influence of physical activities on memory performance. Hippocampus-dependent learning can promote the survival of newborn neurons, which may serve as a foundation for the formation of new memories.  Exercise has been found to increase the level of the brain-derived neurotrophic factor (BDNF) protein in rats, with elevated BDNF levels corresponding with strengthened performance on memory tasks. Data also suggests that BDNF availability at the beginning of cognitive testing is related to the overall acquisition of a new cognitive task and may be important in determining the strength of recall in memory tasks.\nA meta-analysis concluded that resistance training, as compared to cardiovascular exercise, had no measurable effect on working memory.\nSome evidence shows that the amount of effort put into exercising is positively correlated with the level of cognitive performance after working out in the short term and long term.\n\n\n=== Mental exercise ===\nAristotle wrote a treatise about memory: De memoria et reminiscentia. To improve recollection, he advised that a systematic search should be made and that practice was helpful. He suggested grouping the items to be remembered in threes and then concentrating upon the central member of each triad.\nPlaying music has recently gained attention as a possible way to promote brain plasticity. Results that have been found suggest that learning music can improve different aspects of memory. Children who participated in one year of instrumental musical training showed improved verbal memory, whereas no such improvement was shown in children who discontinued musical training. Similarly, adults with no previous musical training who participated in individualized piano instruction showed improved performance on tasks designed to test attention and working memory compared to a healthy control group. Evidence suggests that the improvements to verbal, working and long-term memory associated to musical training are a result of the enhanced verbal rehearsal mechanisms musicians possess.\nAnother study tested how learning a new activity impacts the memory and mental control of elderly patients. The patients were divided into five groups that each spent 15 hours a week doing one of five different activities: learning digital photography, quilting, learning both digital photography and quilting, socializing with others, or doing solitary activities by themselves. It was found that all groups improved with regard to mental control and that learning new skills led to improved episodic memory.\n\n\n=== Memory aids ===\n\nPhysical memory aids, which are typically worn on the wrist or finger, can help the user remember something they might otherwise forget. Aids can be used by people with memory loss. Typical memory aids for people with Alzheimer's include sticky notes and color-coded memory aids. Tying a string around one's finger is used to remember things. One school yearbook from 1849 suggested that a string tied around a finger or a knot tied in the corner of a handkerchief were used to remember something important for a student. The oldest documented legend of a string used as a memory aid was in the myth Ariadne's thread, which describes Ariadne presenting a thread to her lover, Theseus, so that he could find his way out of the Minotaur's labyrinth. The knot-in-the-handkerchief memory aid was used by German philosopher Martin Heidegger.\n\nA memory clamp (also called a \"reality clamp\") is a generic name for a type of physical memory aid worn on the wrist or finger to help the user remember something they might otherwise forget. It was originally invented by physicist Rick Yukon, who used visuals that were difficult to ignore with a deliberately intrusive shape and size. Memory clamps are designed to be difficult to ignore visually, typically with bright colors and sometimes contrasting base colors, to cause a slight amount of visual and physical discomfort, so that the user maintains at least partial awareness of the intrusion. It is designed to be worn intermittently, so that the user doesn't become accustomed to it.\nOther methods for remembering things include writing on one's own hand, sending a text message to oneself, or using sticky notes. Wrist-worn, finger-worn and ankle-worn memory aids have been used for hundreds of years.\n\n\n== See also ==\nCognitive enhancer\nEffect of caffeine on memory\nEmotion and memory\nMusic-related memory\nSleep and Memory\nSpaced repetition\nWorking memory training\n\n\n== Notes ==\n\n\n== References ==",
  "links": {
    "Absent-mindedness": "",
    "Active recall": "",
    "Adrenal cortex": "",
    "American Geriatrics Society": "",
    "Amnesia": "",
    "Andriy Slyusarchuk": "",
    "Anne Treisman": "",
    "Anterograde amnesia": "",
    "Ariadne's thread": "",
    "Aristotle": ""
  },
  "url": "https://en.wikipedia.org/wiki/Memory_improvement"
}