{
  "title": "Nonviolent Communication",
  "content": "Nonviolent Communication (NVC) is an approach to enhanced communication, understanding, and connection based on the principles of nonviolence and humanistic psychology. It is not an attempt to end disagreements, but rather a way that aims to increase empathy and understanding to improve the overall quality of life. It seeks empathic dialogue and understanding among all parties. Nonviolent Communication evolved from concepts used in person-centered therapy, and was developed by clinical psychologist Marshall Rosenberg beginning in the 1960s and 1970s. There are a large number of workshops and clinical materials about NVC, including Rosenberg's book Nonviolent Communication: A Language of Life. Marshall Rosenberg also taught NVC in a number of video lectures available online; the workshop recorded in San Francisco is the most well-known.\nNVC is a communication tool with the goal of first creating empathy in the conversation. The idea is that once people hear one another, it will be much easier to talk about a solution which satisfies all parties' fundamental needs. The goal is interpersonal harmony and obtaining knowledge for future cooperation. Notable concepts include rejecting coercive forms of discourse, gathering facts through observing without evaluating, genuinely and concretely expressing feelings and needs, and formulating effective and empathetic requests. Nonviolent Communication is used as a clinical psychotherapy modality and it is also offered in workshops for the general public, particularly in regard to seeking harmony in relationships and at workplaces.\n\n\n== History ==\nMarshall Rosenberg's motivation for developing NVC was based on his own experiences at the Detroit race riot of 1943, as well as the antisemitism that he experienced in his early life . \n\nAccording to Marion Little (2008), the roots of the NVC model developed in the late 1960s, when Rosenberg was working on racial integration in schools and organizations in the Southern United States. The earliest version of the model (observations, feelings, needs, and action-oriented wants) was part of a training manual Rosenberg prepared in 1972.\nThe development of NVC is highly reliant on concepts developed by Carl Rogers and person-centered therapy. Rogers emphasized: 1) experiential learning, 2) \"frankness about one's emotional state,\" 3) the satisfaction of hearing others \"in a way that resonates for them,\" 4) the enriching and encouraging experience of \"creative, active, sensitive, accurate, empathic listening,\" 5) the \"deep value of congruence between one's own inner experience, one's conscious awareness, and one's communication,\" and, subsequently, 6) the enlivening experience of unconditionally receiving love or appreciation and extending the same. These influenced the concepts described in the section below.\nRosenberg was influenced by Erich Fromm, George Albee, and George Miller to adopt a community focus in his work, moving away from clinical psychological practice. The central ideas influencing this shift by Rosenberg were that: (1) individual mental health depends on the social structure of a community (Fromm), (2) therapists alone are unable to meet the psychological needs of a community (Albee), and (3) knowledge about human behavior will increase if psychology is freely given to the community (Miller).\nRosenberg's early work with children with learning disabilities shows his interest in psycholinguistics and the power of language, as well as his emphasis on collaboration. In its initial development, the NVC model re-structured the pupil-teacher relationship to give students greater responsibility for, and decision-making related to, their own learning. The model has evolved over the years to incorporate institutional power relationships (i.e., police-citizen, boss-employee) and informal ones (i.e. man-woman, rich-poor, adult-youth, parent-child). The ultimate aim is to develop societal relationships based on a restorative, \"partnership\" paradigm and mutual respect, rather than a retributive, fear-based, \"domination\" paradigm.\nIn order to show the differences between communication styles, Rosenberg started to use two animals. Violent communication was represented by the carnivorous Jackal as a symbol of aggression and especially dominance. The herbivorous Giraffe on the other hand, represented his NVC strategy. The Giraffe was chosen as symbol for NVC as its long neck is supposed to show the clear-sighted speaker, being aware of his fellow speakers' reactions; and because the Giraffe has a large heart, representing the compassionate side of NVC. In his courses he tended to use these animals in order to make the differences in communication clearer to the audience.\nThe model had evolved to its present form (observations, feelings, needs and requests) by 1992. Since the late 2000s, there has been more emphasis on self-empathy as a key to the model's effectiveness. Another shift in emphasis, since 2000, has been the reference to the model as a process. The focus is thus less on the \"steps\" themselves and more on the practitioner's intentions in speaking (\"Is the intent to get others to do what one wants, or to foster more meaningful relationships and mutual satisfaction?\") in listening (\"Is the intent to prepare for what one has to say, or to extend heartfelt, respectful attentiveness to another?\") and the quality of connection experienced with others.\nIn 2019, a group of certified NVC trainers published a #MeToo statement honouring Marshall Rosenberg's legacy but also acknowledging he had slept with students at some times of his life. The trainers encourage all facilitators to share a warning with prospective clients and students about the potential risks of empathy work and recommended sexual boundaries.\n\n\n== Overview ==\n\nNonviolent Communication holds that most conflicts between individuals or groups arise from miscommunication about their human needs, due to coercive or manipulative language that aims to induce fear, guilt, shame, etc. These \"violent\" modes of communication, when used during a conflict, divert the attention of the participants away from clarifying their needs, their feelings, their perceptions, and their requests, thus perpetuating the conflict.\n\n\n=== Alternative names ===\nIn a recorded lecture, Marshall Rosenberg describes the origins of the name Nonviolent Communication. He explains that the name was chosen to connect his work to the word \"nonviolence\" that was used by the peace movement, thus showing the ambition to create peace on the planet. Meanwhile, Marshall did not  like that name since it described what NVC is not, rather than what NVC is. In fact, this goes against an important principle in the fourth component of NVC, i.e. requests. Specifically, in an NVC request, one should ask for what one does want, not what one doesn't want. Because of this, a number of alternative names have become common, most importantly giraffe language, compassionate communication or collaborative communication.\n\n\n=== Components ===\nThere are four components to practice nonviolent communication, and in this order:\n\nObservation: These are facts (what we are seeing, hearing, or touching) as distinct from our evaluation of meaning and significance. NVC discourages static generalizations. It is said that \"When we combine observation with evaluation, others are apt to hear criticism and resist what we are saying.\" Instead, a focus on observations specific to time and context is recommended.: ch.3 \nFeelings: These are emotions or sensations, free of thought and story. These are to be distinguished from thoughts (e.g., \"I feel I didn't get a fair deal\") and from words colloquially used as feelings but which convey what we think we are (e.g., \"inadequate\"), how we think others are evaluating us (e.g., \"unimportant\"), or what we think others are doing to us (e.g., \"misunderstood\", \"ignored\"). Feelings are said to reflect whether we are experiencing our needs as met or unmet. Identifying feelings is said to allow us to more easily connect with one another, and \"Allowing ourselves to be vulnerable by expressing our feelings can help resolve conflicts.\": ch.4 \nNeeds: These are universal human needs, as distinct from particular strategies for meeting needs. It is posited that \"Everything we do is in service of our needs.\" Marshall Rosenberg refers to Max-Neef's model where needs may be categorised into 9 classes: sustenance, safety, love, understanding/empathy, creativity, recreation, sense of belonging, autonomy and meaning. For more information, the Center for Nonviolent Communication has developed a needs inventory.\nRequests: Requests are distinguished from demands in that one is open to hearing a response of \"no\" without this triggering an attempt to force the matter. If one makes a request and receives a \"no\" it is not recommended that one gives up, but that one empathizes with what is preventing the other person from saying \"yes,\" before deciding how to continue the conversation. It is recommended that requests use clear, positive, concrete action language.: ch.6 \n\n\n=== Modes ===\nThere are three primary modes of application of NVC:\n\nSelf-empathy involves compassionately connecting with what is going on inside us. This may involve, without blame, noticing the thoughts and judgments we are having, noticing our feelings, and most critically, connecting to the needs that are affecting us.: ch.4 \nReceiving empathically, in NVC, involves \"connection with what's alive in the other person and what would make life wonderful for them... It's not an understanding of the head where we just mentally understand what another person says... Empathic connection is an understanding of the heart in which we see the beauty in the other person, the divine energy in the other person, the life that's alive in them... It doesn't mean we have to feel the same feelings as the other person. That's sympathy, when we feel sad that another person is upset. It doesn't mean we have the same feelings; it means we are with the other person... If you're mentally trying to understand the other person, you're not present with them.\": ch.5  Empathy involves \"emptying the mind and listening with our whole being.\" NVC suggests that however the other person expresses themselves, we focus on listening for the underlying observations, feelings, needs, and requests. It is suggested that it can be useful to reflect a paraphrase of what another person has said, highlighting the NVC components implicit in their message, such as the feelings and needs you guess they may be expressing.: ch.7 \nExpressing honestly, in NVC, is likely to involve expressing an observation, feeling, need, and request. An observation may be omitted if the context of the conversation is clear. A feeling might be omitted if there is sufficient connection already, or the context is one where naming a feeling isn't likely to contribute to connection. It is said that naming a need in addition to a feeling makes it less likely that people will think you are making them responsible for your feeling. Similarly, it is said that making a request in addition to naming a need makes it less likely that people will infer a vague demand that they address your need. The components are thought to work together synergistically. According to NVC trainer Bob Wentworth, \"an observation sets the context, feelings support connection and getting out of our heads, needs support connection and identify what is important, and a request clarifies what sort of response you might enjoy. Using these components together minimizes the chances of people getting lost in potentially disconnecting speculation about what you want from them and why.\"\n\n\n== Research ==\nA systematic review of research as of 2013 analyzed 13 studies picked from 2,634 citations. Two of these studies came from peer-reviewed journals. Eleven of these suggested an increase in empathy subsequent to the application of NVC (five of these with evidence of statistical significance) and two did not. There have been no randomized studies into NVC. Academic research into NVC only began in the 1990s, and has been increasing with time.\nAs of 2017, fifteen master's theses and doctoral dissertations are known to have tested the model on sample sizes of 108 or smaller and generally have found the model to be effective.\nWhile it is widely applied in clinical and lay contexts, and very limited research generally shows the technique to be effective in conflict resolution and increasing empathy, psychologists generally do not consider it to have the same standing as evidence-based practices such as cognitive-behavioral therapy. This is due to the low amount of academic research on the method.\nAllan Rohlfs, who first met Rosenberg in 1972 and was a founder of the Center for Nonviolent Communication, in 2011 explained a paucity of academic literature as follows:\n\nVirtually all conflict resolution programs have an academic setting as their foundation and therefore have empirical studies by graduate students assessing their efficacy. NVC is remarkable for its roots. Marshall Rosenberg, Ph.D. (clinical psychology, U of Wisconsin) comes from a full time private practice in clinical psychology and consultation, never an academic post. NVC, his creation, is entirely a grassroots organization and never had until recently any foundation nor grant monies, on the contrary funded 100% from trainings which were offered in public workshops around the world. ... Empirical data is now coming slowly as independent researchers find their own funding to conduct and publish empirical studies with peer review.\nBowers and Moffett (2012) asserts that NVC has been absent from academic programs due to a lack of research into the theoretical basis for the model and lack of research on the reliability of positive results.\nConnor and Wentworth (2012) examined the impact of 6-months of NVC training and coaching on 23 executives in a Fortune 100 corporation. A variety of benefits were reported, including \"conversations and meetings were notably more efficient, with issues being resolved in 50-80 percent less time.\"\nA 2014 study examined the effects of combined NVC and mindfulness training on 885 male inmates of the Monroe Correctional Complex in Monroe, Washington. The training was found to reduce recidivism from 37% to 21%, and the training was estimated as having saved the state $5 million per year in reduced incarceration costs. The training was found to increase equanimity, decrease anger, and lead to abilities to take responsibility for one's feelings, express empathy, and to make requests without imposing demands.\n\n\n== Relationship to spirituality ==\nIn the introduction to Rosenberg's book Nonviolent Communication: A Language of Life, \n\nNVC is described as a framework of several pre-existing concepts, that Rosenberg found useful on the topic of communication and conflict resolution. Therefore, it is perhaps not surprising that some Christians have found NVC to be complementary to their Christian faith. Many people have found Nonviolent Communication to be very complementary to Buddhism, both in theory and in manifesting Buddhist ideals in practice. Furthermore, the \"NVC consciousness\" described in NVC have several similarities to the concepts of presence and patience in mindfulness. \nAs Theresa Latini notes, \"Rosenberg understands NVC to be a fundamentally spiritual practice.\" Marshall Rosenberg describes the influence of his spiritual life on the development and practice of NVC:\n\nI think it is important that people see that spirituality is at the base of Nonviolent Communication, and that they learn the mechanics of the process with that in mind. It's really a spiritual practice that I am trying to show as a way of life. Even though we don't mention this, people get seduced by the practice. Even if they practice this as a mechanical technique, they start to experience things between themselves and other people they weren't able to experience before. So eventually they come to the spirituality of the process. They begin to see that it's more than a communication process and realize it's really an attempt to manifest a certain spirituality.\nRosenberg further states that he developed NVC as a way to \"get conscious of\" what he calls the \"Beloved Divine Energy\". Rosenberg considered NVC to be much more than a four-step process for communication, but rather a way of living.\n\n\n== Relationship to other models ==\nMarion Little examines theoretical frameworks related to NVC. The influential interest-based model for conflict resolution, negotiation, and mediation developed by Fisher, Ury, and Patton at the Harvard Negotiation Project and at the Program on Negotiation in the 1980s appears to have some conceptual overlap with NVC, although neither model references the other.: 31–35  Little suggests The Gordon Model for Effective Relationships (1970) as a likely precursor to both NVC and interest-based negotiation, based on conceptual similarities, if not any direct evidence of a connection.: 35–41  Like Rosenberg, Gordon had worked with Carl Rogers, so the models' similarities may reflect common influences.: 35 \nSuzanne Jones sees a substantive difference between active listening as originated by Gordon and empathic listening as recommended by Rosenberg, insofar as active listening involves a specific step of reflecting what a speaker said to let them know you are listening, whereas empathic listening involves an ongoing process of listening with both heart and mind and being fully present to the other's experience, with an aim of comprehending and empathizing with the needs of the other, the meaning of the experience for that person.\nGert Danielsen and Havva Kök both note an overlap between the premises of NVC and those of Human Needs Theory (HNT), an academic model for understanding the sources of conflict and designing conflict resolution processes, with the idea that \"Violence occurs when certain individuals or groups do not see any other way to meet their need, or when they need understanding, respect and consideration for their needs.\"\nChapman Flack sees an overlap between what Rosenberg advocates and critical thinking, especially Bertrand Russell's formulation uniting kindness and clear thinking.\nMartha Lasley sees similarities with the Focused Conversation Method developed by the Institute of Cultural Affairs (ICA), with NVC's observations, feelings, needs, and requests components relating to FCM's objective, reflective, interpretive, and decisional stages.\n\n\n== Applications ==\nNVC has been applied in organizational and business settings, in parenting, in education, in mediation, in psychotherapy, in healthcare, in addressing eating issues, in justice, and as a basis for a children's book, among other contexts.\nRosenberg related ways he used Nonviolent Communication in peace programs in conflict zones including Rwanda, Burundi, Nigeria, Malaysia, Indonesia, Sri Lanka, Colombia, Serbia, Croatia, Ireland, and the Middle East including the occupied West Bank.\nReportedly, one of the first acts of Satya Nadella when he became CEO of Microsoft in 2014 was to ask top company executives to read Rosenberg's book, Nonviolent Communication.\n\n\n== Criticisms ==\nSeveral researchers have attempted a thorough evaluation of criticisms and weaknesses of NVC and assessed significant challenges in its application. These span a range of potential problems, from the practical to the theoretical, and include concerns gathered from study participants and researchers.\nThe difficulty of using NVC as well as the dangers of misuse are common concerns. In addition, Bitschnau and Flack find a paradoxical potential for violence in the use of NVC, occasioned by its unskilled use. Bitschnau further suggests that the use of NVC is unlikely to allow everyone to express their feelings and have their needs met in real life as this would require inordinate time, patience and discipline. Those who are skilled in the use of NVC may become prejudiced against those who are not and prefer to converse only among themselves.\nFurthermore, the exclusivity of NVC appears to favor the well-educated, valuing those with more awareness of grammar, word choice, and syntax.  This could lead to problems of accessibility for the underprivileged and favoring a higher social class.\nOboth suggests that people might hide their feelings in the process of empathy, subverting the nonviolence of communication.\nThough intended to strengthen relationships between loved ones, NVC may lead to the outcome of an ended relationship. We are finite creatures with finite resources, and understanding one another's needs through NVC may teach that the relationship causes too much strain to meet all needs.\nThe massive investment of time and effort in learning to use NVC has been noted by a number of researchers.\nChapman Flack, in reviewing a training video by Rosenberg, finds the presentation of key ideas \"spell-binding\" and the anecdotes \"humbling and inspiring\", notes the \"beauty of his work\", and his \"adroitly doing fine attentive thinking\" when interacting with his audience. Yet Flack wonders what to make of aspects of Rosenberg's presentation, such as his apparent \"dim view of the place for thinking\" and his building on Walter Wink's account of the origins of our way of thinking. To Flack, some elements of what Rosenberg says seem like pat answers at odds with the challenging and complex picture of human nature, history, literature, and art offer.\nFlack notes a distinction between the \"strong sense\" of Nonviolent Communication as a virtue that is possible with care and attention, and the \"weak sense,\" a mimicry of this born of ego and haste. The strong sense offers a language to examine one's thinking and actions, support understanding, bring one's best to the community, and honor one's emotions. In the weak sense, one may take the language as rules and use these to score debating points, label others for political gain, or insist that others express themselves in this way. Though concerned that some of what Rosenberg says could lead to the weak sense, Flack sees evidence confirming that Rosenberg understands the strong sense in practice. Rosenberg's work with workshop attendees demonstrates \"the real thing.\" Yet Flack warns that \"the temptation of the weak sense will not be absent.\" As an antidote, Flack advises, \"Be conservative in what you do, be liberal in what you accept from others,\" (also known as the robustness principle) and guard against the \"metamorphosis of nonviolent communication into subtle violence done in its name.\"\nEllen Gorsevski, assessing Rosenberg's book, Nonviolent Communication: A Language of Compassion (1999) in the context of geopolitical rhetoric, states that \"the relative strength of the individual is vastly overestimated while the key issue of structural violence is almost completely ignored.\"\nPuddleDancer Press reports that NVC has been endorsed by a variety of public figures.\nSven Hartenstein has created a series of cartoons spoofing NVC.\nWhile a number of studies have indicated a high degree of effectiveness, there has been limited academic research into NVC in general. From an evidence-based standpoint, it does not have the same standing as practices such as cognitive-behavioral therapy. Supporters of the theory have generally relied on clinical and anecdotal experience to support its efficacy. Critics generally assume the efficacy of the method on an individual level; most criticism consider issues of equity and consistency. In Internet blog posts, some have described its model as self-contradictory, viewing NVC as a potentially coercive (and thus “violent”) technique with significant potential for misuse. The method requires a substantial amount of effort (time) to learn and apply, and assumes a certain level of education.\n\n\n== Organizations ==\nThe Center for Nonviolent Communication (CNVC), founded by Marshall Rosenberg, has trademarked the terms Nonviolent Communication: A Language of Life, The Center for Nonviolent Communication and CNVC.\nCNVC certifies trainers who wish to teach NVC in a manner aligned with CNVC's understanding of the NVC process. CNVC also offers trainings by certified trainers.\nSome trainings in Nonviolent Communication are offered by trainers sponsored by organizations considered as allied with, but having no formal relationship with, the Center for Nonviolent Communication founded by Marshall Rosenberg. Some of these trainings are announced through CNVC. Numerous NVC organizations have sprung up around the world, many with regional focuses.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nAtlee, T. \"Thoughts on Nonviolent Communication and Social Change.\" Co-intelligence Institute.\nBranch, K. (2017) \"How to Survive Thanksgiving Drama With This Smart Conflict-Management Strategy\" Vogue Magazine November, 2017.\nEvans, Louise (2016) The Five Chairs: Own Your Behaviours, Master Your Communication, Determine Your Success (book; TEDx talk)\nKabatznick, R. and M. Cullen (2004) \"The Traveling Peacemaker: A Conversation with Marshall Rosenberg.\" Inquiring Mind, Fall issue.\nKashtan, M. (2010-ongoing), blog about applying NVC The Fearless Heart by the co-founder of Bay Area Nonviolent Communication.\nKashtan, M. (2012) \"Nonviolent Communication: Gandhian Principles for Everyday Living\", Satyagraha Foundation for Nonviolence Studies, April 2012.\nLatini, T. (2009). Nonviolent Communication: A Humanizing Ecclesial and Educational Practice. Journal of Education & Christian Belief.\nMoore, P. (2004) \"NonViolent Communication as an Evolutionary Imperative-The InnerView of Marshall Rosenberg\" Alternatives, Issue 29, Spring.\nSauer, M. (2004) \"Expert on conflict resolution believes nonviolence is in our nature\" San Diego Union-Tribune, October 14, 2004.\nvan Gelder, S. (1998) \"The Language of Nonviolence\" Yes Magazine, Summer 1998.\n\n\n== External links ==\nThe Center for Nonviolent Communication - nonprofit international organization\n\"Non Violent Communicator: an online Tool to help create NVC Communications\". nvccommunicator.com. 2018-06-12. Archived from the original on 2023-03-25.\nNonviolent Communication by the authentic communication group - online skills training that helps to improve personal development",
  "links": {
    "Active listening": "",
    "Aldous Huxley": "",
    "Alternatives to Violence Project": "",
    "Antisemitism": "",
    "Bertrand Russell": "",
    "Biocommunication (science)": "",
    "Broadcasting": "",
    "Buddhism": "",
    "Burundi": "",
    "Carl Rogers": ""
  },
  "url": "https://en.wikipedia.org/wiki/Nonviolent_Communication"
}