{
  "title": "Philosophy of physics",
  "content": "In philosophy, the philosophy of physics deals with conceptual and interpretational issues in physics, many of which overlap with research done by certain kinds of theoretical physicists. Historically, philosophers of physics have engaged with questions such as the nature of space, time, matter and the laws that govern their interactions, as well as the epistemological and ontological basis of the theories used by practicing physicists. The discipline draws upon insights from various areas of philosophy, including metaphysics, epistemology, and philosophy of science, while also engaging with the latest developments in theoretical and experimental physics. \nContemporary work focuses on issues at the foundations of the three pillars of modern physics:\n\nQuantum mechanics: Interpretations of quantum theory, including the nature of quantum states, the measurement problem, and the role of observers. Implications of entanglement, nonlocality, and the quantum-classical relationship are also explored.\nRelativity: Conceptual foundations of special and general relativity, including the nature of spacetime, simultaneity, causality, and determinism. Compatibility with quantum mechanics, gravitational singularities, and philosophical implications of cosmology are also investigated.\nStatistical mechanics: Relationship between microscopic and macroscopic descriptions, interpretation of probability, origin of irreversibility and the arrow of time. Foundations of thermodynamics, role of information theory in understanding entropy, and implications for explanation and reduction in physics.\nOther areas of focus include the nature of physical laws, symmetries, and conservation principles; the role of mathematics; and philosophical implications of emerging fields like quantum gravity, quantum information, and complex systems. Philosophers of physics have argued that conceptual analysis clarifies foundations, interprets implications, and guides theory development in physics.\n\n\n== Philosophy of space and time ==\n\nThe existence and nature of space and time (or space-time) are central topics in the philosophy of physics. Issues include (1) whether space and time are fundamental or emergent, and (2) how space and time are operationally different from one another.\n\n\n=== Time ===\n\nIn classical mechanics, time is taken to be a fundamental quantity (that is, a quantity which cannot be defined in terms of other quantities). However, certain theories such as loop quantum gravity claim that spacetime is emergent. As Carlo Rovelli, one of the founders of loop quantum gravity, has said: \"No more fields on spacetime: just fields on fields\". Time is defined via measurement—by its standard time interval. Currently, the standard time interval (called \"conventional second\", or simply \"second\") is defined as 9,192,631,770 oscillations of a hyperfine transition in the 133 caesium atom. (ISO 31-1). What time is and how it works follows from the above definition. Time then can be combined mathematically with the fundamental quantities of space and mass to define concepts such as velocity, momentum, energy, and fields.\nBoth Isaac Newton and Galileo Galilei, as well as most people up until the 20th century, thought that time was the same for everyone everywhere. The modern conception of time is based on Albert Einstein's theory of relativity and Hermann Minkowski's spacetime, in which rates of time run differently in different inertial frames of reference, and space and time are merged into spacetime. Einstein's general relativity as well as the redshift of the light from receding distant galaxies indicate that the entire Universe and possibly space-time itself began about 13.8 billion years ago in the Big Bang. Einstein's theory of special relativity mostly (though not universally) made theories of time where there is something metaphysically special about the present seem much less plausible, as the reference-frame-dependence of time seems to not allow the idea of a privileged present moment.\n\n\n=== Space ===\n\nSpace is one of the few fundamental quantities in physics, meaning that it cannot be defined via other quantities because there is nothing more fundamental known at present. Thus, similar to the definition of other fundamental quantities (like time and mass), space is defined via measurement. Currently, the standard space interval, called a standard metre or simply metre, is defined as the distance traveled by light in a vacuum during a time interval of 1/299792458 of a second (exact).\nIn classical physics, space is a three-dimensional Euclidean space where any position can be described using three coordinates and parameterised by time.  Special and general relativity use four-dimensional spacetime rather than three-dimensional space; and currently there are many speculative theories which use more than four spatial dimensions.\n\n\n== Philosophy of quantum mechanics ==\n\nQuantum mechanics is a large focus of contemporary philosophy of physics, specifically concerning the correct interpretation of quantum mechanics. Very broadly, much of the philosophical work that is done in quantum theory is trying to make sense of superposition states: the property that particles seem to not just be in one determinate position at one time, but are somewhere 'here', and also 'there' at the same time. Such a radical view turns many common sense metaphysical ideas on their head. Much of contemporary philosophy of quantum mechanics aims to make sense of what the very empirically successful formalism of quantum mechanics tells us about the physical world.\n\n\n=== Uncertainty principle ===\n\nThe uncertainty principle is a mathematical relation asserting an upper limit to the accuracy of the simultaneous measurement of any pair of conjugate variables, e.g. position and momentum. In the formalism of operator notation, this limit is the evaluation of the commutator of the variables' corresponding operators.\nThe uncertainty principle arose as an answer to the question: How does one measure the location of an electron around a nucleus if an electron is a wave?  When quantum mechanics was developed, it was seen to be a relation between the classical and quantum descriptions of a system using wave mechanics.\n\n\n=== \"Locality\" and hidden variables ===\n\nBell's theorem is a term encompassing a number of closely related results in physics, all of which determine that quantum mechanics is incompatible with local hidden-variable theories given some basic assumptions about the nature of measurement. \"Local\" here refers to the principle of locality, the idea that a particle can only be influenced by its immediate surroundings, and that interactions mediated by physical fields cannot propagate faster than the speed of light. \"Hidden variables\" are putative properties of quantum particles that are not included in the theory but nevertheless affect the outcome of experiments. In the words of physicist John Stewart Bell, for whom this family of results is named, \"If [a hidden-variable theory] is local it will not agree with quantum mechanics, and if it agrees with quantum mechanics it will not be local.\"\nThe term is broadly applied to a number of different derivations, the first of which was introduced by Bell in a 1964 paper titled \"On the Einstein Podolsky Rosen Paradox\". Bell's paper was a response to a 1935 thought experiment that Albert Einstein, Boris Podolsky and Nathan Rosen proposed, arguing that quantum physics is an \"incomplete\" theory. By 1935, it was already recognized that the predictions of quantum physics are probabilistic. Einstein, Podolsky and Rosen presented a scenario that involves preparing a pair of particles such that the quantum state of the pair is entangled, and then separating the particles to an arbitrarily large distance. The experimenter has a choice of possible measurements that can be performed on one of the particles. When they choose a measurement and obtain a result, the quantum state of the other particle apparently collapses instantaneously into a new state depending upon that result, no matter how far away the other particle is.  This suggests that either the measurement of the first particle somehow also influenced the second particle faster than the speed of light, or that the entangled particles had some unmeasured property which pre-determined their final quantum states before they were separated.  Therefore, assuming locality, quantum mechanics must be incomplete, as it cannot give a complete description of the particle's true physical characteristics. In other words, quantum particles, like electrons and photons, must carry some property or attributes not included in quantum theory, and the uncertainties in quantum theory's predictions would then be due to ignorance or unknowability of these properties, later termed \"hidden variables\".\nBell carried the analysis of quantum entanglement much further. He deduced that if measurements are performed independently on the two separated particles of an entangled pair, then the assumption that the outcomes depend upon hidden variables within each half implies a mathematical constraint on how the outcomes on the two measurements are correlated. This constraint would later be named the Bell inequality. Bell then showed that quantum physics predicts correlations that violate this inequality. Consequently, the only way that hidden variables could explain the predictions of quantum physics is if they are \"nonlocal\", which is to say that somehow the two particles can carry non-classical correlations no matter how widely they ever become separated.\nMultiple variations on Bell's theorem were put forward in the following years, introducing other closely related conditions generally known as Bell (or \"Bell-type\") inequalities. The first rudimentary experiment designed to test Bell's theorem was performed in 1972 by John Clauser and Stuart Freedman. More advanced experiments, known collectively as Bell tests, have been performed many times since. To date, Bell tests have consistently found that physical systems obey quantum mechanics and violate Bell inequalities; which is to say that the results of these experiments are incompatible with any local hidden variable theory.\nThe exact nature of the assumptions required to prove a Bell-type constraint on correlations has been debated by physicists and by philosophers. While the significance of Bell's theorem is not in doubt, its full implications for the interpretation of quantum mechanics remain unresolved.\n\n\n=== Interpretations of quantum mechanics ===\n\nIn March 1927, working in Niels Bohr's institute, Werner Heisenberg formulated the principle of uncertainty thereby laying the foundation of what became known as the Copenhagen interpretation of quantum mechanics. Heisenberg had been studying the papers of Paul Dirac and Pascual Jordan.  He discovered a problem with measurement of basic variables in the equations. His analysis showed that uncertainties, or imprecisions, always turned up if one tried to measure the position and the momentum of a particle at the same time. Heisenberg concluded that these uncertainties or imprecisions in the measurements were not the fault of the experimenter, but fundamental in nature and are inherent mathematical properties of operators in quantum mechanics arising from definitions of these operators.\nThe Copenhagen interpretation is somewhat loosely defined, as many physicists and philosophers of physics have advanced similar but not identical views of quantum mechanics. It is principally associated with Heisenberg and Bohr, despite their philosophical differences. Features common to Copenhagen-type interpretations include the idea that quantum mechanics is intrinsically indeterministic, with probabilities calculated using the Born rule, and the principle of complementarity, which states that objects have certain pairs of complementary properties that cannot all be observed or measured simultaneously. Moreover, the act of \"observing\" or \"measuring\" an object is irreversible, and no truth can be attributed to an object, except according to the results of its measurement. Copenhagen-type interpretations hold that quantum descriptions are objective, in that they are independent of any arbitrary factors in the physicist's mind.: 85–90 \nThe many-worlds interpretation of quantum mechanics by Hugh Everett III claims that the wave-function of a quantum system is telling us claims about the reality of that physical system. It denies wavefunction collapse, and claims that superposition states should be interpreted literally as describing the reality of many-worlds where objects are located, and not simply indicating the indeterminacy of those variables. This is sometimes argued as a corollary of scientific realism, which states that scientific theories aim to give us literally true descriptions of the world.\nOne issue for the Everett interpretation is the role that probability plays on this account. The Everettian account is completely deterministic, whereas probability seems to play an ineliminable role in quantum mechanics. Contemporary Everettians have argued that one can get an account of probability that follows the Born rule through certain decision-theoretic proofs, but there is as yet no consensus about whether any of these proofs are successful.\nPhysicist Roland Omnès noted that it is impossible to experimentally differentiate between Everett's view, which says that as the wave-function decoheres into distinct worlds, each of which exists equally, and the more traditional view that says that a decoherent wave-function leaves only one unique real result. Hence, the dispute between the two views represents a great \"chasm\". \"Every characteristic of reality has reappeared in its reconstruction by our theoretical model; every feature except one: the uniqueness of facts.\"\n\n\n== Philosophy of thermal and statistical physics ==\nThe philosophy of thermal and statistical physics is concerned with the foundational issues and conceptual implications of thermodynamics and statistical mechanics. These branches of physics deal with the macroscopic behavior of systems comprising a large number of microscopic entities, such as particles, and the nature of laws that emerge from these systems like irreversibility and entropy. Interest of philosophers in statistical mechanics first arose from the observation of an apparent conflict between the time-reversal symmetry of fundamental physical laws and the irreversibility observed in thermodynamic processes, known as the arrow of time problem. Philosophers have sought to understand how the asymmetric behavior of macroscopic systems, such as the tendency of heat to flow from hot to cold bodies, can be reconciled with the time-symmetric laws governing the motion of individual particles.\nAnother key issue is the interpretation of probability in statistical mechanics, which is primarily concerned with the question of whether probabilities in statistical mechanics are epistemic, reflecting our lack of knowledge about the precise microstate of a system, or ontic, representing an objective feature of the physical world. The epistemic interpretation, also known as the subjective or Bayesian view, holds that probabilities in statistical mechanics are a measure of our ignorance about the exact state of a system. According to this view, we resort to probabilistic descriptions only due to the practical impossibility of knowing the precise properties of all its micro-constituents, like the positions and momenta of particles. As such, the probabilities are not objective features of the world but rather arise from our ignorance. In contrast, the ontic interpretation, also called the objective or frequentist view, asserts that probabilities in statistical mechanics are real, physical properties of the system itself. Proponents of this view argue that the probabilistic nature of statistical mechanics is not merely a reflection of our ignorance but an intrinsic feature of the physical world, and that even if we had complete knowledge of the microstate of a system, the macroscopic behavior would still be best described by probabilistic laws.\n\n\n== History ==\n\n\n=== Aristotelian physics ===\n\nAristotelian physics viewed the universe as a sphere with a center. Matter, composed of the classical elements: earth, water, air, and fire; sought to go down towards the center of the universe, the center of the Earth, or up, away from it. Things in the aether such as the Moon, the Sun, planets, or stars circled the center of the universe. Movement is defined as change in place, i.e. space.\n\n\n=== Newtonian physics ===\nThe implicit axioms of Aristotelian physics with respect to movement of matter in space were superseded in Newtonian physics by Newton's first law of motion.Every body perseveres in its state either of rest or of uniform motion in a straight line, except insofar as it is compelled to change its state by impressed forces.\n\"Every body\" includes the Moon, and an apple; and includes all types of matter, air as well as water, stones, or even a flame. Nothing has a natural or inherent motion. Absolute space being three-dimensional Euclidean space, infinite and without a center. Being \"at rest\" means being at the same place in absolute space over time. The topology and affine structure of space must permit movement in a straight line at a uniform velocity; thus both space and time must have definite, stable dimensions.\n\n\n=== Leibniz ===\nGottfried Wilhelm Leibniz, 1646–1716, was a contemporary of Newton. He contributed a fair amount to the statics and dynamics emerging around him, often disagreeing with Descartes and Newton. He devised a new theory of motion (dynamics) based on kinetic energy and potential energy, which posited space as relative, whereas Newton was thoroughly convinced that space was absolute. An important example of Leibniz's mature physical thinking is his Specimen Dynamicum of 1695.\nUntil the discovery of subatomic particles and the quantum mechanics governing them, many of Leibniz's speculative ideas about aspects of nature not reducible to statics and dynamics made little sense.\nHe anticipated Albert Einstein by arguing, against Newton, that space, time and motion are relative, not absolute: \"As for my own opinion, I have said more than once, that I hold space to be something merely relative, as time is, that I hold it to be an order of coexistences, as time is an order of successions.\"\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nDavid Albert, 1994. Quantum Mechanics and Experience. Harvard Univ. Press.\nJohn D. Barrow and Frank J. Tipler, 1986. The Cosmological Anthropic Principle. Oxford Univ. Press.\nBeisbart, C. and S. Hartmann, eds., 2011. \"Probabilities in Physics\". Oxford Univ. Press.\nJohn S. Bell, 2004 (1987), Speakable and Unspeakable in Quantum Mechanics. Cambridge Univ. Press.\nDavid Bohm, 1980. Wholeness and the Implicate Order. Routledge.\nNick Bostrom, 2002. Anthropic Bias: Observation Selection Effects in Science and Philosophy. Routledge.\nThomas Brody, 1993, Ed. by Luis de la Peña and Peter E. Hodgson The Philosophy Behind Physics Springer ISBN 3-540-55914-0\nHarvey Brown, 2005. Physical Relativity. Space-time structure from a dynamical perspective. Oxford Univ. Press.\nButterfield, J., and John Earman, eds., 2007. Philosophy of Physics, Parts A and B. Elsevier.\nCraig Callender and Nick Huggett, 2001. Physics Meets Philosophy at the Planck Scale. Cambridge Univ. Press.\nDavid Deutsch, 1997. The Fabric of Reality. London: The Penguin Press.\nBernard d'Espagnat, 1989. Reality and the Physicist. Cambridge Univ. Press. Trans. of Une incertaine réalité; le monde quantique, la connaissance et la durée.\n--------, 1995. Veiled Reality. Addison-Wesley.\n--------, 2006. On Physics and Philosophy. Princeton Univ. Press.\nRoland Omnès, 1994. The Interpretation of Quantum Mechanics. Princeton Univ. Press.\n--------, 1999. Quantum Philosophy. Princeton Univ. Press.\nHuw Price, 1996. Time's Arrow and Archimedes's Point. Oxford Univ. Press.\nLawrence Sklar, 1992. Philosophy of Physics. Westview Press. ISBN 0-8133-0625-6, ISBN 978-0-8133-0625-4\nVictor Stenger, 2000. Timeless Reality. Prometheus Books.\nCarl Friedrich von Weizsäcker, 1980. The Unity of Nature. Farrar Straus & Giroux.\nWerner Heisenberg, 1971. Physics and Beyond: Encounters and Conversations. Harper & Row (World Perspectives series), 1971.\nWilliam Berkson, 1974. Fields of Force. Routledge and Kegan Paul, London. ISBN 0-7100-7626-6\nEncyclopædia Britannica, Philosophy of Physics, David Z. Albert\n\n\n== External links ==\n\nStanford Encyclopedia of Philosophy:\n\"Absolute and Relational Theories of Space and Motion\"—Nick Huggett and Carl Hoefer\n\"Being and Becoming in Modern Physics\"—Steven Savitt\n\"Boltzmann's Work in Statistical Physics\"—Jos Uffink\n\"Conventionality of Simultaneity\"—Allen Janis\n\"Early Philosophical Interpretations of General Relativity\"—Thomas A. Ryckman\n\"Everett's Relative-State Formulation of Quantum Mechanics\"—Jeffrey A. Barrett\n\"Experiments in Physics\"—Allan Franklin\n\"Holism and Nonseparability in Physics\"—Richard Healey\n\"Intertheory Relations in Physics\"—Robert Batterman\n\"Naturalism\"—David Papineau\n\"Philosophy of Statistical Mechanics\"—Lawrence Sklar\n\"Physicalism\"—Daniel Sojkal\n\"Quantum Mechanics\"—Jenann Ismael\n\"Reichenbach's Common Cause Principle\"—Frank Artzenius\n\"Structural Realism\"—James Ladyman\n\"Structuralism in Physics\"—Heinz-Juergen Schmidt\n\"Supertasks\"—JB Manchak and Bryan Roberts\n\"Symmetry and Symmetry Breaking\"—Katherine Brading and Elena Castellani\n\"Thermodynamic Asymmetry in Time\"—Craig Callender\n\"Time\"—by Ned Markosian\n\"Time Machines\" —John Earman, Chris Wüthrich, and JB Manchak\n\"Uncertainty principle\"—Jan Hilgevoord and Jos Uffink\n\"The Unity of Science\"—Jordi Cat",
  "links": {
    "A-theory of time": "",
    "A priori and a posteriori": "",
    "A series and B series": "",
    "Abhidharma": "",
    "Absolute idealism": "",
    "Absolute theory": "",
    "Absolute time and space": "",
    "Academic Skepticism": "",
    "Achintya Bheda Abheda": "",
    "Acoustics": ""
  },
  "url": "https://en.wikipedia.org/wiki/Philosophy_of_physics"
}