{
  "title": "Poet",
  "content": "A poet is a person who studies and creates poetry. Poets may describe themselves as such or be described as such by others. A poet may simply be the creator (thinker, songwriter, writer, or author) who creates (composes) poems (oral or written), or they may also perform their art to an audience.\nThe work of a poet is essentially one of communication, expressing ideas either in a literal sense (such as communicating about a specific event or place) or metaphorically. Poets have existed since prehistory, in nearly all languages, and have produced works that vary greatly in different cultures and periods. Throughout each civilization and language, poets have used various styles that have changed over time, resulting in countless poets as diverse as the literature that (since the advent of writing systems) they have produced.\n\n\n== History ==\n\n\n=== Ancient poets ===\n\nThe civilization of Sumer figures prominently in the history of early poetry, and The Epic of Gilgamesh, a widely read epic poem, was written in the Third Dynasty of Ur c. 2100 BC; copies of the poem continued to be published and written until c. 600 to 150 BC. However, as it arises from an oral tradition, the poet is unknown.\nThe Story of Sinuhe was a popular narrative poem from the Middle Kingdom of Egypt, written c. 1750 BC, about an ancient Egyptian man named Sinuhe, who flees his country and lives in a foreign land until his return, shortly before his death. The Story of Sinuhe was one of several popular narrative poems in Ancient Egyptian. Scholars have conjectured that Story of Sinuhe was actually written by an Ancient Egyptian man named Sinuhe, describing his life in the poem; therefore, Sinuhe is conjectured to be a real person. \nIn Ancient Rome, professional poets were generally sponsored by patrons, including nobility and military officials. For instance, Gaius Cilnius Maecenas, friend to Caesar Augustus, was an important patron for the Augustan poets, including both Horace and Virgil. Ovid, a well established poet, was banished from Rome by the first Augustus for one of his poems. \n\n\n=== Western poets ===\nDuring the High Middle Ages, troubadors were an important class of poets. They came from a variety of backgrounds, often living and traveling in many different places and were looked upon as actors or musicians as much as poets. Some were under patronage, but many traveled extensively. \nThe Renaissance period saw a continuation of patronage of poets by royalty. Many poets, however, had other sources of income, including \nItalians like Dante Aligheri, Giovanni Boccaccio and Petrarch's works in a pharmacist's guild and William Shakespeare's work in the theater.\nIn the Romantic period and onwards, many poets were independent writers who made their living through their work, often supplemented by income from other occupations or from family. This included poets such as William Wordsworth and Robert Burns.\nPoets such as Virgil in the Aeneid and John Milton in Paradise Lost invoked the aid of a Muse.\n\n\n=== Other poets ===\nPoets held an important position in pre-Islamic Arabic society with the poet or sha'ir filling the role of historian, soothsayer and propagandist. Words in praise of the tribe (qit'ah) and lampoons denigrating other tribes (hija') seem to have been some of the most popular forms of early poetry. The sha'ir represented an individual tribe's prestige and importance in the Arabian Peninsula, and mock battles in poetry or zajal would stand in lieu of real wars. 'Ukaz, a market town not far from Mecca, would play host to a regular poetry festival where the craft of the sha'irs would be exhibited.\n\n\n== Education ==\nPoets of earlier times were often well read and highly educated people while others were to a large extent self-educated. A few poets such as John Gower and John Milton were able to write poetry in more than one language. Some Portuguese poets, as Francisco de Sá de Miranda, wrote not only in Portuguese but also in Spanish. Jan Kochanowski wrote in Polish and in Latin, France Prešeren and Karel Hynek Mácha wrote some poems in German, although they were poets of Slovenian and Czech respectively. Adam Mickiewicz, the greatest poet of Polish language, wrote a Latin ode for emperor Napoleon III. Another example is Jerzy Pietrkiewicz, a Polish poet. When he moved to Great Britain, he ceased to write poetry in Polish, but started writing a novel in English. He also translated poetry  into English.\nMany universities offer degrees in creative writing though these only came into existence in the 20th century. While these courses are not necessary for a career as a poet, they can be helpful as training, and for giving the student several years of time focused on their writing.\n\n\n== Poets of sacred verse ==\n\nLyrical poets who write sacred poetry (\"hymnographers\") differ from the usual image of poets in a number of ways. A hymnographer such as Isaac Watts who wrote 700 poems in his lifetime, may have their lyrics sung by millions of people every Sunday morning, but are not always included in anthologies of poetry. Because hymns are perceived of as \"worship\" rather than \"poetry\", the term \"artistic kenosis\" is sometimes used to describe the hymnographer's success in \"emptying out\" the instinct to succeed as a poet. A singer in the pew might have several of Watts's stanzas memorized, without ever knowing his name or thinking of him as a poet.\n\n\n== See also ==\nList of poets\nBard\nLyricist\nList of poetry groups and movements\n\n\n== References ==\n\n\n== Further reading ==\n\nReginald Gibbons (ed), The Poet's Work: 29 poets on the origins and practice of their art. University of Chicago Press (1979). ISBN 978-0-226-29054-6 at Google Books",
  "links": {
    "Academic publishing": "",
    "Action fiction": "",
    "Adam Mickiewicz": "",
    "Adventure fiction": "",
    "Aeneid": "",
    "Ancient Egypt": "",
    "Ancient Rome": "",
    "Ancient literature": "",
    "Anecdote": "",
    "Anthology": ""
  },
  "url": "https://en.wikipedia.org/wiki/Poet"
}