{
  "title": "Pranayama",
  "content": "Pranayama (Sanskrit: प्राणायाम, \"Prāṇāyāma\") is the yogic practice of focusing on breath. In yoga, the breath is associated with prana, thus, pranayama is a means to elevate the prana-shakti, or life energies. Pranayama is described in Hindu texts such as the Bhagavad Gita and the Yoga Sutras of Patanjali. Later, in Hatha yoga texts, it meant the complete suspension of breathing. The pranayama practices in modern yoga as exercise differ from those of the Hatha yoga tradition.\n\n\n== Etymology ==\nPrāṇāyāma (Devanagari: प्राणायाम prāṇāyāma) is a Sanskrit compound. It is defined variously by different authors.\nMacdonell gives the etymology as prana (prāṇa), breath, + āyāma and defines it as the suspension of breath.\n\nMonier-Williams defines the compound prāṇāyāma as \"of the three 'breath-exercises' performed during Saṃdhyā (See pūrak, rechak (English: retch or throw out), kumbhak\".  This technical definition refers to a particular system of breath control with three processes as explained by Bhattacharyya: pūrak (to take the breath inside), kumbhak (to retain it), and rechak (to discharge it). There are other processes of prāṇāyāma besides this three-step model.\nV. S. Apte's definition of āyāmaḥ derives it from ā + yām and provides several variant meanings for it when used in compounds.  The first three meanings have to do with \"length\", \"expansion, extension\", and \"stretching, extending\", but in the specific case of use in the compound prāṇāyāma he defines āyāmaḥ as meaning \"restrain, control, stopping\".\nRamamurti Mishra gives the definition:\n\nExpansion of individual energy into cosmic energy is called prāṇāyāma (prāṇa, energy + ayām, expansion).\n\n\n== Hinduism ==\n\n\n=== Bhagavad Gītā ===\nPranayama is mentioned in verse 4.29 of the Bhagavad Gītā, which states \"Still others, who are inclined to the process of breath restraint to remain in trance, practice by offering the movement of the outgoing breath into the incoming, and the incoming breath into the outgoing, and thus at last remain in trance, stopping all breathing. Others, curtailing the eating process, offer the outgoing breath into itself as a sacrifice.\"\n\n\n=== Yoga Sutras of Patanjali ===\nPranayama is the fourth \"limb\" of the eight limbs of Ashtanga Yoga, as mentioned in verse 2.29 of the Yoga Sutras of Patanjali. Patanjali, a Rishi, discusses his specific approach to pranayama in verses 2.49 through 2.51, and devotes verses 2.52 and 2.53 to explaining the benefits of the practice. Patanjali does not fully elucidate the nature of prana, and the theory and practice of pranayama seem to have undergone significant development after him.\nIn verse 1.34, pranayama is introduced as a method aimed at stabilizing the mind. The practice involves two primary techniques: exhalation, known as pracchardana, which entails expelling air from the stomach through the nostrils, and retention, known as vidharana, which focuses on the controlled restraint of breath. Pranayama supports advanced practitioners in gaining control over the mind and complements meditation, aiding in achieving a light body and steady mind by regulating breath.\nYoga teachers including B. K. S. Iyengar have advised that pranayama should be part of an overall practice that includes the other limbs of Patanjali's Raja Yoga teachings, especially Yama, Niyama, and Asana.\n\n\n=== Hatha yoga ===\nThe Indian tradition of Hatha yoga makes use of various pranayama techniques. The 15th century Hatha Yoga Pradipika is a key text of this tradition and includes various forms of pranayama such as Kumbhaka breath retention and various body locks (Bandhas). Other forms of pranayama breathing include the alternate nostril breathing of Nadi Shodhana, Ujjayi breath (\"Victorious Breath\"), Sitali (breathing through the rolled tongue), Bhastrika (\"Bellows Breath\"), Kapalabhati (\"Skull-shining Breath\", a Shatkarma purification), Surya Bhedana (\"Sun-piercing Breath\"), and the soothing Bhramari (buzzing like a bee).\nB. K. S. Iyengar cautions that pranayama should only be undertaken when one has a firmly established yoga practice and then only under the guidance of an experienced Guru.\nAccording to Theos Bernard, the ultimate aim of pranayama is the suspension of breathing (kevala kumbhaka), \"causing the mind to swoon\". Paramahansa Yogananda writes, \"The real meaning of Pranayama, according to Patanjali, the founder of Yoga philosophy, is the gradual cessation of breathing, the discontinuance of inhalation and exhalation\".\n\n\n=== Yoga as exercise ===\nThe yoga scholar Andrea Jain states that pranayama was \"marginal to the most widely cited sources\" before the 20th century, and that the breathing practices were \"dramatically\" unlike the modern ones. She writes that while pranayama in modern yoga as exercise consists of synchronising the breath with movements (between asanas), in texts like the Bhagavad Gita and the Yoga Sutras of Patanjali, pranayama meant \"complete cessation of breathing\", for which she cites Bronkhorst 2007.\n\n\n== Buddhism ==\nAccording to the Pali Buddhist Canon, the Buddha, prior to his enlightenment, practiced a meditative technique involving pressing the palate with the tongue and forcibly attempting to restraining the breath. This is described as both extremely painful and not conducive to enlightenment.  In some Buddhist teachings or metaphors, breathing is said to stop with the fourth jhana, though this is a side effect of the technique and does not result from purposeful effort.\nThe Buddha did incorporate moderate modulation of the length of breath as part of the preliminary tetrad in the Anapanasati Sutta. Its use there is preparation for concentration. According to commentarial literature, this is appropriate for beginners.\n\n\n=== Indo-Tibetan tradition ===\nLater Indo-Tibetan developments in Buddhist pranayama which are similar to Hindu forms can be seen as early as the 11th century, in the Buddhist text titled the Amṛtasiddhi, which teaches three bandhas in connection with yogic breathing (kumbakha).\nTibetan Buddhist breathing exercises such as the \"nine breathings of purification\" or the \"Ninefold Expulsion of Stale Vital Energy\" (rlung ro dgu shrugs), a form of alternate nostril breathing, commonly include visualizations. In the Nyingma tradition of Dzogchen these practices are collected in the textual cycle known as \"The Oral Transmission of Vairotsana\" (Vai ro snyan brgyud).\n\n\n== Effects ==\nYoga has positive effects on blood pressure, heart rate variability, and baroreflex sensitivity. In a systematic review of yoga breathing exercises and blood pressure, a moderate but statistically significant beneficial effect was found. A meta-analysis of \"voluntary slow breathing\", heart rate, and heart rate variability found that such breathing leads to an increase in the parasympathetic nervous control of the heart, and notes \"By considering the importance of the parasympathetic nervous system for health-related issues, stimulating non-invasively the vagus nerve represents a valid target.\"\n\n\n== See also ==\nComplete breathing\nPranahuti\nXingqi (circulating breath)\n\n\n== References ==\n\n\n== Sources ==\nBhattacharyya, Narendra Nath (1999). History of the Tantric Religion (Second ed.). Delhi: Manohar Publications. ISBN 81-7304-025-7.\nBryant, Edwin F. (2009). The Yoga Sūtras of Patañjali: A New Edition, Translation and Commentary. New York: North Point Press. ISBN 978-0865477360.\nFlood, Gavin D. (1996). An Introduction to Hinduism. Cambridge University Press.\nMacdonell, Arthur Anthony (1996). A Practical Sanskrit Dictionary. Munshiram Monoharlal Publishers. ISBN 81-215-0715-4.\nMishra, Ramamurti. Fundamentals of Yoga. Baba Bhagavandas Publication Trust.\nTaimni, I. K. (1961). The Science of Yoga (Eighth Reprint, 1993 ed.). Adyar, India: The Theosophical Publishing House. ISBN 81-7059-212-7.\nZaccaro, Andrea et al. (2018). How Breath-Control Can Change Your Life: A Systematic Review on Psycho-Physiological Correlates of Slow Breathing. Frontiers in Human Neuroscience.",
  "links": {
    "14th Dalai Lama": "",
    "5Rhythms": "",
    "A. G. Mohan": "",
    "A History of Modern Yoga": "",
    "Accessible yoga": "",
    "Acroyoga": "",
    "Aerial yoga": "",
    "Aghor Yoga": "",
    "Amaraugha Prabodha": "",
    "Amrit Desai": ""
  },
  "url": "https://en.wikipedia.org/wiki/Pranayama"
}