{
  "title": "Mathematical induction",
  "content": "Mathematical induction is a method for proving that a statement \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n is true for every natural number \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n, that is, that the infinitely many cases \n  \n    \n      \n        P\n        (\n        0\n        )\n        ,\n        P\n        (\n        1\n        )\n        ,\n        P\n        (\n        2\n        )\n        ,\n        P\n        (\n        3\n        )\n        ,\n        …\n      \n    \n    {\\displaystyle P(0),P(1),P(2),P(3),\\dots }\n  \n  all hold. This is done by first proving a simple case, then also showing that if we assume the claim is true for a given case, then the next case is also true. Informal metaphors help to explain this technique, such as falling dominoes or climbing a ladder:\n\nMathematical induction proves that we can climb as high as we like on a ladder, by proving that we can climb onto the bottom rung (the basis) and that from each rung we can climb up to the next one (the step).\nA proof by induction consists of two cases. The first, the base case, proves the statement for \n  \n    \n      \n        n\n        =\n        0\n      \n    \n    {\\displaystyle n=0}\n  \n without assuming any knowledge of other cases. The second case, the induction step, proves that if the statement holds for any given case \n  \n    \n      \n        n\n        =\n        k\n      \n    \n    {\\displaystyle n=k}\n  \n, then it must also hold for the next case \n  \n    \n      \n        n\n        =\n        k\n        +\n        1\n      \n    \n    {\\displaystyle n=k+1}\n  \n. These two steps establish that the statement holds for every natural number \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n. The base case does not necessarily begin with \n  \n    \n      \n        n\n        =\n        0\n      \n    \n    {\\displaystyle n=0}\n  \n, but often with \n  \n    \n      \n        n\n        =\n        1\n      \n    \n    {\\displaystyle n=1}\n  \n, and possibly with any fixed natural number \n  \n    \n      \n        n\n        =\n        N\n      \n    \n    {\\displaystyle n=N}\n  \n, establishing the truth of the statement for all natural numbers \n  \n    \n      \n        n\n        ≥\n        N\n      \n    \n    {\\displaystyle n\\geq N}\n  \n.\nThe method can be extended to prove statements about more general well-founded structures, such as trees; this generalization, known as structural induction, is used in mathematical logic and computer science. Mathematical induction in this extended sense is closely related to recursion. Mathematical induction is an inference rule used in formal proofs, and is the foundation of most correctness proofs for computer programs.\nDespite its name, mathematical induction differs fundamentally from inductive reasoning as used in philosophy, in which the examination of many cases results in a probable conclusion. The mathematical method examines infinitely many cases to prove a general statement, but it does so by a finite chain of deductive reasoning involving the variable \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n, which can take infinitely many values. The result is a rigorous proof of the statement, not an assertion of its probability.\n\n\n== History ==\nIn 370 BC, Plato's Parmenides may have contained traces of an early example of an implicit inductive proof, however, the earliest implicit proof by mathematical induction was written by al-Karaji around 1000 AD, who applied it to arithmetic sequences to prove the binomial theorem and properties of Pascal's triangle. Whilst the original work was lost, it was later referenced by Al-Samawal al-Maghribi in his treatise al-Bahir fi'l-jabr (The Brilliant in Algebra) in around 1150 AD.\n\nKatz says in his history of mathematics Another important idea introduced by al-Karaji and continued by al-Samaw'al and others was that of an inductive argument for dealing with certain arithmetic sequences. Thus al-Karaji used such an argument to prove the result on the sums of integral cubes already known to Aryabhata [...] Al-Karaji did not, however, state a general result for arbitrary n. He stated his theorem for the particular integer 10 [...] His proof, nevertheless, was clearly designed to be extendable to any other integer. [...] Al-Karaji's argument includes in essence the two basic components of a modern argument by induction, namely the truth of the statement for n = 1 (1 = 13) and the deriving of the truth for n = k from that of n = k - 1. Of course, this second component is not explicit since, in some sense, al-Karaji's argument is in reverse; this is, he starts from n = 10 and goes down to 1 rather than proceeding upward. Nevertheless, his argument in al-Fakhri is the earliest extant proof of the sum formula for integral cubes.\nIn India, early implicit proofs by mathematical induction appear in Bhaskara's \"cyclic method\".\nNone of these ancient mathematicians, however, explicitly stated the induction hypothesis. Another similar case (contrary to what Vacca has written, as Freudenthal carefully showed) was that of Francesco Maurolico in his Arithmeticorum libri duo (1575), who used the technique to prove that the sum of the first n odd integers is n2.\nThe earliest rigorous use of induction was by Gersonides (1288–1344). The first explicit formulation of the principle of induction was given by Pascal in his Traité du triangle arithmétique (1665). Another Frenchman, Fermat, made ample use of a related principle: indirect proof by infinite descent.\nThe induction hypothesis was also employed by the Swiss Jakob Bernoulli, and from then on it became well known. The modern formal treatment of the principle came only in the 19th century, with George Boole, Augustus De Morgan, Charles Sanders Peirce, Giuseppe Peano, and Richard Dedekind.\n\n\n== Description ==\nThe simplest and most common form of mathematical induction infers that a statement involving a natural number n (that is, an integer n ≥ 0 or 1) holds for all values of n. The proof consists of two steps:\n\nThe base case (or initial case): prove that the statement holds for 0, or 1.\nThe induction step (or inductive step, or step case): prove that for every n, if the statement holds for n, then it holds for n + 1. In other words, assume that the statement holds for some arbitrary natural number n, and prove that the statement holds for n + 1.\nThe hypothesis in the induction step, that the statement holds for a particular n, is called the induction hypothesis or inductive hypothesis. To prove the induction step, one assumes the induction hypothesis for n and then uses this assumption to prove that the statement holds for n + 1.\nAuthors who prefer to define natural numbers to begin at 0 use that value in the base case; those who define natural numbers to begin at 1 use that value.\n\n\n== Examples ==\n\n\n=== Sum of consecutive natural numbers ===\nMathematical induction can be used to prove the following statement P(n) for all natural numbers n.\n\n  \n    \n      \n        P\n        (\n        n\n        )\n        \n        :\n         \n         \n        0\n        +\n        1\n        +\n        2\n        +\n        ⋯\n        +\n        n\n        =\n        \n          \n            \n              n\n              (\n              n\n              +\n              1\n              )\n            \n            2\n          \n        \n        .\n      \n    \n    {\\displaystyle P(n)\\!:\\ \\ 0+1+2+\\cdots +n={\\frac {n(n+1)}{2}}.}\n  \n\nThis states a general formula for the sum of the natural numbers less than or equal to a given number; in fact an infinite sequence of statements: \n  \n    \n      \n        0\n        =\n        \n          \n            \n              \n                (\n                0\n                )\n                (\n                0\n                +\n                1\n                )\n              \n              2\n            \n          \n        \n      \n    \n    {\\displaystyle 0={\\tfrac {(0)(0+1)}{2}}}\n  \n, \n  \n    \n      \n        0\n        +\n        1\n        =\n        \n          \n            \n              \n                (\n                1\n                )\n                (\n                1\n                +\n                1\n                )\n              \n              2\n            \n          \n        \n      \n    \n    {\\displaystyle 0+1={\\tfrac {(1)(1+1)}{2}}}\n  \n, \n  \n    \n      \n        0\n        +\n        1\n        +\n        2\n        =\n        \n          \n            \n              \n                (\n                2\n                )\n                (\n                2\n                +\n                1\n                )\n              \n              2\n            \n          \n        \n      \n    \n    {\\displaystyle 0+1+2={\\tfrac {(2)(2+1)}{2}}}\n  \n, etc.\nProposition. For every \n  \n    \n      \n        n\n        ∈\n        \n          N\n        \n      \n    \n    {\\displaystyle n\\in \\mathbb {N} }\n  \n, \n  \n    \n      \n        0\n        +\n        1\n        +\n        2\n        +\n        ⋯\n        +\n        n\n        =\n        \n          \n            \n              \n                n\n                (\n                n\n                +\n                1\n                )\n              \n              2\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle 0+1+2+\\cdots +n={\\tfrac {n(n+1)}{2}}.}\n  \n\nProof. Let P(n) be the statement \n  \n    \n      \n        0\n        +\n        1\n        +\n        2\n        +\n        ⋯\n        +\n        n\n        =\n        \n          \n            \n              \n                n\n                (\n                n\n                +\n                1\n                )\n              \n              2\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle 0+1+2+\\cdots +n={\\tfrac {n(n+1)}{2}}.}\n  \n We give a proof by induction on n.\nBase case: Show that the statement holds for the smallest natural number n = 0.\nP(0) is clearly true: \n  \n    \n      \n        0\n        =\n        \n          \n            \n              \n                0\n                (\n                0\n                +\n                1\n                )\n              \n              2\n            \n          \n        \n        \n        .\n      \n    \n    {\\displaystyle 0={\\tfrac {0(0+1)}{2}}\\,.}\n  \n\nInduction step: Show that for every k ≥ 0, if P(k) holds, then P(k + 1) also holds.\nAssume the induction hypothesis that for a particular k, the single case n = k holds, meaning P(k) is true:\n  \n    \n      \n        0\n        +\n        1\n        +\n        ⋯\n        +\n        k\n        =\n        \n          \n            \n              k\n              (\n              k\n              +\n              1\n              )\n            \n            2\n          \n        \n        .\n      \n    \n    {\\displaystyle 0+1+\\cdots +k={\\frac {k(k+1)}{2}}.}\n  \n\nIt follows that:\n\n  \n    \n      \n        (\n        0\n        +\n        1\n        +\n        2\n        +\n        ⋯\n        +\n        k\n        )\n        +\n        (\n        k\n        +\n        1\n        )\n        =\n        \n          \n            \n              k\n              (\n              k\n              +\n              1\n              )\n            \n            2\n          \n        \n        +\n        (\n        k\n        +\n        1\n        )\n        .\n      \n    \n    {\\displaystyle (0+1+2+\\cdots +k)+(k+1)={\\frac {k(k+1)}{2}}+(k+1).}\n  \n\nAlgebraically, the right hand side simplifies as:\n\n  \n    \n      \n        \n          \n            \n              \n                \n                  \n                    \n                      k\n                      (\n                      k\n                      +\n                      1\n                      )\n                    \n                    2\n                  \n                \n                +\n                (\n                k\n                +\n                1\n                )\n              \n              \n                \n                =\n                \n                  \n                    \n                      k\n                      (\n                      k\n                      +\n                      1\n                      )\n                      +\n                      2\n                      (\n                      k\n                      +\n                      1\n                      )\n                    \n                    2\n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  \n                    \n                      (\n                      k\n                      +\n                      1\n                      )\n                      (\n                      k\n                      +\n                      2\n                      )\n                    \n                    2\n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  \n                    \n                      (\n                      k\n                      +\n                      1\n                      )\n                      (\n                      (\n                      k\n                      +\n                      1\n                      )\n                      +\n                      1\n                      )\n                    \n                    2\n                  \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}{\\frac {k(k+1)}{2}}+(k+1)&={\\frac {k(k+1)+2(k+1)}{2}}\\\\&={\\frac {(k+1)(k+2)}{2}}\\\\&={\\frac {(k+1)((k+1)+1)}{2}}.\\end{aligned}}}\n  \n\nEquating the extreme left hand and right hand sides, we deduce that:\n  \n    \n      \n        0\n        +\n        1\n        +\n        2\n        +\n        ⋯\n        +\n        k\n        +\n        (\n        k\n        +\n        1\n        )\n        =\n        \n          \n            \n              (\n              k\n              +\n              1\n              )\n              (\n              (\n              k\n              +\n              1\n              )\n              +\n              1\n              )\n            \n            2\n          \n        \n        .\n      \n    \n    {\\displaystyle 0+1+2+\\cdots +k+(k+1)={\\frac {(k+1)((k+1)+1)}{2}}.}\n  \n That is, the statement P(k + 1) also holds true, establishing the induction step.\nConclusion: Since both the base case and the induction step have been proved as true, by mathematical induction the statement P(n) holds for every natural number n. Q.E.D.\n\n\n=== A trigonometric inequality ===\nInduction is often used to prove inequalities. As an example, we prove that \n  \n    \n      \n        \n          |\n          \n            sin\n            ⁡\n            n\n            x\n          \n          |\n        \n        ≤\n        n\n        \n          |\n          \n            sin\n            ⁡\n            x\n          \n          |\n        \n      \n    \n    {\\displaystyle \\left|\\sin nx\\right|\\leq n\\left|\\sin x\\right|}\n  \n for any real number \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n  \n and natural number \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n.\nAt first glance, it may appear that a more general version, \n  \n    \n      \n        \n          |\n          \n            sin\n            ⁡\n            n\n            x\n          \n          |\n        \n        ≤\n        n\n        \n          |\n          \n            sin\n            ⁡\n            x\n          \n          |\n        \n      \n    \n    {\\displaystyle \\left|\\sin nx\\right|\\leq n\\left|\\sin x\\right|}\n  \n for any real numbers \n  \n    \n      \n        n\n        ,\n        x\n      \n    \n    {\\displaystyle n,x}\n  \n, could be proven without induction; but the case \n  \n    \n      \n        n\n        =\n        \n          \n            1\n            2\n          \n        \n        ,\n        \n        x\n        =\n        π\n      \n    \n    {\\textstyle n={\\frac {1}{2}},\\,x=\\pi }\n  \n shows it may be false for non-integer values of \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n. This suggests we examine the statement specifically for natural values of \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n, and induction is the readiest tool.\nProposition. For any \n  \n    \n      \n        x\n        ∈\n        \n          R\n        \n      \n    \n    {\\displaystyle x\\in \\mathbb {R} }\n  \n and \n  \n    \n      \n        n\n        ∈\n        \n          N\n        \n      \n    \n    {\\displaystyle n\\in \\mathbb {N} }\n  \n, \n  \n    \n      \n        \n          |\n          \n            sin\n            ⁡\n            n\n            x\n          \n          |\n        \n        ≤\n        n\n        \n          |\n          \n            sin\n            ⁡\n            x\n          \n          |\n        \n      \n    \n    {\\displaystyle \\left|\\sin nx\\right|\\leq n\\left|\\sin x\\right|}\n  \n.\nProof. Fix an arbitrary real number \n  \n    \n      \n        x\n      \n    \n    {\\displaystyle x}\n  \n, and let \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n be the statement \n  \n    \n      \n        \n          |\n          \n            sin\n            ⁡\n            n\n            x\n          \n          |\n        \n        ≤\n        n\n        \n          |\n          \n            sin\n            ⁡\n            x\n          \n          |\n        \n      \n    \n    {\\displaystyle \\left|\\sin nx\\right|\\leq n\\left|\\sin x\\right|}\n  \n. We induce on \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n.\nBase case: The calculation \n  \n    \n      \n        \n          |\n          \n            sin\n            ⁡\n            0\n            x\n          \n          |\n        \n        =\n        0\n        ≤\n        0\n        =\n        0\n        \n          |\n          \n            sin\n            ⁡\n            x\n          \n          |\n        \n      \n    \n    {\\displaystyle \\left|\\sin 0x\\right|=0\\leq 0=0\\left|\\sin x\\right|}\n  \n verifies \n  \n    \n      \n        P\n        (\n        0\n        )\n      \n    \n    {\\displaystyle P(0)}\n  \n.\nInduction step: We show the implication \n  \n    \n      \n        P\n        (\n        k\n        )\n        \n        ⟹\n        \n        P\n        (\n        k\n        +\n        1\n        )\n      \n    \n    {\\displaystyle P(k)\\implies P(k+1)}\n  \n for any natural number \n  \n    \n      \n        k\n      \n    \n    {\\displaystyle k}\n  \n. Assume the induction hypothesis: for a given value \n  \n    \n      \n        n\n        =\n        k\n        ≥\n        0\n      \n    \n    {\\displaystyle n=k\\geq 0}\n  \n, the single case \n  \n    \n      \n        P\n        (\n        k\n        )\n      \n    \n    {\\displaystyle P(k)}\n  \n is true. Using the angle addition formula and the triangle inequality, we deduce:\n\n  \n    \n      \n        \n          \n            \n              \n                \n                  |\n                  \n                    sin\n                    ⁡\n                    (\n                    k\n                    +\n                    1\n                    )\n                    x\n                  \n                  |\n                \n              \n              \n                \n                =\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    k\n                    x\n                    cos\n                    ⁡\n                    x\n                    +\n                    sin\n                    ⁡\n                    x\n                    cos\n                    ⁡\n                    k\n                    x\n                  \n                  |\n                \n              \n              \n              \n                \n                  (angle addition)\n                \n              \n            \n            \n              \n              \n                \n                ≤\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    k\n                    x\n                    cos\n                    ⁡\n                    x\n                  \n                  |\n                \n                +\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    x\n                    \n                    cos\n                    ⁡\n                    k\n                    x\n                  \n                  |\n                \n              \n              \n              \n                \n                  (triangle inequality)\n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    k\n                    x\n                  \n                  |\n                \n                \n                  |\n                  \n                    cos\n                    ⁡\n                    x\n                  \n                  |\n                \n                +\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    x\n                  \n                  |\n                \n                \n                  |\n                  \n                    cos\n                    ⁡\n                    k\n                    x\n                  \n                  |\n                \n              \n            \n            \n              \n              \n                \n                ≤\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    k\n                    x\n                  \n                  |\n                \n                +\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    x\n                  \n                  |\n                \n              \n              \n              \n                \n                (\n                \n                  |\n                  \n                    cos\n                    ⁡\n                    t\n                  \n                  |\n                \n                ≤\n                1\n                )\n              \n            \n            \n              \n              \n                \n                ≤\n                k\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    x\n                  \n                  |\n                \n                +\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    x\n                  \n                  |\n                \n              \n              \n              \n                \n                  (induction hypothesis\n                \n                )\n              \n            \n            \n              \n              \n                \n                =\n                (\n                k\n                +\n                1\n                )\n                \n                  |\n                  \n                    sin\n                    ⁡\n                    x\n                  \n                  |\n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\left|\\sin(k+1)x\\right|&=\\left|\\sin kx\\cos x+\\sin x\\cos kx\\right|&&{\\text{(angle addition)}}\\\\&\\leq \\left|\\sin kx\\cos x\\right|+\\left|\\sin x\\,\\cos kx\\right|&&{\\text{(triangle inequality)}}\\\\&=\\left|\\sin kx\\right|\\left|\\cos x\\right|+\\left|\\sin x\\right|\\left|\\cos kx\\right|\\\\&\\leq \\left|\\sin kx\\right|+\\left|\\sin x\\right|&&(\\left|\\cos t\\right|\\leq 1)\\\\&\\leq k\\left|\\sin x\\right|+\\left|\\sin x\\right|&&{\\text{(induction hypothesis}})\\\\&=(k+1)\\left|\\sin x\\right|.\\end{aligned}}}\n  \n\nThe inequality between the extreme left-hand and right-hand quantities shows that \n  \n    \n      \n        P\n        (\n        k\n        +\n        1\n        )\n      \n    \n    {\\displaystyle P(k+1)}\n  \n is true, which completes the induction step.\nConclusion: The proposition \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n holds for all natural numbers \n  \n    \n      \n        n\n        .\n      \n    \n    {\\displaystyle n.}\n  \n  Q.E.D.\n\n\n== Variants ==\n\nIn practice, proofs by induction are often structured differently, depending on the exact nature of the property to be proven.\nAll variants of induction are special cases of transfinite induction; see below.\n\n\n=== Base case other than 0 or 1 ===\nIf one wishes to prove a statement, not for all natural numbers, but only for all numbers n greater than or equal to a certain number b, then the proof by induction consists of the following:\n\nShowing that the statement holds when n = b.\nShowing that if the statement holds for an arbitrary number n ≥ b, then the same statement also holds for n + 1.\nThis can be used, for example, to show that 2n ≥ n + 5 for n ≥ 3.\nIn this way, one can prove that some statement P(n) holds for all n ≥ 1, or even for all n ≥ −5. This form of mathematical induction is actually a special case of the previous form, because if the statement to be proved is P(n) then proving it with these two rules is equivalent with proving P(n + b) for all natural numbers n with an induction base case 0.\n\n\n==== Example: forming dollar amounts by coins ====\nAssume an infinite supply of 4- and 5-dollar coins. Induction can be used to prove that any whole amount of dollars greater than or equal to 12 can be formed by a combination of such coins. Let S(k) denote the statement \"k dollars can be formed by a combination of 4- and 5-dollar coins\". The proof that S(k) is true for all k ≥ 12 can then be achieved by induction on k as follows:\nBase case: Showing that S(k) holds for k = 12 is simple: take three 4-dollar coins.\nInduction step: Given that S(k) holds for some value of k ≥ 12 (induction hypothesis), prove that S(k + 1) holds, too. Assume S(k) is true for some arbitrary k ≥ 12. If there is a solution for k dollars that includes at least one 4-dollar coin, replace it by a 5-dollar coin to make k + 1 dollars. Otherwise, if only 5-dollar coins are used, k must be a multiple of 5 and so at least 15; but then we can replace three 5-dollar coins by four 4-dollar coins to make k + 1 dollars. In each case, S(k + 1) is true.\nTherefore, by the principle of induction, S(k) holds for all k ≥ 12, and the proof is complete.\nIn this example, although S(k) also holds for \n  \n    \n      \n        k\n        ∈\n        {\n        4\n        ,\n        5\n        ,\n        8\n        ,\n        9\n        ,\n        10\n        }\n      \n    \n    {\\textstyle k\\in \\{4,5,8,9,10\\}}\n  \n, the above proof cannot be modified to replace the minimum amount of 12 dollar to any lower value m. For m = 11, the base case is actually false; for m = 10, the second case in the induction step (replacing three 5- by four 4-dollar coins) will not work; let alone for even lower m.\n\n\n=== Induction on more than one counter ===\nIt is sometimes desirable to prove a statement involving two natural numbers, n and m, by iterating the induction process. That is, one proves a base case and an induction step for n, and in each of those proves a base case and an induction step for m. See, for example, the proof of commutativity accompanying addition of natural numbers. More complicated arguments involving three or more counters are also possible.\n\n\n=== Infinite descent ===\n\nThe method of infinite descent is a variation of mathematical induction which was used by Pierre de Fermat. It is used to show that some statement Q(n) is false for all natural numbers n. Its traditional form consists of showing that if Q(n) is true for some natural number n, it also holds for some strictly smaller natural number m. Because there are no infinite decreasing sequences of natural numbers, this situation would be impossible, thereby showing (by contradiction) that Q(n) cannot be true for any n.\nThe validity of this method can be verified from the usual principle of mathematical induction. Using mathematical induction on the statement P(n) defined as \"Q(m) is false for all natural numbers m less than or equal to n\", it follows that P(n) holds for all n, which means that Q(n) is false for every natural number n.\n\n\n=== Limited mathematical induction ===\nIf one wishes to prove that a property P holds for all natural numbers less than or equal to n, proving P satisfies the following conditions suffices:\n\nP holds for 0,\nFor any natural number x less than n, if P holds for x, then P holds for x + 1\n\n\n=== Prefix induction ===\nThe most common form of proof by mathematical induction requires proving in the induction step that\n\n  \n    \n      \n        ∀\n        k\n        \n        (\n        P\n        (\n        k\n        )\n        →\n        P\n        (\n        k\n        +\n        1\n        )\n        )\n      \n    \n    {\\displaystyle \\forall k\\,(P(k)\\to P(k+1))}\n  \n\nwhereupon the induction principle \"automates\" n applications of this step in getting from P(0) to P(n). This could be called \"predecessor induction\" because each step proves something about a number from something about that number's predecessor.\nA variant of interest in computational complexity is \"prefix induction\", in which one proves the following statement in the induction step:\n\n  \n    \n      \n        ∀\n        k\n        \n        (\n        P\n        (\n        k\n        )\n        →\n        P\n        (\n        2\n        k\n        )\n        ∧\n        P\n        (\n        2\n        k\n        +\n        1\n        )\n        )\n      \n    \n    {\\displaystyle \\forall k\\,(P(k)\\to P(2k)\\land P(2k+1))}\n  \n\nor equivalently\n\n  \n    \n      \n        ∀\n        k\n        \n        \n          (\n          \n            P\n            \n            \n              (\n              \n                ⌊\n                \n                  \n                    k\n                    2\n                  \n                \n                ⌋\n              \n              )\n            \n            →\n            P\n            (\n            k\n            )\n          \n          )\n        \n      \n    \n    {\\displaystyle \\forall k\\,\\left(P\\!\\left(\\left\\lfloor {\\frac {k}{2}}\\right\\rfloor \\right)\\to P(k)\\right)}\n  \n\nThe induction principle then \"automates\" log2 n applications of this inference in getting from P(0) to P(n). In fact, it is called \"prefix induction\" because each step proves something about a number from something about the \"prefix\" of that number — as formed by truncating the low bit of its binary representation. It can also be viewed as an application of traditional induction on the length of that binary representation.\nIf traditional predecessor induction is interpreted computationally as an n-step loop, then prefix induction would correspond to a log-n-step loop. Because of that, proofs using prefix induction are \"more feasibly constructive\" than proofs using predecessor induction.\nPredecessor induction can trivially simulate prefix induction on the same statement. Prefix induction can simulate predecessor induction, but only at the cost of making the statement more syntactically complex (adding a bounded universal quantifier), so the interesting results relating prefix induction to polynomial-time computation depend on excluding unbounded quantifiers entirely, and limiting the alternation of bounded universal and existential quantifiers allowed in the statement.\nOne can take the idea a step further: one must prove\n\n  \n    \n      \n        ∀\n        k\n        \n        \n          (\n          \n            P\n            \n            \n              (\n              \n                ⌊\n                \n                  \n                    k\n                  \n                \n                ⌋\n              \n              )\n            \n            →\n            P\n            (\n            k\n            )\n          \n          )\n        \n      \n    \n    {\\displaystyle \\forall k\\,\\left(P\\!\\left(\\left\\lfloor {\\sqrt {k}}\\right\\rfloor \\right)\\to P(k)\\right)}\n  \n\nwhereupon the induction principle \"automates\" log log n applications of this inference in getting from P(0) to P(n). This form of induction has been used, analogously, to study log-time parallel computation.\n\n\n=== Complete (strong) induction ===\nAnother variant, called complete induction, course of values induction or strong induction (in contrast to which the basic form of induction is sometimes known as weak induction), makes the induction step easier to prove by using a stronger hypothesis: one proves the statement \n  \n    \n      \n        P\n        (\n        m\n        +\n        1\n        )\n      \n    \n    {\\displaystyle P(m+1)}\n  \n under the assumption that \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n holds for all natural numbers \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n less than \n  \n    \n      \n        m\n        +\n        1\n      \n    \n    {\\displaystyle m+1}\n  \n; by contrast, the basic form only assumes \n  \n    \n      \n        P\n        (\n        m\n        )\n      \n    \n    {\\displaystyle P(m)}\n  \n. The name \"strong induction\" does not mean that this method can prove more than \"weak induction\", but merely refers to the stronger hypothesis used in the induction step.\nIn fact, it can be shown that the two methods are actually equivalent, as explained below. In this form of complete induction, one still has to prove the base case, \n  \n    \n      \n        P\n        (\n        0\n        )\n      \n    \n    {\\displaystyle P(0)}\n  \n, and it may even be necessary to prove extra-base cases such as \n  \n    \n      \n        P\n        (\n        1\n        )\n      \n    \n    {\\displaystyle P(1)}\n  \n before the general argument applies, as in the example below of the Fibonacci number \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle F_{n}}\n  \n.\nAlthough the form just described requires one to prove the base case, this is unnecessary if one can prove \n  \n    \n      \n        P\n        (\n        m\n        )\n      \n    \n    {\\displaystyle P(m)}\n  \n (assuming \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n for all lower \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n) for all \n  \n    \n      \n        m\n        ≥\n        0\n      \n    \n    {\\displaystyle m\\geq 0}\n  \n. This is a special case of transfinite induction as described below, although it is no longer equivalent to ordinary induction. In this form the base case is subsumed by the case \n  \n    \n      \n        m\n        =\n        0\n      \n    \n    {\\displaystyle m=0}\n  \n, where \n  \n    \n      \n        P\n        (\n        0\n        )\n      \n    \n    {\\displaystyle P(0)}\n  \n is proved with no other \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n assumed; this case may need to be handled separately, but sometimes the same argument applies for \n  \n    \n      \n        m\n        =\n        0\n      \n    \n    {\\displaystyle m=0}\n  \n and \n  \n    \n      \n        m\n        >\n        0\n      \n    \n    {\\displaystyle m>0}\n  \n, making the proof simpler and more elegant.\nIn this method, however, it is vital to ensure that the proof of \n  \n    \n      \n        P\n        (\n        m\n        )\n      \n    \n    {\\displaystyle P(m)}\n  \n does not implicitly assume that \n  \n    \n      \n        m\n        >\n        0\n      \n    \n    {\\displaystyle m>0}\n  \n, e.g. by saying \"choose an arbitrary \n  \n    \n      \n        n\n        <\n        m\n      \n    \n    {\\displaystyle n<m}\n  \n\", or by assuming that a set of m elements has an element.\n\n\n==== Equivalence with ordinary induction ====\nComplete induction is equivalent to ordinary mathematical induction as described above, in the sense that a proof by one method can be transformed into a proof by the other. Suppose there is a proof of \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n by complete induction. Then, this proof can be transformed into an ordinary induction proof by assuming a stronger inductive hypothesis. Let \n  \n    \n      \n        Q\n        (\n        n\n        )\n      \n    \n    {\\displaystyle Q(n)}\n  \n be the statement \"\n  \n    \n      \n        P\n        (\n        m\n        )\n      \n    \n    {\\displaystyle P(m)}\n  \n holds for all \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n such that \n  \n    \n      \n        0\n        ≤\n        m\n        ≤\n        n\n      \n    \n    {\\displaystyle 0\\leq m\\leq n}\n  \n\"—this becomes the inductive hypothesis for ordinary induction. We can then show \n  \n    \n      \n        Q\n        (\n        0\n        )\n      \n    \n    {\\displaystyle Q(0)}\n  \n and \n  \n    \n      \n        Q\n        (\n        n\n        +\n        1\n        )\n      \n    \n    {\\displaystyle Q(n+1)}\n  \n for \n  \n    \n      \n        n\n        ∈\n        \n          N\n        \n      \n    \n    {\\displaystyle n\\in \\mathbb {N} }\n  \n assuming only \n  \n    \n      \n        Q\n        (\n        n\n        )\n      \n    \n    {\\displaystyle Q(n)}\n  \n and show that \n  \n    \n      \n        Q\n        (\n        n\n        )\n      \n    \n    {\\displaystyle Q(n)}\n  \n implies \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n.\nIf, on the other hand, \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n had been proven by ordinary induction, the proof would already effectively be one by complete induction: \n  \n    \n      \n        P\n        (\n        0\n        )\n      \n    \n    {\\displaystyle P(0)}\n  \n is proved in the base case, using no assumptions, and \n  \n    \n      \n        P\n        (\n        n\n        +\n        1\n        )\n      \n    \n    {\\displaystyle P(n+1)}\n  \n is proved in the induction step, in which one may assume all earlier cases but need only use the case \n  \n    \n      \n        P\n        (\n        n\n        )\n      \n    \n    {\\displaystyle P(n)}\n  \n.\n\n\n==== Example: Fibonacci numbers ====\nComplete induction is most useful when several instances of the inductive hypothesis are required for each induction step. For example, complete induction can be used to show that\n\n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n        =\n        \n          \n            \n              \n                φ\n                \n                  n\n                \n              \n              −\n              \n                ψ\n                \n                  n\n                \n              \n            \n            \n              φ\n              −\n              ψ\n            \n          \n        \n      \n    \n    {\\displaystyle F_{n}={\\frac {\\varphi ^{n}-\\psi ^{n}}{\\varphi -\\psi }}}\n  \n\nwhere \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle F_{n}}\n  \n is the n-th Fibonacci number, and \n  \n    \n      \n        φ\n        =\n        \n          \n            1\n            2\n          \n        \n        (\n        1\n        +\n        \n          \n            5\n          \n        \n        )\n      \n    \n    {\\textstyle \\varphi ={\\frac {1}{2}}(1+{\\sqrt {5}})}\n  \n (the golden ratio) and \n  \n    \n      \n        ψ\n        =\n        \n          \n            1\n            2\n          \n        \n        (\n        1\n        −\n        \n          \n            5\n          \n        \n        )\n      \n    \n    {\\textstyle \\psi ={\\frac {1}{2}}(1-{\\sqrt {5}})}\n  \n are the roots of the polynomial \n  \n    \n      \n        \n          x\n          \n            2\n          \n        \n        −\n        x\n        −\n        1\n      \n    \n    {\\displaystyle x^{2}-x-1}\n  \n. By using the fact that \n  \n    \n      \n        \n          F\n          \n            n\n            +\n            2\n          \n        \n        =\n        \n          F\n          \n            n\n            +\n            1\n          \n        \n        +\n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle F_{n+2}=F_{n+1}+F_{n}}\n  \n for each \n  \n    \n      \n        n\n        ∈\n        \n          N\n        \n      \n    \n    {\\displaystyle n\\in \\mathbb {N} }\n  \n, the identity above can be verified by direct calculation for \n  \n    \n      \n        \n          F\n          \n            n\n            +\n            2\n          \n        \n      \n    \n    {\\textstyle F_{n+2}}\n  \n if one assumes that it already holds for both \n  \n    \n      \n        \n          F\n          \n            n\n            +\n            1\n          \n        \n      \n    \n    {\\textstyle F_{n+1}}\n  \n and \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\textstyle F_{n}}\n  \n. To complete the proof, the identity must be verified in the two base cases: \n  \n    \n      \n        n\n        =\n        0\n      \n    \n    {\\displaystyle n=0}\n  \n and \n  \n    \n      \n        n\n        =\n        1\n      \n    \n    {\\textstyle n=1}\n  \n.\n\n\n==== Example: prime factorization ====\nAnother proof by complete induction uses the hypothesis that the statement holds for all smaller \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n more thoroughly. Consider the statement that \"every natural number greater than 1 is a product of (one or more) prime numbers\", which is the \"existence\" part of the fundamental theorem of arithmetic. For proving the induction step, the induction hypothesis is that for a given \n  \n    \n      \n        n\n        >\n        1\n      \n    \n    {\\displaystyle n>1}\n  \n the statement holds for all smaller \n  \n    \n      \n        n\n        >\n        1\n      \n    \n    {\\displaystyle n>1}\n  \n. If \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n is prime then it is certainly a product of primes, and if not, then by definition it is a product: \n  \n    \n      \n        m\n        =\n        \n          n\n          \n            1\n          \n        \n        \n          n\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle m=n_{1}n_{2}}\n  \n, where neither of the factors is equal to 1; hence neither is equal to \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n, and so both are greater than 1 and smaller than \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n. The induction hypothesis now applies to \n  \n    \n      \n        \n          n\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle n_{1}}\n  \n and \n  \n    \n      \n        \n          n\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle n_{2}}\n  \n, so each one is a product of primes. Thus \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n is a product of products of primes, and hence by extension a product of primes itself.\n\n\n==== Example: dollar amounts revisited ====\nWe shall look to prove the same example as above, this time with strong induction. The statement remains the same:\n\n  \n    \n      \n        S\n        (\n        n\n        )\n        :\n        \n        \n        n\n        ≥\n        12\n        \n        ⟹\n        \n        \n        ∃\n        \n        a\n        ,\n        b\n        ∈\n        \n          N\n        \n        .\n        \n        \n        n\n        =\n        4\n        a\n        +\n        5\n        b\n      \n    \n    {\\displaystyle S(n):\\,\\,n\\geq 12\\implies \\,\\exists \\,a,b\\in \\mathbb {N} .\\,\\,n=4a+5b}\n  \n\nHowever, there will be slight differences in the structure and the assumptions of the proof, starting with the extended base case.\nProof.\nBase case: Show that \n  \n    \n      \n        S\n        (\n        k\n        )\n      \n    \n    {\\displaystyle S(k)}\n  \n holds for \n  \n    \n      \n        k\n        =\n        12\n        ,\n        13\n        ,\n        14\n        ,\n        15\n      \n    \n    {\\displaystyle k=12,13,14,15}\n  \n.\n\n  \n    \n      \n        \n          \n            \n              \n                4\n                ⋅\n                3\n                +\n                5\n                ⋅\n                0\n                =\n                12\n              \n            \n            \n              \n                4\n                ⋅\n                2\n                +\n                5\n                ⋅\n                1\n                =\n                13\n              \n            \n            \n              \n                4\n                ⋅\n                1\n                +\n                5\n                ⋅\n                2\n                =\n                14\n              \n            \n            \n              \n                4\n                ⋅\n                0\n                +\n                5\n                ⋅\n                3\n                =\n                15\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}4\\cdot 3+5\\cdot 0=12\\\\4\\cdot 2+5\\cdot 1=13\\\\4\\cdot 1+5\\cdot 2=14\\\\4\\cdot 0+5\\cdot 3=15\\end{aligned}}}\n  \n\nThe base case holds.\nInduction step: Given some \n  \n    \n      \n        j\n        >\n        15\n      \n    \n    {\\displaystyle j>15}\n  \n, assume \n  \n    \n      \n        S\n        (\n        m\n        )\n      \n    \n    {\\displaystyle S(m)}\n  \n holds for all \n  \n    \n      \n        m\n      \n    \n    {\\displaystyle m}\n  \n with \n  \n    \n      \n        12\n        ≤\n        m\n        <\n        j\n      \n    \n    {\\displaystyle 12\\leq m<j}\n  \n. Prove that \n  \n    \n      \n        S\n        (\n        j\n        )\n      \n    \n    {\\displaystyle S(j)}\n  \n holds.\nChoosing \n  \n    \n      \n        m\n        =\n        j\n        −\n        4\n      \n    \n    {\\displaystyle m=j-4}\n  \n, and observing that \n  \n    \n      \n        15\n        <\n        j\n        \n        ⟹\n        \n        12\n        ≤\n        j\n        −\n        4\n        <\n        j\n      \n    \n    {\\displaystyle 15<j\\implies 12\\leq j-4<j}\n  \n shows that \n  \n    \n      \n        S\n        (\n        j\n        −\n        4\n        )\n      \n    \n    {\\displaystyle S(j-4)}\n  \n holds, by the inductive hypothesis. That is, the sum \n  \n    \n      \n        j\n        −\n        4\n      \n    \n    {\\displaystyle j-4}\n  \n can be formed by some combination of \n  \n    \n      \n        4\n      \n    \n    {\\displaystyle 4}\n  \n and \n  \n    \n      \n        5\n      \n    \n    {\\displaystyle 5}\n  \n dollar coins. Then, simply adding a \n  \n    \n      \n        4\n      \n    \n    {\\displaystyle 4}\n  \n dollar coin to that combination yields the sum \n  \n    \n      \n        j\n      \n    \n    {\\displaystyle j}\n  \n. That is, \n  \n    \n      \n        S\n        (\n        j\n        )\n      \n    \n    {\\displaystyle S(j)}\n  \n holds Q.E.D.\n\n\n=== Forward-backward induction ===\n\nSometimes, it is more convenient to deduce backwards, proving the statement for \n  \n    \n      \n        n\n        −\n        1\n      \n    \n    {\\displaystyle n-1}\n  \n, given its validity for \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n. However, proving the validity of the statement for no single number suffices to establish the base case; instead, one needs to prove the statement for an infinite subset of the natural numbers. For example, Augustin Louis Cauchy first used forward (regular) induction to prove the\ninequality of arithmetic and geometric means for all powers of 2, and then used backwards induction to show it for all natural numbers.\n\n\n== Example of error in the induction step ==\n\nThe induction step must be proved for all values of n. To illustrate this, Joel E. Cohen proposed the following argument, which purports to prove by mathematical induction that all horses are of the same color:\nBase case: in a set of only one horse, there is only one color.\nInduction step: assume as induction hypothesis that within any set of \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n horses, there is only one color. Now look at any set of \n  \n    \n      \n        n\n        +\n        1\n      \n    \n    {\\displaystyle n+1}\n  \n horses. Number them: \n  \n    \n      \n        1\n        ,\n        2\n        ,\n        3\n        ,\n        …\n        ,\n        n\n        ,\n        n\n        +\n        1\n      \n    \n    {\\displaystyle 1,2,3,\\dotsc ,n,n+1}\n  \n. Consider the sets \n  \n    \n      \n        \n          {\n          \n            1\n            ,\n            2\n            ,\n            3\n            ,\n            …\n            ,\n            n\n          \n          }\n        \n      \n    \n    {\\textstyle \\left\\{1,2,3,\\dotsc ,n\\right\\}}\n  \n and \n  \n    \n      \n        \n          {\n          \n            2\n            ,\n            3\n            ,\n            4\n            ,\n            …\n            ,\n            n\n            +\n            1\n          \n          }\n        \n      \n    \n    {\\textstyle \\left\\{2,3,4,\\dotsc ,n+1\\right\\}}\n  \n. Each is a set of only \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n horses, therefore within each there is only one color. But the two sets overlap, so there must be only one color among all \n  \n    \n      \n        n\n        +\n        1\n      \n    \n    {\\displaystyle n+1}\n  \n horses.\nThe base case \n  \n    \n      \n        n\n        =\n        1\n      \n    \n    {\\displaystyle n=1}\n  \n is trivial, and the induction step is correct in all cases \n  \n    \n      \n        n\n        >\n        1\n      \n    \n    {\\displaystyle n>1}\n  \n. However, the argument used in the induction step is incorrect for \n  \n    \n      \n        n\n        +\n        1\n        =\n        2\n      \n    \n    {\\displaystyle n+1=2}\n  \n, because the statement that \"the two sets overlap\" is false for \n  \n    \n      \n        \n          {\n          1\n          }\n        \n      \n    \n    {\\textstyle \\left\\{1\\right\\}}\n  \n and \n  \n    \n      \n        \n          {\n          2\n          }\n        \n      \n    \n    {\\textstyle \\left\\{2\\right\\}}\n  \n.\n\n\n== Formalization ==\nIn second-order logic, one can write down the \"axiom of induction\" as follows:\n\n  \n    \n      \n        ∀\n        P\n        \n        \n          \n            (\n          \n        \n        P\n        (\n        0\n        )\n        ∧\n        ∀\n        k\n        \n          \n            (\n          \n        \n        P\n        (\n        k\n        )\n        →\n        P\n        (\n        k\n        +\n        1\n        )\n        \n          \n            )\n          \n        \n        →\n        ∀\n        n\n        \n        \n          \n            (\n          \n        \n        P\n        (\n        n\n        )\n        \n          \n            )\n          \n        \n        \n          \n            )\n          \n        \n        ,\n      \n    \n    {\\displaystyle \\forall P\\,{\\Bigl (}P(0)\\land \\forall k{\\bigl (}P(k)\\to P(k+1){\\bigr )}\\to \\forall n\\,{\\bigl (}P(n){\\bigr )}{\\Bigr )},}\n  \n\nwhere P(·) is a variable for predicates involving one natural number and k and n are variables for natural numbers.\nIn words, the base case P(0) and the induction step (namely, that the induction hypothesis P(k) implies P(k + 1)) together imply that P(n) for any natural number n. The axiom of induction asserts the validity of inferring that P(n) holds for any natural number n from the base case and the induction step.\nThe first quantifier in the axiom ranges over predicates rather than over individual numbers. This is a second-order quantifier, which means that this axiom is stated in second-order logic. Axiomatizing arithmetic induction in first-order logic requires an axiom schema containing a separate axiom for each possible predicate. The article Peano axioms contains further discussion of this issue.\nThe axiom of structural induction for the natural numbers was first formulated by Peano, who used it to specify the natural numbers together with the following four other axioms:\n\n0 is a natural number.\nThe successor function s of every natural number yields a natural number (s(x) = x + 1).\nThe successor function is injective.\n0 is not in the range of s.\nIn first-order ZFC set theory, quantification over predicates is not allowed, but one can still express induction by quantification over sets:\n\n  \n    \n      \n        ∀\n        A\n        \n          \n            (\n          \n        \n        0\n        ∈\n        A\n        ∧\n        ∀\n        k\n        ∈\n        \n          N\n        \n        \n          \n            (\n          \n        \n        k\n        ∈\n        A\n        →\n        (\n        k\n        +\n        1\n        )\n        ∈\n        A\n        \n          \n            )\n          \n        \n        →\n        \n          N\n        \n        ⊆\n        A\n        \n          \n            )\n          \n        \n      \n    \n    {\\displaystyle \\forall A{\\Bigl (}0\\in A\\land \\forall k\\in \\mathbb {N} {\\bigl (}k\\in A\\to (k+1)\\in A{\\bigr )}\\to \\mathbb {N} \\subseteq A{\\Bigr )}}\n  \n\nA may be read as a set representing a proposition, and containing natural numbers, for which the proposition holds. This is not an axiom, but a theorem, given that natural numbers are defined in the language of ZFC set theory by axioms, analogous to Peano's. See construction of the natural numbers using the axiom of infinity and axiom schema of specification.\n\n\n== Transfinite induction ==\n\nOne variation of the principle of complete induction can be generalized for statements about elements of any well-founded set, that is, a set with an irreflexive relation < that contains no infinite descending chains. Every set representing an ordinal number is well-founded, the set of natural numbers is one of them.\nApplied to a well-founded set, transfinite induction can be formulated as a single step. To prove that a statement P(n) holds for each ordinal number:\n\nShow, for each ordinal number n, that if P(m) holds for all m < n, then P(n) also holds.\nThis form of induction, when applied to a set of ordinal numbers (which form a well-ordered and hence well-founded class), is called transfinite induction. It is an important proof technique in set theory, topology and other fields.\nProofs by transfinite induction typically distinguish three cases:\n\nwhen n is a minimal element, i.e. there is no element smaller than n;\nwhen n has a direct predecessor, i.e. the set of elements which are smaller than n has a largest element;\nwhen n has no direct predecessor, i.e. n is a so-called limit ordinal.\nStrictly speaking, it is not necessary in transfinite induction to prove a base case, because it is a vacuous special case of the proposition that if P is true of all n < m, then P is true of m. It is vacuously true precisely because there are no values of n < m that could serve as counterexamples. So the special cases are special cases of the general case.\n\n\n== Relationship to the well-ordering principle ==\nThe principle of mathematical induction is usually stated as an axiom of the natural numbers; see Peano axioms. It is strictly stronger than the well-ordering principle in the context of the other Peano axioms. Suppose the following:\n\nThe trichotomy axiom: For any natural numbers n and m, n is less than or equal to m if and only if m is not less than n.\nFor any natural number n, n + 1 is greater than n.\nFor any natural number n, no natural number is between n and n + 1.\nNo natural number is less than zero.\nIt can then be proved that induction, given the above-listed axioms, implies the well-ordering principle. The following proof uses complete induction and the first and fourth axioms.\nProof. Suppose there exists a non-empty set, S, of natural numbers that has no least element. Let P(n) be the assertion that n is not in S. Then P(0) is true, for if it were false then 0 is the least element of S. Furthermore, let n be a natural number, and suppose P(m) is true for all natural numbers m less than n + 1. Then if P(n + 1) is false n + 1 is in S, thus being a minimal element in S, a contradiction. Thus P(n + 1) is true. Therefore, by the complete induction principle, P(n) holds for all natural numbers n; so S is empty, a contradiction. Q.E.D.\n\nOn the other hand, the set \n  \n    \n      \n        {\n        (\n        0\n        ,\n        n\n        )\n        :\n        n\n        ∈\n        \n          N\n        \n        }\n        ∪\n        {\n        (\n        1\n        ,\n        n\n        )\n        :\n        n\n        ∈\n        \n          N\n        \n        }\n      \n    \n    {\\displaystyle \\{(0,n):n\\in \\mathbb {N} \\}\\cup \\{(1,n):n\\in \\mathbb {N} \\}}\n  \n, shown in the picture, is well-ordered: 35lf  by the lexicographic order.\nMoreover, except for the induction axiom, it satisfies all Peano axioms, where Peano's constant 0 is interpreted as the pair (0, 0), and Peano's successor function is defined on pairs by succ(x, n) = (x, n + 1) for all \n  \n    \n      \n        x\n        ∈\n        {\n        0\n        ,\n        1\n        }\n      \n    \n    {\\displaystyle x\\in \\{0,1\\}}\n  \n and \n  \n    \n      \n        n\n        ∈\n        \n          N\n        \n      \n    \n    {\\displaystyle n\\in \\mathbb {N} }\n  \n.\nAs an example for the violation of the induction axiom, define the predicate P(x, n) as (x, n) = (0, 0) or (x, n) = succ(y, m) for some \n  \n    \n      \n        y\n        ∈\n        {\n        0\n        ,\n        1\n        }\n      \n    \n    {\\displaystyle y\\in \\{0,1\\}}\n  \n and \n  \n    \n      \n        m\n        ∈\n        \n          N\n        \n      \n    \n    {\\displaystyle m\\in \\mathbb {N} }\n  \n. Then the base case P(0, 0) is trivially true, and so is the induction step: if P(x, n), then P(succ(x, n)). However, P is not true for all pairs in the set, since P(1,0) is false.\nPeano's axioms with the induction principle uniquely model the natural numbers. Replacing the induction principle with the well-ordering principle allows for more exotic models that fulfill all the axioms.\nIt is mistakenly printed in several books and sources that the well-ordering principle is equivalent to the induction axiom. In the context of the other Peano axioms, this is not the case, but in the context of other axioms, they are equivalent; specifically, the well-ordering principle implies the induction axiom in the context of the first two above listed axioms and\n\nEvery natural number is either 0 or n + 1 for some natural number n.\nA common mistake in many erroneous proofs is to assume that n − 1 is a unique and well-defined natural number, a property which is not implied by the other Peano axioms.\n\n\n== See also ==\nInduction puzzles\nProof by exhaustion\n\n\n== Notes ==\n\n\n== References ==",
  "links": {
    "Absolute value": "",
    "Abstract logic": "",
    "Ackermann set theory": "",
    "Addison-Wesley": "",
    "Addition of natural numbers": "",
    "Al-Karaji": "",
    "Al-Samawal al-Maghribi": "",
    "Aleph number": "",
    "Algebra": "",
    "Algebraic logic": ""
  },
  "url": "https://en.wikipedia.org/wiki/Mathematical_induction"
}