{
  "title": "Proof by contradiction",
  "content": "In logic, proof by contradiction is a form of proof that establishes the truth or the validity of a proposition by showing that assuming the proposition to be false leads to a contradiction.\nAlthough it is quite freely used in mathematical proofs, not every school of mathematical thought accepts this kind of nonconstructive proof as universally valid.\nMore broadly, proof by contradiction is any form of argument that establishes a statement by arriving at a contradiction, even when the initial assumption is not the negation of the statement to be proved. In this general sense, proof by contradiction is also known as indirect proof, proof by assuming the opposite, and reductio ad impossibile.\nA mathematical proof employing proof by contradiction usually proceeds as follows:\n\nThe proposition to be proved is P.\nWe assume P to be false, i.e., we assume ¬P.\nIt is then shown that ¬P implies falsehood. This is typically accomplished by deriving two mutually contradictory assertions, Q and ¬Q, and appealing to the law of noncontradiction.\nSince assuming P to be false leads to a contradiction, it is concluded that P is in fact true.\nAn important special case is the existence proof by contradiction: in order to demonstrate that an object with a given property exists, we derive a contradiction from the assumption that all objects satisfy the negation of the property.\n\n\n== Formalization ==\nThe principle may be formally expressed as the propositional formula ¬¬P ⇒ P, equivalently (¬P ⇒ ⊥) ⇒ P, which reads: \"If assuming P to be false implies falsehood, then P is true.\"\nIn natural deduction the principle takes the form of the rule of inference\n\n  \n    \n      \n        \n          \n            \n              \n                \n              \n              \n                \n                  ⊢\n                  ¬\n                  ¬\n                  P\n                \n              \n            \n            \n              \n                \n              \n              \n                \n                  ⊢\n                  P\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\cfrac {\\vdash \\lnot \\lnot P}{\\vdash P}}}\n  \n\nwhich reads: \"If \n  \n    \n      \n        ¬\n        ¬\n        P\n      \n    \n    {\\displaystyle \\lnot \\lnot P}\n  \n is proved, then \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n may be concluded.\"\nIn sequent calculus the principle is expressed by the sequent\n\n  \n    \n      \n        Γ\n        ,\n        ¬\n        ¬\n        P\n        ⊢\n        P\n        ,\n        Δ\n      \n    \n    {\\displaystyle \\Gamma ,\\lnot \\lnot P\\vdash P,\\Delta }\n  \n\nwhich reads: \"Hypotheses \n  \n    \n      \n        Γ\n      \n    \n    {\\displaystyle \\Gamma }\n  \n and \n  \n    \n      \n        ¬\n        ¬\n        P\n      \n    \n    {\\displaystyle \\lnot \\lnot P}\n  \n entail the conclusion \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n or \n  \n    \n      \n        Δ\n      \n    \n    {\\displaystyle \\Delta }\n  \n.\"\n\n\n== Justification ==\nIn classical logic the principle may be justified by the examination of the truth table of the proposition ¬¬P ⇒ P, which demonstrates it to be a tautology:\n\nAnother way to justify the principle is to derive it from the law of the excluded middle, as follows. We assume ¬¬P and seek to prove P. By the law of excluded middle P either holds or it does not:\n\nif P holds, then of course P holds.\nif ¬P holds, then we derive falsehood by applying the law of noncontradiction to ¬P and ¬¬P, after which the principle of explosion allows us to conclude P.\nIn either case, we established P. It turns out that, conversely, proof by contradiction can be used to derive the law of excluded middle.\nIn classical sequent calculus LK proof by contradiction is derivable from the inference rules for negation:\n\n  \n    \n      \n        \n          \n            \n              \n                \n              \n              \n                \n                  \n                    \n                      \n                        \n                          \n                        \n                        \n                          \n                            \n                              \n                                \n                                  \n                                    \n                                  \n                                  \n                                    \n                                       \n                                    \n                                  \n                                \n                                \n                                  \n                                    \n                                  \n                                  \n                                    \n                                      Γ\n                                      ,\n                                      P\n                                      ⊢\n                                      P\n                                      ,\n                                      Δ\n                                    \n                                  \n                                \n                              \n                            \n                            \n                            (\n                            I\n                            )\n                          \n                        \n                      \n                      \n                        \n                          \n                        \n                        \n                          \n                            Γ\n                            ,\n                            ⊢\n                            ¬\n                            P\n                            ,\n                            P\n                            ,\n                            Δ\n                          \n                        \n                      \n                    \n                  \n                  \n                  (\n                  \n                    ¬\n                  \n                  R\n                  )\n                \n              \n            \n            \n              \n                \n              \n              \n                \n                  Γ\n                  ,\n                  ¬\n                  ¬\n                  P\n                  ⊢\n                  P\n                  ,\n                  Δ\n                \n              \n            \n          \n        \n        \n        (\n        \n          ¬\n        \n        L\n        )\n      \n    \n    {\\displaystyle {\\cfrac {{\\cfrac {{\\cfrac {\\ }{\\Gamma ,P\\vdash P,\\Delta }}\\;(I)}{\\Gamma ,\\vdash \\lnot P,P,\\Delta }}\\;({\\lnot }R)}{\\Gamma ,\\lnot \\lnot P\\vdash P,\\Delta }}\\;({\\lnot }L)}\n  \n\n\n== Relationship with other proof techniques ==\n\n\n=== Refutation by contradiction ===\nProof by contradiction is similar to refutation by contradiction, also known as proof of negation, which states that ¬P is proved as follows:\n\nThe proposition to be proved is ¬P.\nAssume P.\nDerive falsehood.\nConclude ¬P.\nIn contrast, proof by contradiction proceeds as follows:\n\nThe proposition to be proved is P.\nAssume ¬P.\nDerive falsehood.\nConclude P.\nFormally these are not the same, as refutation by contradiction applies only when the proposition to be proved is negated, whereas proof by contradiction may be applied to any proposition whatsoever. In classical logic, where \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n and \n  \n    \n      \n        ¬\n        ¬\n        P\n      \n    \n    {\\displaystyle \\neg \\neg P}\n  \n may be freely interchanged, the distinction is largely obscured. Thus in mathematical practice, both principles are referred to as \"proof by contradiction\".\n\n\n=== Law of the excluded middle ===\n\nProof by contradiction is equivalent to the law of the excluded middle, first formulated by Aristotle, which states that either an assertion or its negation is true, P ∨ ¬P.\n\n\n=== Law of non-contradiction ===\nThe law of noncontradiction was first stated as a metaphysical principle by Aristotle. It posits that a proposition and its negation cannot both be true, or equivalently, that a proposition cannot be both true and false. Formally the law of non-contradiction is written as ¬(P ∧ ¬P) and read as \"it is not the case that a proposition is both true and false\". The law of non-contradiction neither follows nor is implied by the principle of Proof by contradiction.\nThe laws of excluded middle and non-contradiction together mean that exactly one of P and ¬P is true.\n\n\n== Proof by contradiction in intuitionistic logic ==\n\nIn intuitionistic logic proof by contradiction is not generally valid, although some particular instances can be derived. In contrast, proof of negation and principle of noncontradiction are both intuitionistically valid.\nBrouwer–Heyting–Kolmogorov interpretation of proof by contradiction gives the following intuitionistic validity condition: if there is no method for establishing that a proposition is false, then there is a method for establishing that the proposition is true.\nIf we take \"method\" to mean algorithm, then the condition is not acceptable, as it would allow us to solve the Halting problem. To see how, consider the statement H(M) stating \"Turing machine M halts or does not halt\". Its negation ¬H(M) states that \"M neither halts nor does not halt\", which is false by the law of noncontradiction (which is intuitionistically valid). If proof by contradiction were intuitionistically valid, we would obtain an algorithm for deciding whether an arbitrary Turing machine M halts, thereby violating the (intuitionistically valid) proof of non-solvability of the Halting problem.\nA proposition P which satisfies \n  \n    \n      \n        ¬\n        ¬\n        P\n        ⇒\n        P\n      \n    \n    {\\displaystyle \\lnot \\lnot P\\Rightarrow P}\n  \n is known as a ¬¬-stable proposition. Thus in intuitionistic logic proof by contradiction is not universally valid, but can only be applied to the ¬¬-stable propositions. An instance of such a proposition is a decidable one, i.e., satisfying \n  \n    \n      \n        P\n        ∨\n        ¬\n        P\n      \n    \n    {\\displaystyle P\\lor \\lnot P}\n  \n. Indeed, the above proof that the law of excluded middle implies proof by contradiction can be repurposed to show that a decidable proposition is ¬¬-stable. A typical  example of a decidable proposition is a statement that can be checked by direct computation, such as \"\n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n is prime\" or \"\n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n divides \n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n  \n\".\n\n\n== Examples of proofs by contradiction ==\n\n\n=== Euclid's Elements ===\nAn early occurrence of proof by contradiction can be found in Euclid's Elements, Book 1, Proposition 6:\n\nIf in a triangle two angles equal one another, then the sides opposite the equal angles also equal one another.\nThe proof proceeds by assuming that the opposite sides are not equal, and derives a contradiction.\n\n\n=== Hilbert's Nullstellensatz ===\nAn influential proof by contradiction was given by David Hilbert. His\nNullstellensatz states:\n\nIf \n  \n    \n      \n        \n          f\n          \n            1\n          \n        \n        ,\n        …\n        ,\n        \n          f\n          \n            k\n          \n        \n      \n    \n    {\\displaystyle f_{1},\\ldots ,f_{k}}\n  \n are polynomials in n indeterminates with complex coefficients, which have no common complex zeros, then there are polynomials \n  \n    \n      \n        \n          g\n          \n            1\n          \n        \n        ,\n        …\n        ,\n        \n          g\n          \n            k\n          \n        \n      \n    \n    {\\displaystyle g_{1},\\ldots ,g_{k}}\n  \n such that \n  \n    \n      \n        \n          f\n          \n            1\n          \n        \n        \n          g\n          \n            1\n          \n        \n        +\n        …\n        +\n        \n          f\n          \n            k\n          \n        \n        \n          g\n          \n            k\n          \n        \n        =\n        1.\n      \n    \n    {\\displaystyle f_{1}g_{1}+\\ldots +f_{k}g_{k}=1.}\n  \n\nHilbert proved the statement by assuming that there are no such polynomials \n  \n    \n      \n        \n          g\n          \n            1\n          \n        \n        ,\n        …\n        ,\n        \n          g\n          \n            k\n          \n        \n      \n    \n    {\\displaystyle g_{1},\\ldots ,g_{k}}\n  \n and derived a contradiction.\n\n\n=== Infinitude of primes ===\nEuclid's theorem states that there are infinitely many primes. In Euclid's Elements the theorem is stated in Book IX, Proposition 20:\n\nPrime numbers are more than any assigned multitude of prime numbers.\nDepending on how we formally write the above statement, the usual proof takes either the form of a proof by contradiction or a refutation by contradiction. We present here the former, see below how the proof is done as refutation by contradiction.\nIf we formally express Euclid's theorem as saying that for every natural number \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n there is a prime bigger than it, then we employ proof by contradiction, as follows.\nGiven any number \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n, we seek to prove that there is a prime larger than \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n. Suppose to the contrary that no such p exists (an application of proof by contradiction). Then all primes are smaller than or equal to \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n, and we may form the list \n  \n    \n      \n        \n          p\n          \n            1\n          \n        \n        ,\n        …\n        ,\n        \n          p\n          \n            k\n          \n        \n      \n    \n    {\\displaystyle p_{1},\\ldots ,p_{k}}\n  \n of them all. Let \n  \n    \n      \n        P\n        =\n        \n          p\n          \n            1\n          \n        \n        ⋅\n        …\n        ⋅\n        \n          p\n          \n            k\n          \n        \n      \n    \n    {\\displaystyle P=p_{1}\\cdot \\ldots \\cdot p_{k}}\n  \n be the product of all primes and \n  \n    \n      \n        Q\n        =\n        P\n        +\n        1\n      \n    \n    {\\displaystyle Q=P+1}\n  \n. Because \n  \n    \n      \n        Q\n      \n    \n    {\\displaystyle Q}\n  \n is larger than all prime numbers it is not prime, hence it must be divisible by one of them, say \n  \n    \n      \n        \n          p\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle p_{i}}\n  \n. Now both \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n and \n  \n    \n      \n        Q\n      \n    \n    {\\displaystyle Q}\n  \n are divisible by \n  \n    \n      \n        \n          p\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle p_{i}}\n  \n, hence so is their difference \n  \n    \n      \n        Q\n        −\n        P\n        =\n        1\n      \n    \n    {\\displaystyle Q-P=1}\n  \n, but this cannot be because 1 is not divisible by any primes. Hence we have a contradiction and so there is a prime number bigger than \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n\n\n== Examples of refutations by contradiction ==\nThe following examples are commonly referred to as proofs by contradiction, but formally employ refutation by contradiction (and therefore are intuitionistically valid).\n\n\n=== Infinitude of primes ===\nLet us take a second look at Euclid's theorem – Book IX, Proposition 20:\n\nPrime numbers are more than any assigned multitude of prime numbers.\nWe may read the statement as saying that for every finite list of primes, there is another prime not on that list,\nwhich is arguably closer to and in the same spirit as Euclid's original formulation. In this case Euclid's proof applies refutation by contradiction at one step, as follows.\nGiven any finite list of prime numbers \n  \n    \n      \n        \n          p\n          \n            1\n          \n        \n        ,\n        …\n        ,\n        \n          p\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle p_{1},\\ldots ,p_{n}}\n  \n, it will be shown that at least one additional prime number not in this list exists. Let \n  \n    \n      \n        P\n        =\n        \n          p\n          \n            1\n          \n        \n        ⋅\n        \n          p\n          \n            2\n          \n        \n        ⋯\n        \n          p\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle P=p_{1}\\cdot p_{2}\\cdots p_{n}}\n  \n be the product of all the listed primes and \n  \n    \n      \n        p\n      \n    \n    {\\displaystyle p}\n  \n a prime factor of \n  \n    \n      \n        P\n        +\n        1\n      \n    \n    {\\displaystyle P+1}\n  \n, possibly \n  \n    \n      \n        P\n        +\n        1\n      \n    \n    {\\displaystyle P+1}\n  \n itself. We claim that \n  \n    \n      \n        p\n      \n    \n    {\\displaystyle p}\n  \n is not in the given list of primes. Suppose to the contrary that it were (an application of refutation by contradiction). Then \n  \n    \n      \n        p\n      \n    \n    {\\displaystyle p}\n  \n would divide both \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n and  \n  \n    \n      \n        P\n        +\n        1\n      \n    \n    {\\displaystyle P+1}\n  \n, therefore also their difference, which is \n  \n    \n      \n        1\n      \n    \n    {\\displaystyle 1}\n  \n. This gives a contradiction, since no prime number divides 1.\n\n\n=== Irrationality of the square root of 2 ===\nThe classic proof that the square root of 2 is irrational is a refutation by contradiction.\nIndeed, we set out to prove the negation ¬ ∃ a, b ∈ \n  \n    \n      \n        \n          N\n        \n      \n    \n    {\\displaystyle \\mathbb {N} }\n  \n . a/b = √2 by assuming that there exist natural numbers a and b whose ratio is the square root of two, and derive a contradiction.\n\n\n=== Proof by infinite descent ===\nProof by infinite descent is a method of proof whereby a smallest object with desired property is shown not to exist as follows:\n\nAssume that there is a smallest object with the desired property.\nDemonstrate that an even smaller object with the desired property exists, thereby deriving a contradiction.\nSuch a proof is again a refutation by contradiction. A typical example is the proof of the proposition \"there is no smallest positive rational number\": assume there is a smallest positive rational number q and derive a contradiction by observing that ⁠q/2⁠ is even smaller than q and still positive.\n\n\n=== Russell's paradox ===\nRussell's paradox, stated set-theoretically as \"there is no set whose elements are precisely those sets that do not contain themselves\", is a negated statement whose usual proof is a refutation by contradiction.\n\n\n== Notation ==\nProofs by contradiction sometimes end with the word \"Contradiction!\".  Isaac Barrow and Baermann used the notation Q.E.A., for \"quod est absurdum\" (\"which is absurd\"), along the lines of Q.E.D., but this notation is rarely used today. A graphical symbol sometimes used for contradictions is a downwards zigzag arrow \"lightning\" symbol (U+21AF: ↯), for example in Davey and Priestley.  Others sometimes used include a pair of opposing arrows (as \n  \n    \n      \n        →\n        \n        ←\n      \n    \n    {\\displaystyle \\rightarrow \\!\\leftarrow }\n  \n or \n  \n    \n      \n        ⇒\n        \n        ⇐\n      \n    \n    {\\displaystyle \\Rightarrow \\!\\Leftarrow }\n  \n), struck-out arrows (\n  \n    \n      \n        ↮\n      \n    \n    {\\displaystyle \\nleftrightarrow }\n  \n), a stylized form of hash (such as U+2A33: ⨳), or the \"reference mark\" (U+203B: ※), or \n  \n    \n      \n        ×\n        \n        \n        \n        \n        ×\n      \n    \n    {\\displaystyle \\times \\!\\!\\!\\!\\times }\n  \n.\n\n\n== Hardy's view ==\nG. H. Hardy described proof by contradiction as \"one of a mathematician's finest weapons\", saying \"It is a far finer gambit than any chess gambit: a chess player may offer the sacrifice of a pawn or even a piece, but a mathematician offers the game.\"\n\n\n== Automated theorem proving ==\nIn automated theorem proving the method of resolution is based on proof by contradiction. That is, in order to show that a given statement is entailed by given hypotheses, the automated prover assumes the hypotheses and the negation of the statement, and attempts to derive a contradiction.\n\n\n== See also ==\nLaw of excluded middle\nLaw of noncontradiction\nProof by exhaustion\nProof by infinite descent\nModus tollens\nReductio ad absurdum\n\n\n== References ==\n\n\n== Further reading and external links ==\n\nFranklin, James; Daoud, Albert (2011). Proof in Mathematics: An Introduction. chapter 6: Kew. ISBN 978-0-646-54509-7.{{cite book}}:  CS1 maint: location (link)\nProof by Contradiction from Larry W. Cusick's How To Write Proofs\nReductio ad Absurdum Internet Encyclopedia of Philosophy; ISSN 2161-0002",
  "links": {
    "A Mathematician's Apology": "",
    "Abstract logic": "",
    "Ackermann set theory": "",
    "Aleph number": "",
    "Algebraic logic": "",
    "Algorithm": "",
    "Alphabet (formal languages)": "",
    "Argument": "",
    "Aristotle": "",
    "Arity": ""
  },
  "url": "https://en.wikipedia.org/wiki/Proof_by_contradiction"
}