{
  "title": "Proxemics",
  "content": "Proxemics is the study of human use of space and the effects that population density has on behavior, communication, and social interaction. Proxemics is one among several subcategories in the study of nonverbal communication, including haptics (touch), kinesics (body movement), vocalics (paralanguage), and chronemics (structure of time).\nEdward T. Hall, the cultural anthropologist who coined the term in 1963, defined proxemics as \"the interrelated observations and theories of humans' use of space as a specialized elaboration of culture\". In his foundational work on proxemics, The Hidden Dimension, Hall emphasized the impact of proxemic behavior (the use of space) on interpersonal communication. According to Hall, the study of proxemics is valuable in evaluating not only the way people interact with others in daily life, but also \"the organization of space in [their] houses and buildings, and ultimately the layout of [their] towns\". Proxemics remains a hidden component of interpersonal communication that is uncovered through observation and strongly influenced by culture.\n\n\n== Human distances ==\nThe distance surrounding a person forms a space. The space within intimate distance and personal distance is called personal space. The space within social distance and out of personal distance is called social space, and the space within public distance is called public space.\nPersonal space is the region surrounding a person which they regard as psychologically theirs. Most people value their personal space and feel discomfort, anger, or anxiety when their personal space is encroached.  Permitting a person to enter personal space and entering somebody else's personal space are indicators of perception of those people's relationship. An intimate zone is reserved for close friends, lovers, children and close family members. Another zone is used for conversations with friends, to chat with associates, and in group discussions. A further zone is reserved for strangers, newly formed groups, and new acquaintances. A fourth zone is used for speeches, lectures, and theater; essentially, public distance is that range reserved for larger audiences.\nEntering somebody's personal space is normally an indication of familiarity and sometimes intimacy. However, in modern society, especially in crowded urban communities, it can be difficult to maintain personal space, for example when in a crowded train, elevator or street. Many people find such physical proximity to be psychologically disturbing and uncomfortable, though it is accepted as a fact of modern life. In an impersonal, crowded situation, eye contact tends to be avoided. Even in a crowded place, preserving personal space is important, and intimate and sexual contact, such as frotteurism and groping, is unacceptable physical contact.\nA person's personal space is carried with them everywhere they go. It is the most inviolate form of territory. Body spacing and posture, according to Hall, are unintentional reactions to sensory fluctuations or shifts, such as subtle changes in the sound and pitch of a person's voice. Social distance between people is reliably correlated with physical distance, as are intimate and personal distance, according to the delineations below.  Hall did not mean for these measurements to be strict guidelines that translate precisely to human behavior, but rather a system for gauging the effect of distance on communication and how the effect varies between cultures and other environmental factors.\n\n\n=== Interpersonal distance ===\nHall described the interpersonal distances of humans (the relative distances between people) in four distinct zones:\n\nIntimate distance for embracing, touching or whispering\nClose phase – less than one inch (0.01 to 0.02 m)\nFar phase – 6 to 18 inches (0.15 to 0.46 m)\nPersonal distance for interactions among good friends or family\nClose phase – 1.5 to 2.5 feet (0.46 to 0.76 m)\nFar phase – 2.5 to 4 feet (0.76 to 1.22 m)\nSocial distance for interactions among acquaintances\nClose phase – 4 to 7 feet (1.2 to 2.1 m)\nFar phase – 7 to 12 feet (2.1 to 3.7 m)\nPublic distance used for public speaking\nClose phase – 12 to 25 feet (3.7 to 7.6 m)\nFar phase – 25 feet (7.6 m) or more.\n\n\n==== Vertical ====\nThe distances mentioned above are horizontal distance. There is also vertical distance that communicates something between people. In this case, however, vertical distance is often understood to convey the degree of dominance or sub-ordinance in a relationship. Looking up at or down on another person can be taken literally in many cases, with the higher person asserting greater status.\nTeachers, and especially those who work with small children, should realize that students will interact more comfortably with a teacher when they are in same vertical plane. Used in this way, an understanding of vertical distance can become a tool for improved teacher-student communication. On the other hand, a disciplinarian might put this information to use in order to gain psychological advantage over an unruly student.\n\n\n== Explanations ==\n\n\n=== Biometrics ===\n\nHall used biometric concepts to categorize, explain, and explore the ways people connect in space. These variations in positioning are impacted by a variety of nonverbal communicative factors, listed below.\n\nKinesthetic factors: This category deals with how closely the participants are to touching, from being completely outside of body-contact distance to being in physical contact, which parts of the body are in contact, and body part positioning.\nHaptic code: This behavioral category concerns how participants are touching one another, such as caressing, holding, feeling, prolonged holding, spot touching, pressing against, accidental brushing, or not touching at all.\nVisual code: This category denotes the amount of eye contact between participants. Four sub-categories are defined, ranging from eye-to-eye contact to no eye contact at all.\nThermal code: This category denotes the amount of body heat that each participant perceives from another. Four sub-categories are defined: conducted heat detected, radiant heat detected, heat probably detected, and no detection of heat.\nOlfactory code: This category deals in the kind and degree of odor detected by each participant from the other.\nVoice loudness: This category deals in the vocal effort used in speech. Seven sub-categories are defined: silent, very soft, soft, normal, normal+, loud, and very loud.\n\n\n=== Neuropsychology ===\n\nWhereas Hall's work uses human interactions to demonstrate spatial variation in proxemics, the field of neuropsychology describes personal space in terms of the kinds of \"nearness\" to an individual body.\n\nExtrapersonal space: The space that occurs outside the reach of an individual.\nPeripersonal space: The space within reach of any limb of an individual. Thus, to be \"within arm's length\" is to be within one's peripersonal space.\nPericutaneous space: The space just outside our bodies but which might be near to touching it. Visual-tactile perceptive fields overlap in processing this space. For example, an individual might see a feather as not touching their skin but still experience the sensation of being tickled when it hovers just above their hand. Other examples include the blowing of wind, gusts of air, and the passage of heat.\nPrevic further subdivides extrapersonal space into focal-extrapersonal space, action-extrapersonal space, and ambient-extrapersonal space.  Focal-extrapersonal space is located in the lateral temporo-frontal pathways at the center of our vision, is retinotopically centered and tied to the position of our eyes, and is involved in object search and  recognition.  Action-extrapersonal-space is located in the medial temporo-frontal pathways, spans the entire space, and is head-centered and involved in orientation and locomotion in topographical space.  Action-extrapersonal space provides the \"presence\" of our world.   Ambient-extrapersonal space initially courses through the peripheral parieto-occipital visual pathways before joining up with vestibular and other body senses to control posture and orientation in earth-fixed/gravitational space.  Numerous studies involving peripersonal and extrapersonal neglect have shown that peripersonal space is located dorsally in the parietal lobe whereas extrapersonal space is housed ventrally in the temporal lobe.\nThe amygdala is suspected of processing people's strong reactions to personal space violations since these are absent in those in which it is damaged and it is activated when people are physically close. Research links the amygdala with emotional reactions to proximity to other people. First, it is activated by such proximity, and second, in those with complete bilateral damage to their amygdala, such as patient S.M., lack a sense of personal space boundary. As the researchers have noted: \"Our findings suggest that the amygdala may mediate the repulsive force that helps to maintain a minimum distance between people. Further, our findings are consistent with those in monkeys with bilateral amygdala lesions, who stay within closer proximity to other monkeys or people, an effect we suggest arises from the absence of strong emotional responses to personal space violation.\"\n\n\n=== Kinematics ===\nSome quantitative theories propose that the zone sizes are generated by the potential kinematics of the two agents, and their abilities to cause or avoid contact with one another.   Such models also suggest that the zone sizes and shapes should change according to the sizes and speeds of the agents.\n\n\n== Organization of space in territories ==\n\nWhile personal space describes the immediate space surrounding a person, territory refers to the area which a person may \"lay claim to\" and defend against others. There are four forms of human territory in proxemic theory. They are:\nPublic territory: a place where one may freely enter. This type of territory is rarely in the constant control of just one person. However, people might come to temporarily own areas of public territory.\nInteractional territory: a place where people congregate informally\nHome territory: a place where people continuously have control over their individual territory\nBody territory: the space immediately surrounding us\nThese different levels of territory, in addition to factors involving personal space, suggest ways for us to communicate and produce expectations of appropriate behavior.\nIn addition to spatial territories, the interpersonal territories between conversants can be determined by \"socio-petal socio-fugal axis\", or the \"angle formed by the axis of the conversants' shoulders\".  Hall has also studied combinations of postures between dyads (two people) including lying prone, sitting, or standing.\n\n\n== Cultural factors ==\nPersonal space is highly variable, due to cultural differences and personal preferences. On average, preferences vary significantly between countries. A 2017 study found that personal space preferences with respect to strangers ranged between more than 120 cm in Romania, Hungary and Saudi Arabia, and less than 90 cm in Argentina, Peru, Ukraine and Bulgaria.\nThe cultural practices of the United States show considerable similarities to those in northern and central European regions, such as Germany, Scandinavia, and the United Kingdom. Greeting rituals tend to be the same in Europe and in the United States, consisting of minimal body contact—often confined to a simple handshake. The main cultural difference in proxemics is that residents of the United States like to keep more open space between themselves and their conversation partners (roughly 4 feet (1.2 m) compared to 2 to 3 feet (0.6–0.9 m) in Europe). European cultural history has seen a change in personal space since Roman times, along with the boundaries of public and private space. This topic has been explored in A History of Private Life (2001), under the general editorship of Philippe Ariès and Georges Duby. On the other hand, those living in densely populated places likely have lower expectations of personal space. Residents of India or Japan tend to have a smaller personal space than those in the Mongolian steppe, both in regard to home and individual spaces. Different expectations of personal space can lead to difficulties in intercultural communication.\nHall notes that different culture types maintain different standards of personal space.  Realizing and recognizing these cultural differences improves cross-cultural understanding, and helps eliminate discomfort people may feel if the interpersonal distance is too large (\"stand-offish\") or too small (intrusive).\n\n\n== Adaptation ==\nPeople make exceptions to and modify their space requirements. A number of relationships may allow for personal space to be modified, including familial ties, romantic partners, friendships and close acquaintances, where there is a greater degree of trust and personal knowledge. Personal space is affected by a person's position in society, with more affluent individuals expecting a larger personal space. Personal space also varies by gender and age. Males typically use more personal space than females, and personal space has a positive relation to age (people use more as they get older). Most people have a fully developed (adult) sense of personal space by age twelve.\nUnder circumstances where normal space requirements cannot be met, such as in public transit or elevators, personal space requirements are modified accordingly. According to the psychologist Robert Sommer, one method of dealing with violated personal space is dehumanization. He argues that on the subway, crowded people often imagine those intruding on their personal space as inanimate. Behavior is another method:  a person attempting to talk to someone can often cause situations where one person steps forward to enter what they perceive as a conversational distance, and the person they are talking to can step back to restore their personal space.\n\n\n== Applications ==\n\n\n=== Architecture ===\nHall's original work on proxemics was conducted with the aim of informing architectural and urban planning practice, to design living and working spaces to better fit human needs and feelings, and to avoid behavioral sink. In particular, Hall emphasized the need for individuals to be allocated enough personal space for comfort, and the differences in these needs between cultures, especially the multiple, different, immigrant cultures found in large cities.\n\n\n=== Work psychology ===\nThe theory of proxemics is often considered in relation to the impact of technology on human relationships. While physical proximity cannot be achieved when people are connected virtually, perceived proximity can be attempted, and several studies have shown that it is a crucial indicator in the effectiveness of virtual communication technologies.  These studies suggest that various individual and situational factors influence how close we feel to another person, regardless of distance. The mere-exposure effect originally referred to the tendency of a person to positively favor those who they have been physically exposed to most often. However, recent research has extended this effect to virtual communication. This work suggests that the more someone communicates virtually with another person, the more he is able to envision that person's appearance and workspace, therefore fostering a sense of personal connection.  Increased communication has also been seen to foster common ground, or the feeling of identification with another, which leads to positive attributions about that person.  Some studies emphasize the importance of shared physical territory in achieving common ground, while others find that common ground can be achieved virtually, by communicating often.\nMuch research in the fields of communication, psychology, and sociology, especially under the category of organizational behavior, has shown that physical proximity enhances peoples' ability to work together. Face-to-face interaction is often used as a tool to maintain the culture, authority, and norms of an organization or workplace.  An extensive body of research has been written about how proximity is affected by the use of new communication technologies.  The importance of physical proximity in co-workers is often emphasized.\n\n\n=== Cinema ===\nProxemics is an essential component of cinematic mise-en-scène, the placement of characters, props and scenery within a frame, creating visual weight and movement.  There are two aspects to the consideration of proxemics in this context, the first being character proxemics, which addresses such questions as: How much space is there between the characters?, What is suggested by characters who are close to (or, conversely, far away from) each other?, Do distances change as the film progresses? and, Do distances depend on the film's other content? The other consideration is camera proxemics, which answers the single question: How far away is the camera from the characters/action?  Analysis of camera proxemics typically relates Hall's system of proxemic patterns to the camera angle used to create a specific shot, with the long shot or extreme long shot becoming the public proxemic, a full shot (sometimes called a figure shot, complete view, or medium long shot) becoming the social proxemic, the medium shot becoming the personal proxemic, and the close up or extreme close up becoming the intimate proxemic.\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\nFilm analyst Louis Giannetti has maintained that, in general, the greater the distance between the camera and the subject (in other words, the public proxemic), the more emotionally neutral the audience remains, whereas the closer the camera is to a character, the greater the audience's emotional attachment to that character.  Or, as actor/director Charlie Chaplin put it:   \"Life is a tragedy when seen in close-up, but a comedy in long shot.\"\n\n\n=== Education ===\nImplementing appropriate proxemic cues has been shown to improve success in monitored behavioral situations like psychotherapy by increasing patient trust for the therapist (see active listening). Instructional situations have likewise seen increased success in student performance by lessening the actual or perceived distance between the student and the educator (perceived distance is manipulated in the case of instructional videoconferencing, using technological tricks such as angling the frame and adjusting the zoom). Studies have shown that proxemic behavior is also affected when dealing with stigmatized minorities within a population. For example, those who do not have experience dealing with disabled persons tend to create more distance during encounters because they are uncomfortable. Others may judge that the disabled person needs to have an increase of touch, volume, or proximity.\n\n\n=== Virtual environments ===\nBailenson, Blascovich, Beall, and Loomis conducted an experiment in 2001, testing Argyle and Dean's (1965) equilibrium theory's speculation of an inverse relationship between mutual gaze, a nonverbal cue signaling intimacy, and interpersonal distance. Participants were immersed in a 3D virtual room in which a virtual human representation (that is, an embodied agent) stood. The focus of this study is on the subtle nonverbal exchanges that occur between a person and an embodied agent. Participants in the study clearly did not treat the agent as a mere animation. On the contrary, the results suggest that, in virtual environments, people were influenced by the 3D model and respected personal space of the humanoid representation. The result of the experiment also indicated that women are more affected by the gaze behaviors of the agent and adjust their personal space more accordingly than do men. However, men do subjectively assign gaze behavior to the agent, and their proxemic behavior reflects this perception. Furthermore, both men and women demonstrate less variance in their proxemic behavior when the agent displays mutual gaze behavior than when the agent does not.\nOther researchers have established that proxemics can be a valuable tool for measuring the behavioral realism of an agent or an avatar. People tend to perceive nonverbal gestures on an implicit level, and degree of personal space appears to be an accurate way to measure people's perception of social presence and realism in virtual environments.  Nick Yee in his PhD thesis at Stanford discovered that real world proxemic distances also were applied in the virtual world of Second Life. Other studies demonstrate that implicit behavioral measures such as body posture can be a reliable measure of the user's sense of presence in virtual environments. Similarly, personal space may be a more reliable measure of social presence than a typical ratings survey in immersive virtual environments.\n\n\n=== Social robotics ===\nProxemic zones have been proposed as tools to control interactions between autonomous robots and humans, such as between self-driving cars and pedestrians.  Robot navigation is often controlled using costmaps which these models link to proxemic zones.\n\n\n=== Cyberbullying ===\nCyberbullying is a communication phenomenon in which a bully utilizes electronic media in order to harass peers. Adolescents favor texting or  computer-mediated communication as an alternative to the more directly combative face-to-face interactions because it takes advantage of evading imposed social norms such as \"school rules\", which are likely to be especially repressive of aggression involving females. Online bullying has a lot in common with bullying in school: Both behaviors include harassment, humiliation, teasing, and aggression. Cyberbullying presents unique challenges in the sense that the perpetrator can attempt to be anonymous, and attacks can happen at any time of day or night.\nThe main factor that encourages cyberbullying is the fact that a cyberbully can hide behind the shield of online anonymity. In other words, social media magnifies the face-to-face social space into a virtual space where a cyberbully can say anything about the victims without the pressure of facing them.\n\n\n=== Social distancing ===\nDuring the COVID-19 pandemic, many countries enforced social distancing, the requirement to maintain a minimum distance between people at all times. These distances were typically larger than in normal interactions, and proxemics may help to explain the social effects of the change, including long-term changes in levels of interpersonal trust.\nIt has been suggested that the pandemic has made people adverse to hugs or handshakes, less trusting, and more transactional, as a long-term cultural change.  In an article in Psychology Today, author Jane Adams discussed \"boundary style\" as the way people behave when they come in contact with others. \"Some changes in how we interact with others may be temporary while others could be long-lasting,\" she says.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nT. Matthew Ciolek (September 1983). \"The Proxemics Lexicon: a first approximation\". Journal of Nonverbal Behavior. 8 (1): 55–75. doi:10.1007/BF00986330. S2CID 143452368.\nEdward T. Hall (1963). \"A System for the Notation of Proxemic Behaviour\". American Anthropologist. 65 (5): 1003–1026. doi:10.1525/aa.1963.65.5.02a00020.\nRobert Sommer (May 1967). \"Sociofugal Space\". The American Journal of Sociology. 72 (6): 654–660. doi:10.1086/224402. S2CID 222428003.\nLawson, Bryan (2001). \"Sociofugal and sociopetal space\". The Language of Space. Architectural Press. pp. 140–144. ISBN 978-0-7506-5246-9.\nHerrera, D. A. (2010). Gaze, turn-taking and proxemics in multiparty versus dyadic conversation across cultures (Ph.D.). The University of Texas at El Paso, United States—Texas. ISBN 9781124175645\nMcArthur, J.A. (2016). Digital Proxemics: How technology shapes the ways we move. Peter Lang. ISBN 9781454199403\nBusbea, Larry D. (2020). Proxemics and the Architecture of Social Interaction. Columbia Books on Architecture and the City (Columbia UP) ISBN 9781941332672",
  "links": {
    "Active listening": "",
    "Affect (linguistics)": "",
    "Affect display": "",
    "Aggression": "",
    "Amygdala": "",
    "Animal communication": "",
    "Aprosodia": "",
    "Asperger syndrome": "",
    "Assertiveness": "",
    "Attention (advertising)": ""
  },
  "url": "https://en.wikipedia.org/wiki/Proxemics"
}