{
  "title": "Sacred geometry",
  "content": "Sacred geometry ascribes symbolic and sacred meanings to certain geometric shapes and certain geometric proportions. It is associated with the belief of a divine creator of the universal geometer. The geometry used in the design and construction of religious structures such as churches, temples, mosques, religious monuments, altars, and tabernacles has sometimes been considered sacred. The concept applies also to sacred spaces such as temenoi, sacred groves, village greens, pagodas and holy wells, Mandala Gardens and the creation of religious and spiritual art.\n\n\n== As worldview and cosmology ==\n\nThe belief that a god created the universe according to a geometric plan has ancient origins. Plutarch attributed the belief to Plato, writing that \"Plato said God geometrizes continually\" (Convivialium disputationum, liber 8,2). In modern times, the mathematician Carl Friedrich Gauss adapted this quote, saying \"God arithmetizes\".\nJohannes Kepler (1571–1630) believed in the geometric underpinnings of the cosmos. Harvard mathematician Shing-Tung Yau expressed a belief in the centrality of geometry in 2010:\n\"Lest one conclude that geometry is little more than a well-calibrated ruler – and this is no knock against the ruler, which happens to be a technology I admire – geometry is one of the main avenues available to us for probing the universe. Physics and cosmology have been, almost by definition, absolutely crucial for making sense of the universe. Geometry's role in this may be less obvious, but is equally vital. I would go so far as to say that geometry not only deserves a place at the table alongside physics and cosmology, but in many ways, it is the table.\"\n\n\n== Natural forms ==\n\nAccording to Stephen Skinner, the study of sacred geometry has its roots in the study of nature, and the mathematical principles at work therein. Many forms observed in nature can be related to geometry; for example, the chambered nautilus grows at a constant rate and so its shell forms a logarithmic spiral to accommodate that growth without changing shape. Also, honeybees construct hexagonal cells to hold their honey.  These and other correspondences are sometimes interpreted in terms of sacred geometry and considered to be further proof of the natural significance of geometric forms.\n\n\n== Representations in art and architecture ==\n\nGeometric ratios, and geometric figures were often employed in the designs of ancient Egyptian, ancient Indian, Greek and Roman architecture. Medieval European cathedrals also incorporated symbolic geometry. Indian and Himalayan spiritual communities often constructed temples and fortifications on design plans of mandala and yantra. Mandala Vaatikas or Sacred Gardens were designed using the same principles.\nMany of the sacred geometry principles of the human body and of ancient architecture were compiled into the Vitruvian Man drawing by Leonardo da Vinci. The latter drawing was itself based on the much older writings of the Roman architect Vitruvius.\n\n\n=== In Buddhism ===\n\nMandalas are made up of a compilation of geometric shapes. In Buddhism, it is made up of concentric circles and squares that are equally placed from the center. Located within the geometric configurations are deities or suggestions of the deity, such as in the form of a symbol. This is because Buddhists believe that deities can actually manifest inside the mandala. Mandalas can be created with a variety of mediums. Tibetan Buddhists create mandalas out of sand that are then ritually destroyed. In order to create the mandala, two lines are first drawn on a predetermined grid. The lines, known as Brahman lines, must overlap at the precisely calculated center of the grid. The mandala is then divided into thirteen equal parts not by a mathematical calculation, but through trial and error. Next, monks purify the grid to prepare it for the constructing of the deities before sand is finally added. Tibetan Buddhists believe that anyone who looks at the mandala will receive positive energy and be blessed. Due to the Buddhist belief in impermanence, the mandala is eventually dismantled and is ritualistically released into the world.\n\n\n=== In Chinese spiritual traditions ===\nOne of the cornerstones of Chinese folk religion is the relationship between man and nature. This is epitomized in feng shui, which are architectural principles outlining the design plans of buildings in order to optimize the harmony of man and nature through the movement of Chi, or “life-generating energy.”  In order to maximize the flow of Chi throughout a building, its design plan must utilize specific shapes. Rectangles and squares are considered to be the best shapes to use in feng shui design. This is because other shapes may obstruct the flow of Chi from one room to the next due to what are considered to be unnatural angles. Room layout is also an important element, as doors should be proportional to one another and located at appropriate positions throughout the house. Typically, doors are not situated across from one another because it may cause Chi to flow too fast from one room to the next.\nThe Forbidden City is an example of a building that uses sacred geometry through the principles of feng shui in its design plan. It is laid out in the shape of a rectangle that measures over half a mile long and about half a mile wide. Furthermore, the Forbidden City constructed its most important buildings on a central axis. The Hall of Supreme Harmony, which was the Emperor’s throne room, is located at the midpoint or “epicenter” of the central axis. This was done intentionally, as it was meant to show that when the Emperor entered this room, he would be ceremonially transformed into the center of the universe.\n\n\n=== In Islam ===\nThe geometric designs in Islamic art are often built on combinations of repeated squares and circles, which may be overlapped and interlaced, as can arabesques (with which they are often combined), to form intricate and complex patterns, including a wide variety of tessellations. These may constitute the entire decoration, may form a framework for floral or calligraphic embellishments, or may retreat into the background around other motifs. The complexity and variety of patterns used evolved from simple stars and lozenges in the ninth century, through a variety of 6- to 13-point patterns by the 13th century, and finally to include also 14- and 16-point stars in the sixteenth century.\nGeometric patterns occur in a variety of forms in Islamic art and architecture including kilim carpets, Persian girih and Moroccan/Algerian zellige tilework, muqarnas decorative vaulting, jali pierced stone screens, ceramics, leather, stained glass, woodwork, and metalwork.\nIslamic geometric patterns are used in the Quran, Mosques and even in the calligraphies.\n\n\n=== In Hinduism/Indic Religion ===\n\nThe Agamas are a collection of Sanskrit, Tamil, and Grantha scriptures chiefly constituting the methods of temple construction and creation of idols, worship means of deities, philosophical doctrines, meditative practices, attainment of sixfold desires, and four kinds of yoga.\nElaborate rules are laid out in the Agamas for Shilpa (the art of sculpture) describing the quality requirements of such matters as the places where temples are to be built, the kinds of image to be installed, the materials from which they are to be made, their dimensions, proportions, air circulation, and lighting in the temple complex. The Manasara and Silpasara are works that deal with these rules. The rituals of daily worship at the temple also follow rules laid out in the Agamas.\nHindu temples, the symbolic representation of cosmic model is then projected onto Hindu temples using the Vastu Shastra principle of Sukha Darshan, which states that smaller parts of the temple should be self-similar and a replica of the whole. The repetition of these replication parts symbolizes the natural phenomena of fractal patterns found in nature. These patterns make up the exterior of Hindu temples. Each element and detail are proportional to each other, this occurrence is also known as the sacred geometry.\n\n\n=== In Christianity ===\nThe construction of Medieval European cathedrals was often based on geometries intended to make the viewer see the world through mathematics, and through this understanding, gain a better understanding of the divine. These churches frequently featured a Latin Cross floor-plan.\nAt the beginning of the Renaissance in Europe, views shifted to favor simple and regular geometries. The circle in particular became a central and symbolic shape for the base of buildings, as it represented the perfection of nature and the centrality of man's place in the universe. The use of the circle and other simple and symmetrical geometric shapes was solidified as a staple of Renaissance sacred architecture in Leon Battista Alberti's architectural treatise, which described the ideal church in terms of spiritual geometry.\nIn the High Middle Ages, leading Christian philosophers explained the layout of the universe in terms of a microcosm analogy. In her book describing the divine visions she witnessed, Hildegard of Bingen explains that she saw an outstretched human figure located within a circular orb. When interpreted by theologians, the human figure was Christ and mankind showing the Earthly realm and the circumference of the circle was a representation of the universe. Some images also show above the universe a depiction of God. This is thought to later have inspired Da Vinci’s Vitruvian Man.\nDante uses circles to make up the nine layers of hell categorized in his book, The Divine Comedy. “Celestial spheres” are also utilized to make up the nine layers of Paradise. He further creates a cosmic order of circular forms that stretches from Jerusalem in the Earthly realm up to God in Heaven. This cosmology is believed to have been inspired by the ancient astronomer Ptolemy.\n\n\n== Unanchored geometry ==\nStephen Skinner criticizes the tendency of some writers to place a geometric diagram over virtually any image of a natural object or human created structure, find some lines intersecting the image and declare it based on sacred geometry. If the geometric diagram does not intersect major physical points in the image, the result is what Skinner calls \"unanchored geometry\".\n\n\n== Notable artists ==\nHildegard of Bingen\nHilma af Klint\nOlga Fröbe-Kapteyn\nCarl Jung\n\n\n== See also ==\nCircle dance\nGolden Ratio\nHarmony of the spheres\nLu Ban and Feng shui\nMagic circle\nNumerology\nShield of the Trinity\n108 (number)\n\n\n== References ==\n\n\n== Further reading ==\nBain, George. Celtic Art: The Methods of Construction. Dover, 1973. ISBN 0-486-22923-8.\nBromwell, Henry P. H. (2010). Townley, Kevin (ed.). Restorations of Masonic Geometry and Symbolry: Being a Dissertation on the Lost Knowledges of the Lodge. Lovers of the Craft. ISBN 978-0-9713441-5-0. Archived from the original on 2012-02-03. Retrieved Jan 7, 2012.\nBamford, Christopher, Homage to Pythagoras: Rediscovering Sacred Science, Lindisfarne Press, 1994, ISBN 0-940262-63-0\nCritchlow, Keith (1970). Order In Space: A Design Source Book. New York: Viking.\nCritchlow, Keith (1976). Islamic Patterns: An Analytical and Cosmological Approach. Schocken Books. ISBN 978-0-8052-3627-9.\nIamblichus; Robin Waterfield; Keith Critchlow; Translated by Robin Waterfield (1988). The Theology of Arithmetic: On the Mystical, Mathematical and Cosmological Symbolism of the First Ten Numbers. Phanes Press. ISBN 978-0-933999-72-5.\nJohnson, Anthony: Solving Stonehenge, the New Key to an Ancient Enigma. Thames & Hudson 2008 ISBN 978-0-500-05155-9\nLesser, George (1957–64). Gothic cathedrals and sacred geometry. London: A. Tiranti.\nLawlor, Robert. Sacred Geometry: Philosophy and practice (Art and Imagination). Thames & Hudson, 1989 (1st edition 1979, 1980, or 1982). ISBN 0-500-81030-3.\nLippard, Lucy R. Overlay: Contemporary Art and the Art of Prehistory. Pantheon Books New York 1983 ISBN 0-394-51812-8\nMann, A. T. Sacred Architecture, Element Books, 1993, ISBN 1-84333-355-4.\nMichell, John. City of Revelation. Abacus, 1972. ISBN 0-349-12320-9.\nSchneider, Michael S. A Beginner's Guide to Constructing the Universe: Mathematical Archetypes of Nature, Art, and Science. Harper, 1995. ISBN 0-06-092671-6\nSteiner, Rudolf; Creeger, Catherine (2001). The Fourth Dimension : Sacred Geometry, Alchemy, and Mathematics. Anthroposophic Press. ISBN 978-0-88010-472-2.\nThe Golden Mean, Parabola magazine, v.16, n.4 (1991)\nWest, John Anthony, Inaugural Lines: Sacred geometry at St. John the Divine, Parabola magazine, v.8, n.1, Spring 1983.\n\n\n== External links ==",
  "links": {
    "108 (number)": "",
    "A Mathematician's Apology": "",
    "A Treatise on Painting": "",
    "Alba Rojo Cama": "",
    "Albrecht Dürer": "",
    "Algorithm": "",
    "Algorithmic art": "",
    "Altar": "",
    "Anagram": "",
    "Anamorphosis": ""
  },
  "url": "https://en.wikipedia.org/wiki/Sacred_geometry"
}