{
  "title": "Santosha",
  "content": "Santosha (skt. संतोष saṃtoṣa) literally means \"contentment, satisfaction\". It is also an ethical concept in Indian philosophy, particularly Yoga, where it is included as one of the Niyamas by Patanjali.\n\n\n== Definition ==\nSantosha, sometimes spelled Santosa, is a portmanteau in Sanskrit, derived from Saṃ- prefix (सं-, सम्-) and Tosha (तोष (from root √तुष्, √tuṣ)). SaM-, means \"completely\", \"altogether\" or \"entirely\", and Tosha (from the root √tus), \"contentment\", \"satisfaction\", \"acceptance\", \"being comfortable\". Combined, the word Santosha means \"completely content with, or satisfied with, accepting and comfortable\". Other words based on the root Tuṣht (तुष्टः), such as Santusht (सन्तुष्ट) and Tushayati (तुष्यति) are synonymous with Santosha, and found in ancient and medieval era Indian texts.\nIsaacs translates Santosha as “contentment, accepting one's circumstances”. Woods describes it as the lack of Trsna (तृष्णा, craving) and desiring that which is necessary for one's life, while translating verse II.42 and II.32 of Yoga Sutrās, respectively. Others define it as an attitude of contentment, one of understanding and accepting oneself and one's environment and circumstances as they are, a spiritual state necessary for optimism and effort to change the future. Bhatta clarifies Santosha as inner contentment, a state of inner peace.\nYoga Darshana, which includes commentary of Rishi Vyasa on Patanjali's Yogasutra, defines contentment as the inner state where, \"exists a joyful and satisfied mind regardless of one's environment, whether one meets with pleasure or pain, profit or loss, fame or contempt, success or failure, sympathy or hatred\".\n\n\n== Discussion ==\nSantosha as a Niyama is discussed in Indian texts at various levels - intent, inner state and its expression. As intent, Santosha is doing one's best and accepting the results of one's efforts. As inner state, it is contentment that combines with and works with other virtues such as Asteya (non-coveting, non-stealing), Aparigraha (non-hoarding, non-possessiveness) and Daya (compassion for others). As outward expression, Santosha is the observed \"serenity\", of being “totally satisfied, not desiring anything other than the fundamental\".\nMaréchal states that Santosha is rooted in the desire to avoid anything negative to self, to others, to all living beings and to nature. It is not the state of abandonment or being without any needs, rather the state of neither taking too much nor taking less than what one needs, one of contented optimism. It is the habit of being able to accept circumstances one finds self in, without being upset, of accepting oneself, and of equanimity with others who are balancing their own needs as they share what they have. Santosha is also abstaining from taking and consuming something to excess, even if its appearance makes it tempting. Maréchal states, that in cases the environment is one where one is forced to listen to a painful speech or someone's anger, Santosha is the serenity of accepting it completely as an instructive and constructive message, understanding the other, then detaching oneself and patiently seeking reform and change in one's environment.\nŚankarâchârya, of the Vedanta school of Hinduism, in verses 521-548 of the text Vivekachudamani (The Crest-Jewel of Wisdom), states that Santosha is a necessary virtue because it frees a human being from the compulsions of all bondage, manipulation and fears, whereafter he can \"dwell according to his will\", do what he thinks is right, pursue his own calling wherever, whenever and however he wants. Johnston translates Śankarâchârya view on Santosha as the inner state where, \"things neither distress him nor elate him much, nor is he attached to or repelled by them; in his own Self he ever joys, the Self is his rejoicing; altogether contented by the essence of uninterrupted bliss; with Santosha (contentment), he knows his Self – the Eternal, he is free from bondage, he is delighted no matter what, his life is victory; he moves where fancy leads him, unconstrained; he sleeps by the river-bank or the wood, his couch is the world; he moves in paths where the beaten road has ended; he then is one delighting in the supreme Eternal\".\n\n\n== Literature ==\nSantosha is a broadly discussed virtue in over thirty five ancient and medieval era texts of Hinduism. Most of these are in Sanskrit, but some are in regional Indian languages. As a few examples, Santosha is discussed as an important virtue and ethical concept in verses 2.1.39 through 2.1.48 of Purana Samhita, verse I.218-12 of Garuda Purana, verse 11-20 of Kurma Purana, verse 19.18 of Prapancha Sara, verse 24.156 of Paramananda, verse 3.18 of Shandilya Yoga Shastra, verses 2.1 to 2.2 of Yoga Yajnavalkya, and in verses 1.53 through 1.66 of Vasishtha Samhita. In some texts, such as Trishikhi Brahmana Upanishad and Sutrās, synonymous concepts and words such as Santusti (सन्तुष्टि) and Akama (अकाम, non-desire, non-neediness) are used, calling it as a virtue that represents \"affection for the Supreme Reality\". Samkhya Karika, in its section on ethics and the effect of virtues and vices on a human being, states contentment is achieved in nine categories, four of which are external and five internal to him.\nYoga Vashista describes the path to Santosha as follows,\n\nThere are four soldiers who guard the road to moksha (liberation). They are Patience (or peace of mind), Atma (आत्म, Self) Inquiry, Santosha (Contentment), and Association with the Wise. If you can succeed in making one of these a friend, then the others will be easy. That one will introduce you to the other three.\nIn the Indian Epic Mahabharata, the virtue of Santosha is discussed in many books. For example, in Shanti Parva (the Book of Peace),\n\nSantosha (contentment) is the highest heaven, santosha is the highest bliss. There is no higher experience than santosha. When one draws away all his craving desires like a tortoise drawing in all it limbs, then the natural resplendence of his soul soon manifests itself. When one does not fear any creature, nor any creature is frightened by him, when one conquers one's cravings and aversion, then is one said to behold one's soul. When one, indeed, in word and thought, seeks to injure nobody and cherishes no desire, one is said to attain Brahman (consciousness-bliss).\n\nTo the man of knowledge, all that is perceived, there is both Sat and Asat. To him, this all is both the end and the middle. This truth is in all the Vedas. Then again the highest contentment (Santosha) rests upon Emancipation, which is absolute, which exists as the Soul of all mortal and immortal things, which is well-known as Universal Soul, which is the highest object of knowledge, which is everywhere, which is in everyone and everything, which is full, which is perfect intense happiness, which is without duality, which is the foremost of all things, which is Brahma, which is Unmanifest and the Cause also, from which the Unmanifest has sprung, and which never deteriorates. Ability to sense beyond the senses, the ability to forgive, and the ability to abstain from craving superficial desires – these together are the causes of perfect, intense happiness.\n\n\n== Mythology ==\nThe Vishnu Purana recites a myth that includes Santosha as a progeny of Tushti and Dharma, and it is loaded with symbolism. The myth is as follows,\n\nThe progeny of Dharma by the daughters of Daksha were as follows: by Sraddhá (devotion) he had Kama (desire); by Lakshmí (wealth, prosperity), was born Darpa (pride); by Dhriti (courage), the progeny was Niyama (precept); by Tusht́i (inner comfort), Santosha (contentment); by Pusht́i (opulence), the progeny was Lobha (cupidity, greed); by Medhá (wisdom, experience), Sruta (sacred tradition); by Kriyá (hard work, labour), the progeny were Dańd́a, Naya, and Vinaya (justice, politics, and education); by Buddhi (intellect), Bodha (understanding); by Lajjá (shame, humility), Vinaya (good behaviour); by Vapu (body, strength), Vyavasaya (perseverance). Shanti (peace) gave birth to Kshama (forgiveness); Siddhi (excellence) to Sukha (enjoyment); and Kírtti (glorious speech) gave birth to Yasha (reputation). These were the sons of Dharma; one of whom, Kama (love, emotional fulfillment) had baby Hersha (joy) by his wife Nandi (delight).\n\nThe wife of Adharma (vice, wrong, evil) was Hinsá (violence), on whom he begot a son Anrita (falsehood), and a daughter Nikriti (immorality): they intermarried, and had two sons, Bhaya (fear) and Naraka (hell); and twins to them, two daughters, Máyá (deceit) and Vedaná (torture), who became their wives. The son of Bhaya (fear) and Máyá (deceit) was the destroyer of living creatures, or Mrityu (death); and Dukha (pain) was the offspring of Naraka (hell) and Vedaná (torture). The children of Mrityu were Vyádhi (disease), Jará (decay), Soka (sorrow), Trishńa (greediness), and Krodha (wrath). These are all called the inflictors of misery, and are characterised as the progeny of Vice (Adharma). They are all without wives, without posterity, without the faculty to procreate; they perpetually operate as causes of the destruction of this world. On the contrary, Daksha and the other Rishis, the elders of mankind, tend perpetually to influence its renovation: whilst the Manus and their sons, the heroes endowed with mighty power, and treading in the path of truth, as constantly contribute to its preservation.\n\n\n== The desire paradox ==\nScholars have questioned whether contentment (Santosha) is equal to having the \"desire to be without desire\", and if so, is it a paradox in itself? This question is of interest to both Hinduism and Buddhism. Herman states that there is a difference between the mindless pursuit of \"craving\" and mindful pursuit of \"needs\". The former is of concern to Indian philosophies, while for latter they acknowledge and encourage the proper pursuit of \"needs\".\nCraving is an intense, ever-expansive compulsion to hoarding material possessions, an addiction for something or someone, and a state where the person accumulates the target of his greed or lust while ignoring dharma. Contentment is the opposite state, free from cravings that create bondage and dependence, an understanding of the minimum he needs and alternate ways to meet those needs, thus liberated to do whatever he wants and what feels right, proper, meaningful to him. Proper and simultaneous pursuit of dharma, artha and kama is respected in Hindu texts. For example, in Book 9, the Shalya Parva of the Epic Mahabharata, the proper and simultaneous pursuit of artha (wealth, profit, means of livelihood), dharma (righteousness, morality, ethics) and kama (love, pleasure, emotional contentment) is recommended,\n\n धर्मः सुचरितः सद्भिः सह दवाभ्यां नियच्छति\n अर्थश चात्यर्थ लुब्धस्य कामश चातिप्रसङ्गिनः\n धर्मार्थौ धर्मकामौ च कामार्थौ चाप्य अपीडयन\n धर्मार्थकामान यॊ भयेति सॊ तयन्तं सुखम अश्नुते\n\nMorality (Dharma) is well practiced by the good. Morality, however, is always afflicted by two things, the desire of Profit (Artha) entertained by those that covet it, and the desire for Pleasure (Kama) cherished by those that are wedded to it. Whoever without afflicting Morality and Profit, or Morality and Pleasure, or Pleasure and Profit, followeth all three – Morality, Profit and Pleasure – always succeeds in obtaining great happiness.\nIn cases where there is conflict between Artha, Kama and Dharma, Vatsyayana states Artha precedes Kama, while Dharma precedes both Kama and Artha.\n\n\n== References ==\n\n\n== Further reading ==\nT.M.P. Mahadevan, The Pañcadaśī of Bhāratītīrtha-Vidyāraṇya: An Interpretative Exposition, Chapter 7 - Elucidation of Contentment, Centre of Advanced Study in Philosophy, University of Madras, 1969, OCLC 663724",
  "links": {
    "A. C. Bhaktivedanta Swami Prabhupada": "",
    "Abhinavagupta": "",
    "Abirami Antati": "",
    "Achintya Bheda Abheda": "",
    "Achourya": "",
    "Adi Shankara": "",
    "Adimurai": "",
    "Adityas": "",
    "Advaita Vedanta": "",
    "Agama (Hinduism)": ""
  },
  "url": "https://en.wikipedia.org/wiki/Santosha"
}