{
  "title": "Subtle body",
  "content": "A subtle body is a \"quasi material\" aspect of the human body, being neither solely physical nor solely spiritual, according to various esoteric, occult, and mystical teachings. This contrasts with the mind–body dualism that has dominated Western thought. The subtle body is important in the Taoism of China and Dharmic religions such as Hinduism, Buddhism, and Jainism, mainly in the branches which focus on tantra and yoga, where it is known as the Sūkṣma-śarīra (Sanskrit: सूक्ष्म शरीर). However, while mostly associated with Asian cultures, non-dualistic approaches to the mind and body are found in many parts of the world.\nSubtle body concepts and practices can be identified as early as 2nd century BCE in Taoist texts found in the Mawangdui tombs. It was \"evidently present\" in Indian thought as early as the 4th to 1st century BCE when the Taittiriya Upanishad described the  Panchakoshas, a series of five interpenetrating sheaths of the body. A fully formed subtle body theory did not develop in India until the tantric movement that affected all its religions in the Middle Ages. In Indo-Tibetan Buddhism, the correlation of the subtle body to the physical body is viewed differently according to school, lineage and scholar, but for completion stage in yoga, it is visualised within the body. The subtle body consists of focal points, often called chakras, connected by channels, often called nadis, that convey subtle breath, often called prana. Through breathing and other exercises, a practitioner may direct the subtle breath to achieve supernormal powers, immortality, or liberation.\nSubtle body in the Western tradition is called the body of light. The concept derives from the philosophy of Plato: the word 'astral' means 'of the stars'; thus the astral plane  consists of the Seven Heavens of the classical planets. Neoplatonists Porphyry and Proclus elaborated on Plato's description of the starry nature of the human psyche. Throughout the Renaissance, philosophers and alchemists, healers including Paracelsus and his students, and natural scientists such as John Dee, continued to discuss the nature of the astral world intermediate between earth and the divine. The concept of the astral body or body of light was adopted by 19th and 20th-century ceremonial magicians.\nThe Theosophy movement was the first to translate the Sanskrit term as 'subtle body', although their use of the term is quite different from Indic usage as they synthesize Western and Eastern traditions. This makes the term problematic for modern scholars, especially as the Theosophist view often influences New Age and holistic medicine perspectives. Western scientists have started to explore the subtle body concept in research on meditation.\n\n\n== Asian religions ==\nThe Yogic, Tantric and other systems of Hinduism, Vajrayana Buddhism, as well as Chinese Taoist alchemy contain theories of subtle physiology with focal points (chakras, acupuncture points) connected by a series of channels (nadis, meridians) that convey subtle breath (prana, vayu, ch'i, ki, lung). These invisible channels and points are understood to determine the characteristics of the visible physical form. By understanding and mastering the subtlest levels of reality one gains mastery over the physical realm. Through breathing and other exercises, the practitioner aims to manipulate and direct the flow of subtle breath, to achieve supernormal powers (siddhis) and attain higher states of consciousness, immortality, or liberation.\n\n\n=== Hinduism ===\n\n\n==== Early ====\nEarly concepts of the subtle body (Sanskrit: sūkṣma śarīra) appeared in the Upanishads, including the Brhadaranyaka Upanishad and the Katha Upanishad. The Taittiriya Upanishad describes the theory of five koshas or sheaths, though these are not to be thought of as concentric layers, but interpenetrating at successive levels of subtlety:\n\nThe anna-maya (\"food body\", physical body, the grossest level),\nThe prana-maya (body made of vital breath or prana),\nThe mano-maya (body made of mind),\nThe vijñana-maya (body made of consciousness)\nThe ananda-maya (bliss body, the subtlest level).\nSubtle internal anatomy included a central channel (nadi). Later Vedic texts called samhitas and brahmanas contain a theory of five \"winds\" or \"breaths\" (vayus, pranas):\n\nPrāṇa, associated with inhalation\nUḍāna, associated with exhalation\nVyāna, associated with distribution of breath within the body\nSamāna, associated with digestion\nApāna, associated with excretion of waste\n\n\n==== Later ====\nA millennium later, these concepts were adapted and refined by various spiritual traditions. The similar concept of the Liṅga Śarīra is seen as the vehicle of consciousness in later Samkhya, Vedanta, and Yoga, and is propelled by past-life tendencies, or bhavas. Linga can be translated as \"characteristic mark\" or \"impermanence\" and the Vedanta term sarira as \"form\" or \"mould\". Karana or \"instrument\" is a synonymous term. In the Classical Samkhya system of Isvarakrsna (ca. 4th century CE), the Lińga is the characteristic mark of the transmigrating entity. It consists of twenty-five tattvas from eternal consciousness down to the five organs of sense, five of activity (buddindriya or jñānendriya, and  karmendriya respectively) and the five subtle elements that are the objects of sense (tanmatras) The Samkhyakarika says:\n\nThe subtle body (linga), previously arisen, unconfined, constant, inclusive of the great one (mahat) etc, through the subtle elements, not having enjoyment, transmigrates, (because of) being endowed with bhavas (\"conditions\" or \"dispositions\").\nAs a picture (does) not (exist) without a support, or as a shadow (does) not (exist) without a post and so forth; so too the instrument (linga or karana) does not exist without that which is specific (i.e., a subtle body).\nThe classical Vedanta tradition developed the theory of the five bodies into the theory of the koshas \"sheaths\" or \"coverings\" which surround and obscure the self (atman). In classical Vedanta these are seen as obstacles to realization and traditions like Shankara's Advaita Vedanta had little interest in working with the subtle body.\n\n\n==== Tantra ====\nIn Tantra traditions meanwhile (Shaiva Kaula, Kashmir Shaivism and Buddhist Vajrayana), the subtle body was seen in a more positive light, offering potential for yogic practices which could lead to liberation. Tantric traditions contain the most complex theories of the subtle body, with sophisticated descriptions of energy nadis (literally \"stream or river\", channels through which vayu and prana flows) and chakras, points of focus where nadis meet.\nThe main channels, shared by both Hindu and Buddhist systems, but visualised entirely differently, are the central (in Hindu systems: sushumna; in Buddhist: avadhuti), left and right (in Hindu systems: ida and pingala; Buddhist: lalana and rasana). Further subsidiary channels are said to radiate outwards from the chakras, where the main channels meet.\nChakra systems vary with the tantra; the Netra Tantra describes six chakras, the Kaulajñana-nirnaya describes eight, and the Kubjikamata Tantra describes seven (the most widely known set).\nIn the Dzogchen tradition of Tibetan Buddhism, the subtle body takes a different form. More specifically, the tradition points to four areas of particularly concentration of bodily energy – viz. the heart (tsitta), where the enlightened energy resides; the \"luminous channels\" (‘od rtsa), through which the energy flows; the skull (dung khang), where it spreads before finally being released through the fourth hot-spot, namely the eyes (tsakshu / briguta).: 63  Flavio Geisshuesler, who has studied the functioning of the Dzogchen subtle body in the context of the practice of sky-gazing, argues that many of the specific motifs that appear in the tradition's conception of the body are of pre-Buddhist origin. More specifically, he notes that the Dzogchen body's motifs of \"deer-hearts, silk-channels, buffalo-horns, or far-reaching lassos [...] reproduce the terminology of the hunting of animalistic vitality as if internalizing the quest for precious substances.\"\n\n\n==== Modern ====\nThe modern Indian spiritual teacher Meher Baba stated that the subtle body \"is the vehicle of desires and vital forces\". He held that the subtle body is one of three bodies with which the soul must cease to identify with in order to realize God.\n\n\n=== Buddhism ===\n\nIn Buddhist Tantra, the subtle body is termed the \"innate body\" (nija-deha) or the \"uncommon means body\" (asadhdrana-upayadeha), or sūkṣma śarīra, rendered in Tibetan as traway-lu (transliterated phra ba’i lus). The subtle body is sometimes known as manomaya-kāya, the “body made of mind” and is the means for synchronising the body and the mind, particularly during meditation.\nThe subtle body consists of thousands of subtle energy channels (nadis), which are conduits for energies or \"winds\" (lung or prana) and converge at chakras. According to Dagsay Tulku Rinpoche, there are three main channels (nadis), central, left and right, which run from the point between the eyebrows up to the crown chakra, and down through all seven chakras to a point two inches below the navel.\nLati Rinbochay describes the subtle body as consisting of 72,000 channels, various winds and a white and a red drop whilst a further very subtle body is a wind abiding in a drop at the centre of the heart chakra. The central channel is then described as being squeezed by two channels that encircle it at each chakra and thrice at the heart chakra, ensuring the winds do not move upward or downward until death.\n\nBuddhist tantras generally describe four or five chakras in the shape of a lotus with varying petals. For example, the Hevajra Tantra (8th century) states:In the Center [i.e. chakra] of Creation [at the sexual organ] a sixty-four petal lotus. In the Center of Essential Nature [at the heart] an eight petal lotus. In the Center of Enjoyment [at the throat] a sixteen petal lotus. In the Center of Great Bliss [at the top of the head] a thirty-two petal lotus.In contrast, the historically later Kalachakra tantra describes six chakras.\nIn Vajrayana Buddhism, liberation is achieved through subtle body processes during Completion Stage practices such as the Six Yogas of Naropa.\n\n\n=== Other traditions ===\nOther spiritual traditions teach about a mystical or divine body, such as \"the most sacred body\" (wujud al-aqdas) and \"true and genuine body\" (jism asli haqiqi) in Sufism, the meridian system in Chinese religion, and \"the immortal body\" (soma athanaton) in Hermeticism.\n\n\n== Western esoteric tradition ==\n\nThe body of light is elaborated on according to various Western esoteric, occult, and mystical teachings. Other terms used for this body include body of glory, spirit-body, radiant body, luciform body, augoeides ('radiant'), astroeides ('starry' or 'sidereal body'), and celestial body.\nThe concept derives from the philosophy of Plato: the word 'astral' means 'of the stars'; thus the astral plane  consists of the Seven Heavens of the classical planets.  The idea is rooted in common worldwide religious accounts of the afterlife in which the soul's journey or \"ascent\" is described in such terms as \"an ecstatic, mystical or out-of body experience, wherein the spiritual traveller leaves the physical body and travels in their body of light into 'higher' realms.\"\nNeoplatonists Porphyry and Proclus elaborated on Plato's description of the starry nature of the human psyche. Throughout the Renaissance, philosophers and alchemists, healers including Paracelsus and his students, and natural scientists such as John Dee, continued to discuss the nature of the astral world intermediate between earth and the divine. The concept of the astral body or body of light was adopted by 19th-century ceremonial magician Éliphas Lévi, Florence Farr and the magicians of the Hermetic Order of the Golden Dawn, including Aleister Crowley.\n\n\n== Western syncretic tradition ==\n\n\n=== Theosophy ===\nIn the 19th century, H. P. Blavatsky founded the esoteric religious system of Theosophy, which attempted to restate Hindu and Buddhist philosophy for the Western world. She adopted the phrase \"subtle body\" as the English equivalent of the Vedantic sūkṣmaśarīra, which in Adi Shankara's writings was one of three bodies (physical, subtle, and causal). Geoffrey Samuel notes that theosophical use of these terms by Blavatsky and later authors, especially C. W. Leadbeater, Annie Besant and Rudolf Steiner (who went on to found Anthroposophy), has made them \"problematic\" to modern scholars, since the Theosophists adapted the terms as they expanded their ideas based on \"psychic and clairvoyant insights\", changing their meaning from what they had in their original context in India.\n\n\n=== Post-theosophists ===\nThe later theosophical arrangement was taken up by Alice Bailey, and from there found its way into the New Age worldview and the human aura. Other authors treated the subtle body in varying ways. Max Heindel divided the subtle body into the Vital Body made of Ether; the Desire body, related to the Astral plane; and the Mental body. Barbara Brennan's account of the subtle bodies in her books Hands of Light and Light Emerging refers to the subtle bodies as \"layers\" in the \"Human Energy Field\" or aura.\n\n\n=== Fourth Way ===\nSubtle bodies are found in the \"Fourth Way\" teachings of Gurdjieff and Ouspensky, who write that one can create a subtle body, and hence achieve post-mortem immortality, through spiritual or yogic exercises. The \"soul\" in these systems is not something one is born with, but developed through esoteric practice to acquire complete understanding and to perfect the self. According to the historian Bernice Rosenthal, \"In Gurdjieff's cosmology our nature is tripartite and is composed of the physical (planetary), emotional (astral) and mental (spiritual) bodies; in each person one of these three bodies ultimately achieves dominance.\" The \"divine body\" represents a fourth way, and the ultimate task of the teachings is to harmoniously develop the four ways into a single way.\n\n\n== Meditation research ==\nWestern scientists have started to explore the subtle body concept in relation to research on meditation. The subtle body model can be cross-referenced onto modern maps of the central nervous system, and applied in research on meditation.\n\n\n== See also ==\nSaṃbhogakāya\nSpirit body (Mormonism)\n\n\n== References ==\n\n\n== Works cited ==\nBehun, W. (2010). \"The Body of Light and the Body without Organs\". Substance: A Review of Theory & Literary Criticism. 39 (1): 125–140.\nHeindel, Max (1911). \"Chapter IV: The Constitution of Man: Vital Body - Desire Body - Mind\". The Rosicrucian Mysteries. Rosicrucian Fellowship. ISBN 0-911274-86-3.\nLarson, Gerald James (2005). Classical Samkhya : an interpretation of its history and meaning. Motilal Banarsidass. ISBN 978-81-208-0503-3. OCLC 637247445.\nMallinson, James & Singleton, Mark (2017). Roots of Yoga. Penguin Books. ISBN 978-0-241-25304-5. OCLC 928480104.\nMead, G. R. S. (1919). The Doctrine of the Subtle Body in Western Tradition. Watkins.\nMiller, Suki (1995). After Death: How People around the World Map the Journey after Death.\nSamuel, Geoffrey (2013). Religion and the subtle body in Asia and the West : between mind and body. Routledge. ISBN 978-0-415-60811-4. OCLC 690084604.\nSamuel, G.; Johnston, J. (2013). Religion and the Subtle Body in Asia and the West: Between Mind and Body. Routledge studies in Asian religion and philosophy. Taylor & Francis. ISBN 978-1-136-76640-4.\nSimmer-Brown, J. (2002). Dakini's Warm Breath: The Feminine Principle in Tibetan Buddhism. Shambhala. ISBN 978-1-57062-920-4.\nWhite, John (May 2018). \"Enlightenment and the Body of Light\". Journal of Conscious Evolution. 1 (1). Retrieved 6 January 2022.\nWoolger, Roger J. (n.d.). \"Beyond Death: Transition and the Afterlife\" (PDF). Royal College of Psychiatrists. Archived from the original (PDF) on 2 October 2008.\n\n\n== Further reading ==\nDale, Cyndi (2014). The Subtle Body: An Encyclopedia of Your Energetic Anatomy. Sounds True. ISBN 978-1591798279.\nEliade, Mircea (1969). Yoga: Immortality and Freedom. Translated by W. R. Trask. Princeton University Press.\nPoortman, J. J. (1978). Vehicles of Consciousness; The Concept of Hylic Pluralism (Ochema). Vol. I–IV. The Theosophical Society in Netherlands.\nSamuel, G. (June 2019). \"Unbalanced Flows in the Subtle Body: Tibetan Understandings of Psychiatric Illness and How to Deal With It\". J Relig Health. 58 (3): 770–794. doi:10.1007/s10943-019-00774-1. PMC 6522444. PMID 30788755.\nWhite, David Gordon (2012). The Alchemical Body: Siddha Traditions in Medieval India. University of Chicago Press. ISBN 978-0226149349.",
  "links": {
    "Acupuncture points": "",
    "Adi Shankara": "",
    "Advaita Vedanta": "",
    "Afterlife": "",
    "Aghor Yoga": "",
    "Aleister Crowley": "",
    "Alice Bailey": "",
    "Altered state of consciousness": "",
    "Amaraugha Prabodha": "",
    "Amritasiddhi": ""
  },
  "url": "https://en.wikipedia.org/wiki/Subtle_body"
}