{
  "title": "Sustainable consumption",
  "content": "Sustainable consumption (sometimes abbreviated to \"SC\") is the use of products and services in ways that minimizes impacts on the environment.\nSustainable consumption can be undertaken in such a way that needs are met for present-day humans and also for future generations. Sustainable consumption is often paralleled with sustainable production; consumption refers to use and disposal (or recycling) not just by individuals and households, but also by governments, businesses, and other organizations. Sustainable consumption is closely related to sustainable production and sustainable lifestyles. \"A sustainable lifestyle minimizes ecological impacts while enabling a flourishing life for individuals, households, communities, and beyond. It is the product of individual and collective decisions about aspirations and about satisfying needs and adopting practices, which are in turn conditioned, facilitated, and constrained by societal norms, political institutions, public policies, infrastructures, markets, and culture.\"\nThe United Nations includes analyses of efficiency, infrastructure, and waste, as well as access to basic services, green and decent jobs, and a better quality of life for all within the concept of sustainable consumption. Sustainable consumption shares a number of common features and is closely linked to sustainable production and sustainable development. Sustainable consumption, as part of sustainable development, is part of the worldwide struggle against sustainability challenges such as climate change, resource depletion, famines, and environmental pollution.\nSustainable development as well as sustainable consumption rely on certain premises such as:\n\nEffective use of resources, and minimization of waste and pollution\nUse of renewable resources within their capacity for renewal\nThe reuse and upcycling of product life-cycles so that consumer items are utilized to maximum potential\nIntergenerational and intragenerational equity\nGoal 12 of the Sustainable Development Goals seeks to \"ensure sustainable consumption and production patterns\".\n\n\n== Consumption shifting ==\n\nStudies found that systemic change for \"decarbonization\" of humanity's economic structures or root-cause system changes above politics are required for a substantial impact on global warming. Such changes may result in more sustainable lifestyles, along with associated products, services and expenditures, being structurally supported and becoming sufficiently prevalent and effective in terms of collective greenhouse gas emission reductions.\nNevertheless, ethical consumerism usually only refers to individual choices, and not the consumption behavior and/or import and consumption policies by the decision-making of nation-states. These have however been compared for road vehicles, CO2 emissions (albeit without considering emissions embedded in imports) and meat consumption per capita as well as by overconsumption.\nLife-cycle assessments could assess the comparative sustainability and overall environmental impacts of products – including (but not limited to): \"raw materials, extraction, processing and transport; manufacturing; delivery and installation; customer use; and end of life (such as disposal or recycling)\".\n\n\n=== Sustainable food consumption ===\n\nThe environmental impacts of meat production (and dairy) are large: raising animals for human consumption accounts for approximately 40% of the total amount of agricultural output in industrialized countries. Grazing occupies 26% of the Earth's ice-free terrestrial surface, and feed crop production uses about one third of all arable land. A global food emissions database shows that food systems are responsible for one third of the global anthropogenic GHG emissions. Moreover, there can be competition for resources, such as land, between growing crops for human consumption and growing crops for animals, also referred to as \"food vs. feed\" (see also: food security).\nTherefore, sustainable consumption also includes food consumption – shifting to more sustainable diets.\nNovel foods such as under-development cultured meat and dairy, existing small-scale microbial foods and ground-up insects (see also: pet food and animal feed)  are shown to have the potential to reduce environmental impacts by over 80% in a study. Many studies such as a 2019 IPCC report and a 2022 review about meat and sustainability of food systems, animal welfare, and healthy nutrition concluded that meat consumption has to be reduced substantially for sustainable consumption. The review names broad potential measures such as \"restrictions or fiscal mechanisms\". In June 2023, science advisors in the European Commission's Scientific Advice Mechanism came to the identical conclusion, finding that \"our diets need to shift towards more plant-based ingredients, rich in vegetables, fruits, wholegrains and pulses. Our diets should be limited in red meat, processed meat, salt, added sugar, and high-fat animal products, while fish and seafood should be sourced from sustainably managed stocks\".\nA considerable proportion of consumers of food produced by the food system may be non-livestock animals such as pet-dogs: the global dog population is estimated to be 900 million, of which around 20% are regarded as owned pets. Sustainable consumption may also involve their feed. Beyond reduction of meat consumption, the composition of livestock feed and fish feed may also be subject of sustainable consumption shifts.\n\n\n=== Product labels ===\n\nThe app CodeCheck gives versed smartphone users some capability to scan ingredients in food, drinks and cosmetics for filtering out some of the products that are legal but nevertheless unhealthy or unsustainable from their consumption/purchases. A similar \"personal shopping assistant\" has been investigated in a study. Studies indicated a low level of use of sustainability labels on food. Moreover, existing labels have been intensely criticized for invalidity or unreliability, often amounting to greenwashing or being ineffective.\nIn one study, individuals were given a set budget, \"which could be spent once a week on a wide range of food and drink products\", then data \"on each item's carbon footprint was clearly presented, and individuals could view the [unlimited] carbon footprint of their supermarket basket on their shopping bill.\"\n\n\n=== The processes of consumption ===\nNot only selection, quantity and quality of consumed products may be of relevance to sustainable consumption, the process of consumption, including how selected products are distributed or gathered could be considered a component of it as well: for instance, ordering from a local store online could substantially reduce CO2 emissions (in terms of transportation emissions and when not considering which options are available). Bundling items could reduce carbon emissions of deliveries and carbon footprints of in-person shopping-trips can be eliminated e.g. by biking to the shop instead of driving.\n\n\n=== Product information transparency and trade control ===\n\nIf information is linked to products e.g. via a digital product passport, along with proper architecture and governance for data sharing and data protection, it could help achieve climate neutrality and foster dematerialization. In the EU, a Digital Product Passport is being developed. When there is an increase in greenhouse gas emissions in one country as a result of an emissions reduction by a second country with a strict climate policy this is referred to as carbon leakage. In the EU, the proposed Carbon Border Adjustment Mechanism could help mitigate this problem, and possibly increase the capacity to account for imported pollution/harm/death-footprints. Footprints of nondomestic production are significant: for instance, a study concluded that PM2.5 air pollution induced by the contemporary free trade and consumption by the 19 G20 nations causes two million premature deaths annually, suggesting that the average lifetime consumption of about ~28 people in these countries causes at least one premature death (average age ~67) while developing countries \"cannot be expected\" to implement or be able to implement countermeasures without external support or internationally coordinated efforts.\nTransparency of supply chains is important for global goals such as ending net-deforestation. Policy-options for reducing imported deforestation also include \"Lower/raise import tariffs for sustainably/unsustainably produced commodities\" and \"Regulate imports, e.g., through quotas, bans, or preferential access agreements\". However, several theories of change of policy options rely on (true / reliable) information being available/provided to \"shift demand—both intermediate and final—either away from imported [forest-risk commodities (FRC)] completely, e.g., through diet shifts (IC1), or to sustainably produced FRCs, e.g., through voluntary or mandatory supply-chain transparency (IS1, RS2).\"\nAs of 2021, one approach under development is binary \"labelling\" of investments as \"green\" according to an EU governmental body-created \"taxonomy\" for voluntarily financial investment redirection/guidance based on this categorization. The company Dayrize is one organization that attempts to accurately assess environmental and social impacts of consumer products.\nReliable evaluations and categorizations of products may enable measures such as policy-combinations that include transparent criteria-based eco-tariffs, bans (import control), support of selected production and subsidies which shifts, rather than mainly reduces, consumption. International sanctions during the 2022 Russian invasion of Ukraine included restrictions on Russian fossil fuel imports while supporting alternatives, albeit these sanctions were not based\non environment-related qualitative criteria of the products.\n\n\n=== Fairness and income/spending freedoms ===\nThe bottom half of the population is directly responsible for less than 20% of energy footprints and consume less than the top 5% in terms of trade-corrected energy. High-income individuals usually have higher energy footprints as they disproportionally use their larger financial resources – which they can usually spend freely in their entirety for any purpose as long as the end user purchase is legal – for energy-intensive goods. In particular, the largest disproportionality was identified to be in the domain of transport, where e.g. the top 10% consume 56% of vehicle fuel and conduct 70% of vehicle purchases.\n\n\n=== Techniques and approaches ===\n\nChoice editing refers to the active process of controlling or limiting the choices available to consumers.\nPersonal Carbon Allowances (PCAs) refers to technology-based schemes to ration GHG emissions.\n\n\n==== Degrowth ====\nDegrowth refers to economic paradigms that address the need to reduce global consumption and production whereby metrics and mechanisms like GDP are replaced by more reality-attached measures such as of health, social and environmental well-being and more needs-based structures. Broadly, degrowth would or does aim to address overconsumption \"by addressing real need, reducing wants, ensuring greater distributive equality and ultimately by suppressing production\", or \"downscaling of production and consumption that increases human wellbeing and enhances [i.e. \"grows\"] ecological conditions and equity on the planet\".\nA common denominator of degrowth is a decline in the metric GDP. More concrete degrowth proposals are diverse, dispersed throughout the growing body of literature and include:\n\n\"reducing and redistributing income alone\" along with GHG-pricing and wealth redistribution into a global food systems transformation\nOne tool that could possibly be used in large-scale policies is an app that \"will guide users to prioritize reduction in high-footprint categories\".\nAnother broad proposal suggests that \"different roles of labour, work, and action should be acknowledged and scrutinized in detail\" which could prompt or be necessary for an \"organization of an alternative society\" (see also: green job, life-cycle assessment, certification and job evaluation)\nConsumption such as \"domestic water consumption\" could be [made to be] considered as a collectively ordered activity especially when such data and contextual education is available the respective collective.\nDemonetized activities [as well as currently financially unrewarded and unprofitable activities] are important for degrowth.\nDegrowth also emphasizes the need to 'degrow' various sectors of the economy without a negative connotation usually associated with such measures such as at least temporary job-loss. If no immediate retraining occurs, leisure time may increase at least temporarily. There are some suggestions that in general, increases in leisure time do not per se translate to increased sustainability – in particular that some time saved did not decrease total distance of car travel.\n\n\n===== Degrowth-related economic concepts =====\nA study suggests that the concepts of sharing economy and circular economy on their own, while useful as broad components, are insufficient and ineffective.\nEconomic concepts by which scholarly literature approaches problems such as overconsumption, using this terminology to characterize broad, typically conceptual-stage, solution-proposals include:\n\nDoughnut economy (see also: planetary boundaries)\nCommunity economy and commons (see also: Commons#Economic theories and Gemeinwohl-Ökonomie)\n\n\n== Strong and weak sustainable consumption ==\n\nSome writers make a distinction between \"strong\" and \"weak\" sustainability.\n\nStrong sustainable consumption refers to participating in viable environmental activities, such as consuming renewable and efficient goods and services (such as electric locomotive, cycling, renewable energy). Strong sustainable consumption also refers to an urgency to reduce individual living space and consumption rate.\nWeak sustainable consumption is the failure to adhere to strong sustainable consumption. In other words, consumption of highly pollutant activities, such as frequent car use and consumption of non-biodegradable goods (such as plastic items, metals, and mixed fabrics).\nIn 1992, the United Nations Conference on Environment and Development (UNCED), also referred to as the Earth Summit, recognized sustainable consumption as a concept. It also recognized the difference between strong and weak sustainable consumption but set efforts away from strong sustainable consumption.\nThe 1992 Earth Summit found that sustainable consumption rather than sustainable development was the center of political discourse. Currently, strong sustainable consumption is only present in minimal precincts of discussion and research. International government organizations’ (IGOs) prerogatives have kept away from strong sustainable consumption. To avoid scrutiny, IGOs have deemed their influences as limited, often aligning its interests with consumer wants and needs. In doing so, they advocate for minimal eco-efficient improvements, resulting in government skepticism and minimal commitments to strong sustainable consumption efforts.\nIn order to achieve sustainable consumption, two developments have to take place: an increase in the efficiency of consumption, and a change in consumption patterns and reductions in consumption levels in industrialized countries and rich social classes in developing countries which have a large ecological footprint and set an example for increasing middle classes in developing countries. The first prerequisite is not sufficient on its own and qualifies as weak sustainable consumption. Technological improvements and eco-efficiency support a reduction in resource consumption. Once this aim has been met, the second prerequisite, the change in patterns and reduction of levels of consumption is indispensable. Strong sustainable consumption approaches also pay attention to the social dimension of well-being and assess the need for changes based on a risk-averse perspective. In order to achieve strong sustainable consumption, changes in infrastructures as well as the choices customers have are required. In the political arena, weak sustainable consumption is more discussed.\nThe so-called attitude-behaviour or values-action gap describes an obstacle to changes in individual customer behavior. Many consumers are aware of the importance of their consumption choices and care about environmental issues, however most do not translate their concerns into their consumption patterns. This is because the purchase decision process is complicated and relies on e.g. social, political, and psychological factors. Young et al. identified a lack of time for research, high prices, a lack of information, and the cognitive effort needed as the main barriers when it comes to green consumption choices.\n\n\n== Historical related behaviors ==\nIn the early twentieth century, especially during the interwar period, families turned to sustainable consumption. When unemployment began to stretch resources, American working-class families increasingly became dependent on secondhand goods, such as clothing, tools, and furniture. Used items offered entry into consumer culture, and they also provided investment value and enhancements to wage-earning capabilities. The Great Depression saw increases in the number of families forced to turn to cast-off clothing. When wages became desperate, employers offered clothing replacements as a substitute for earnings. In response, fashion trends decelerated as high-end clothing became a luxury.\nDuring the rapid expansion of post-war suburbia, families turned to new levels of mass consumption. Following the SPI conference of 1956, plastic corporations were quick to enter the mass consumption market of post-war America. During this period companies like Dixie began to replace reusable products with disposable containers (plastic items and metals). Unaware of how to dispose of containers, consumers began to throw waste across public spaces and national parks. Following a Vermont State Legislature ban on disposable glass products, plastic corporations banded together to form the Keep America Beautiful organization in order to encourage individual actions and discourage regulation. The organization teamed with schools and government agencies to spread the anti-litter message. Running public service announcements like \"Susan Spotless,\" the organization encouraged consumers to dispose waste in designated areas.\n\n\n== Culture shifts ==\n\n\n=== Ecological awareness ===\n\nThere is a growing recognition that human well-being is interwoven with the natural environment, as well as an interest to change human activities that cause environmental harm. This is evident in the United Nations Paris Agreement goal of maintaining average global warming to optimistically 1.5 °C, and at least below a threshold of 2.0 °C. Western culture tends to celebrate consumer sovereignty and free market solutions to political economy problems. Yet climate change, and the associated tragedy of the global atmospheric commons, represent a large market failure. There are at least three options for achieving cultural shifts and greater ecological awareness. Private solutions labeled as Corporate Social Responsibility (CSR) strive to incorporate sustainability concerns into market supply and demand forces by increasing the transparency of productive processes, as well as awareness of ecological footprints of consumption. Public solutions apply regulatory frameworks such as the cap and trade system to reduce greenhouse gas emissions. An alternative approach adopts polycentric governance strategies across governmental institutions and non-governmental organizations to achieve greater citizen engagement and self-governance systems. Increasing levels of sustainable consumption to contribute to United Nations Sustainable Development Goal 12 will likely require supportive educational resources.\n\n\n=== Surveys and trends ===\n\nSurveys ranking consumer values such as environmental, social, and sustainability, showed sustainable consumption values to be particularly low. Surveys on environmental awareness saw an increase in perceived “eco-friendly” behavior. When tasked to reduce energy consumption, empirical research found that individuals are only willing to make minimal sacrifices and fail to reach strong sustainable consumption requirements. IGOs are not motivated to adopt sustainable policy decisions, since consumer demands may not meet the requirements of sustainable consumption.\nEthnographic research across Europe concluded that post-Financial crisis of 2007–2008 Ireland saw an increase in secondhand shopping and communal gardening. Following a series of financial scandals, Anti-Austerity became a cultural movement. Irish consumer confidence fell, sparking a cultural shift in second-hand markets and charities, stressing sustainability and drawing on a narrative surrounding economic recovery.\n\n\n== Sustainable Development Goals ==\nThe Sustainable Development Goals were established by the United Nations in 2015. SDG 12 is meant to \"ensure sustainable consumption and production patterns\". Specifically, targets 12.1 and 12.A of SDG 12 aim to implement frameworks and support developing countries in order to \"move towards more sustainable patterns of consumption and production\".\n\n\n== Notable conferences and programs ==\n1992—At the United Nations Conference on Environment and Development (UNCED) the concept of sustainable consumption was established in chapter 4 of the Agenda 21.\n1995—Sustainable consumption was requested to be incorporated by UN Economic and Social Council (ECOSOC) into the UN Guidelines on Consumer Protection.\n1997—A major report on SC was produced by the OECD.\n1998—United Nations Environment Program (UNEP) started a SC program and SC is discussed in the Human Development Report of the UN Development Program (UNDP).\n2002—A ten-year program on sustainable consumption and production (SCP) was created in the Plan of Implementation at the World Summit on Sustainable Development (WSSD) in Johannesburg.\n2003—The \"Marrakesh Process\" was developed by co-ordination of a series of meetings and other \"multi-stakeholder\" processes by UNEP and UNDESA following the WSSD.\n2018—Third International Conference of the Sustainable Consumption Research and Action Initiative (SCORAI) in collaboration with the Copenhagen Business School.\n2022–Bologna, Italy conducts the first or one of the first trials of rewards for sustainable behavior that is not implemented via product prices or subsidy-like financial mechanisms in the EU: with a \"Smart Citizen Wallet\", described as a supermarket points-like system, citizens will have benefits if they for example use public transport and manage energy well.\n\n\n== See also ==\nChoice editing\nCollaborative consumption\nSustainable consumer behavior\nDurable goods\nGroup decision-making\nProduct design\nOverconsumption\n\n\n== References ==\n\n\n== External links ==",
  "links": {
    "350.org": "",
    "7 Billion Actions": "",
    "Adbusters": "",
    "Advanced capitalism": "",
    "Advertising": "",
    "Affluenza": "",
    "Affluenza: The All-Consuming Epidemic": "",
    "Agenda 21": "",
    "Agroecology": "",
    "Air pollution": ""
  },
  "url": "https://en.wikipedia.org/wiki/Sustainable_consumption"
}