{
  "title": "Systems thinking",
  "content": "Systems thinking is a way of making sense of the complexity of the world by looking at it in terms of wholes and relationships rather than by splitting it down into its parts. It has been used as a way of exploring and developing effective action in complex contexts, enabling systems change. Systems thinking draws on and contributes to systems theory and the system sciences. \n\n\n== History ==\n\n\n=== Ptolemaic system versus the Copernican system ===\nThe term system is polysemic: Robert Hooke (1674) used it in multiple senses, in his System of the World,: p.24  but also in the sense of the Ptolemaic system versus the Copernican system: 450  of the relation of the planets to the fixed stars which are cataloged in Hipparchus' and Ptolemy's Star catalog. Hooke's claim was answered in magisterial detail by Newton's (1687) Philosophiæ Naturalis Principia Mathematica, Book three, The System of the World: Book three  (that is, the system of the world is a physical system).\nNewton's approach, using dynamical systems continues to this day. In brief, Newton's equations (a system of equations) have methods for their solution.\n\n\n=== Feedback control systems ===\n\nBy 1824 the Carnot cycle presented an engineering challenge, which was how to maintain the operating temperatures of the hot and cold working fluids of the physical plant. In 1868 James Clerk Maxwell presented a framework for, and a limited solution to the problem of controlling the rotational speed of a physical plant. Maxwell's solution echoed James Watt's  (1784) centrifugal moderator (denoted as element Q) for maintaining (but not enforcing) the constant speed of a physical plant (that is, Q represents a moderator, but not a governor, by Maxwell's definition).\nMaxwell's approach, which linearized the equations of motion of the system, produced a tractable method of solution.: 428–429  Norbert Wiener identified this approach as an influence on his studies of cybernetics during World War II and Wiener even proposed treating some subsystems under investigation as black boxes.: 242  Methods for solutions of the systems of equations then become the subject of study, as in feedback control systems, in stability theory, in constraint satisfaction problems, the unification algorithm, type inference, and so forth.\n\n\n=== Applications ===\n\"So, how do we change the structure of systems to produce more of what we want and less of that which is undesirable? ... MIT’s Jay Forrester likes to say that the average manager can ... guess with great accuracy where to look for leverage points—places in the system where a small change could lead to a large shift in behavior\".: 146 — Donella Meadows, (2008) Thinking In Systems: A Primer p.145 \n\n\n== Characteristics ==\n\n...What is a system? A system is a set of things ... interconnected in such a way that they produce their own pattern of behavior over time. ... But the system’s response to these forces is characteristic of itself, and that response is seldom simple in the real world\n[a system] is \"an integrated whole even though composed of diverse, interacting, specialized structures and subjunctions\"\nSubsystems serve as part of a larger system, but each comprises a system in its own right. Each frequently can be described reductively, with properties obeying its own laws, such as Newton's System of the World, in which entire planets, stars, and their satellites can be treated, sometimes in a scientific way as dynamical systems, entirely mathematically, as demonstrated by Johannes Kepler's equation (1619) for the orbit of Mars before Newton's Principia appeared in 1687.\nBlack boxes are subsystems whose operation can be characterized by their inputs and outputs, without regard to further detail.: 87–88 \n\n\n=== Particular systems ===\nPolitical systems were recognized as early as the millennia before the common era.\nBiological systems were recognized in Aristotle's lagoon ca. 350 BCE.\nEconomic systems were recognized by 1776.\nSocial systems were recognized by the 19th and 20th centuries of the common era.\nRadar systems were developed in World War II in subsystem fashion; they were made up of transmitter, receiver, power supply, and signal processing subsystems, to defend against airborne attacks.\nDynamical systems of ordinary differential equations were shown to exhibit stable behavior given a suitable Lyapunov control function by Aleksandr Lyapunov in 1892.\nThermodynamic systems were treated as early as the eighteenth century, in which it was discovered that heat could be created without limit, but that for closed systems, laws of thermodynamics could be formulated. Ilya Prigogine (1980) has identified situations in which systems far from equilibrium can exhibit stable behavior; once a Lyapunov function has been identified, future and past can be distinguished, and scientific activity can begin.: 212–213 \n\n\n=== Systems far from equilibrium ===\n Living systems are resilient, and are far from equilibrium.: Ch.3  Homeostasis is the analog to equilibrium, for a living system; the concept was described in 1849, and the term was coined in 1926.\n Resilient systems are self-organizing;: Ch.3  \n The scope of functional controls is hierarchical, in a resilient system.: Ch.3 \n\n\n== Frameworks and methodologies ==\nFrameworks and methodologies for systems thinking include:\n\nCritical systems heuristics: in particular, there can be twelve boundary categories for the systems when organizing one's thinking and actions.\nCritical systems thinking, including the E P I C approach.\nOntology engineering of representation, formal naming and definition of categories, and the properties and the relations between concepts, data, and entities.\nSoft systems methodology, including the CATWOE approach and rich pictures.\nSystemic design, for example using the double diamond approach.\nSystem dynamics of stocks, flows, and internal feedback loops.\nViable system model: uses 5 subsystems.\n\n\n== See also ==\n\nConceptual systems – System composed of non-physical objects, i.e. ideas or conceptsPages displaying short descriptions of redirect targets\nManagement cybernetics – Application of cybernetics to management and organizations\nOperations research – Discipline concerning the application of advanced analytical methods\nSystems engineering – Interdisciplinary field of engineering\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Sources ===\nRussell L. Ackoff (1968) \"General Systems Theory and Systems Research Contrasting Conceptions of Systems Science.\" in: Views on a General Systems Theory: Proceedings from the Second System Symposium, Mihajlo D. Mesarovic (ed.).\nA.C. Ehresmann, J.-P. Vanbremeersch (1987) Hierarchical evolutive systems: A mathematical model for complex systems\" Bulletin of Mathematical Biology Volume 49, Issue 1, Pages 13–50\nNJTA Kramer & J de Smit (1977) Systems thinking: Concepts and Notions, Springer. 148 pages\nA. H. Louie (November 1983) \"Categorical system theory\" Bulletin of Mathematical Biology volume 45, pages 1047–1072\nDonellaMeadows.org Systems Thinking Resources\nGerald Midgley (ed.) (2002) Systems Thinking, SAGE Publications.  4 volume set: 1,492 pages List of chapter titles\nRobert Rosen. (1958) “The Representation of Biological Systems from the Standpoint of the Theory of Categories\". Bull. math. Biophys. 20, 317–342.\nPeter Senge, (1990) The Fifth Discipline",
  "links": {
    "Adam Smith": "",
    "Adaptation": "",
    "Agent-based model": "",
    "Aleksandr Lyapunov": "",
    "Alexander Bogdanov": "",
    "Allenna Leonard": "",
    "Almagest": "",
    "Anatol Rapoport": "",
    "Ant colony optimization algorithms": "",
    "Anthony Stafford Beer": ""
  },
  "url": "https://en.wikipedia.org/wiki/Systems_thinking"
}