{
  "title": "Theories of love",
  "content": "Theories of love can refer to several psychological and sociological theories:\n\nAttachment theory\nColor wheel theory of love (based on the 1973 book The Colors of Love by John Lee)\nPassionate and companionate love theory (based on research by Elaine Hatfield)\nFilter theory\nReward theory of attraction\nRubin's scale of liking and love (based on research by Zick Rubin)\nTriangular theory of love\nVulnerability and care theory of love\n\n\n== Love ==\nLove is a complex, ever-changing concept that has evolved over the course of time. Different societies, cultures, and eras have attached different values to the word and have different perspectives on the concept. In the 17th century, one's family would pick the person one was going to marry based on social class and economic status. In some cultures, girls are married by the age of fourteen or even younger. In traditional definitions of love, love has been compared to God because of the power it has over those who believe in it. Love has the ability to be the source of human happiness, a sense of worth, and a source of healing from hurt or suffering.\nIn the 18th century, romantic love expressed sensibility and authenticity as it stood for \"the truth of feeling\". Many people view love as the reason for living. Symbolic interaction theorists believe that shared meanings, orientations, and assumptions form the basic motives behind people's actions.: 31  Cultural norms regarding the experience of love vary so that the emphasis in relationships is on sexual attraction, romantic courtship, intimate friendship, or commitment.\nAlthough love can be the motive for some people's actions and bring people joy, love can also bring us sadness. \"Love does us no good if we love the wrong person.\": 1  When people open their hearts and show their flaws, vulnerabilities, and weaknesses to the wrong person, it can result in heartbreak, then causing feelings of regret. So why do humans deal with such a complicated thing such as love? Humans \"need to love and to be loved\".: 1 \nThe four types of love described in philosophy include agape, phileo, storge, and eros. Agape is a type of unconditional love that is less common in society but more apparent between individuals and their god. Phileo is a love used to describe friendship between individuals. This love is commonly seen between friends in public, especially as displays of warm gestures. Storge is another type of love that is expressed through parenting. Eros is a romantic love that was a type of love forbidden in early society and is still forbidden in some societies today. These different types of love are expressed differently based on culture.\n\n\n== Culture ==\nLove is expressed in a multitude of forms, dependent on location and societal norms. Expressions of love can include acts such as self-sacrifice, compromise, courting, kissing, sex, and physical contact. Different cultures have adopted different customs; for instance, in Japan, public displays of affection are discouraged, and individuals typically express adoration in private. In France, people show their love by holding hands, kissing, and initiating sexual relationships. The United States has a different perspective on love, with people going on dates, having casual sex, and are open to meeting new people on social media or dating apps. Customs in the U.S. are generally more liberal when compared to other parts of the world. Marital traditions are largely cultural as well.\n\n\n=== Marriage customs ===\nMarriage is a legally binding union of two individuals who have commit to each other as partners in a personal relationship. However, the definition of marriage varies widely by culture, region, and jurisdiction. In the 19th century, many marriages were enforced by the parents of the individuals to satisfy political or economic factors in families. In India, arranged marriages and dowries remain a current practice. Elopement, also known as love marriage, has increased substantially in some parts of India. Marriage in Japan is more liberal in relation to arranged marriage, initially beginning with courtship that would allow love to develop, then eventually lead to marriage. In the United States, marriage customs vary, dependent on the desires of the individuals family, the individuals cultural background, and societal pressures.\n\n\n=== Societal factors ===\nFactors such as gender, race, economic status, age, religion, education, and ethnicity can influence an individual's views on both marriage and love. Shared expectations of age-appropriate behavior can pressure an individual into marriage. Depictions of love in social media and film also influence and pressure individuals in relation to love, and can potentially impact the expectations what marriage and should look like. Young adults are predominantly influenced by unrealistic depictions of love, witnessed in film and social media. For example, The Notebook depicts love as a force that can conquer all, the idealisation of one's partner, and the idea of soulmates.\n\n\n== Necessity of love ==\nLove allows people to attribute a sense of purpose for living. From the moment of birth, relationships are made: mother and child, father and child, grandparent and child, and the like. As people grow older and enter into schools, jobs, and get involved in their communities the number of relationships, they have grown, as does their ability to maintain these relationships. Love can have a powerful effect on the human body. Irving Singer wrote, \"For a person in love … life is never without meaning.\": 2  A person's life is built the love between two people – their parents, the love they share for the friendships they make and eventually, the person they marry and have children of their own with. The feelings love brings: happiness, empathy, mutual respect, a sense of purpose, can lead to stronger motivation, less stress, a positive outlook on life, and hope.: xi \nLove allows humans to communicate through their emotions. To love effectively, one has to love themselves first: to love another person's flaws and quirks, one has to love their own flaws and quirks.: x \nHumans are not the only species in the world that can feel love and its effects. Non-human animals can feel love as well, although it is less complex and less creative.: 19  Many animals feel emotions. When a dog wags its tail or licks its owner after being parted for a few hours, this is interpreted as happiness. When a person leaves for work in the morning and their dog cries at the window, it exhibits sadness. A growling dog who doesn't like it when someone touches its favorite toy is showing anger. Animals can feel love as well as other basic emotions humans feel. Dogs that grow up with siblings create strong bonds with their siblings. If their sibling dies, the dog can go into depression and refuse to eat.\nLove holds a higher significance than many people might assume. For example, Abraham Maslow, an American psychologist, developed a theory called \"Maslow's Hierarchy of Needs\". In this hierarchy, Maslow presents the different levels of priorities and needs we have as human beings. Maslow has listed physiological needs as the first essential need of human beings. Following physiological needs is safety needs which include the innate need for security, health, jobs, work, etc. Finally in third comes the need for belonging. Maslow describes this need as love, affection, family, friends, and intimacy. Although Maslow lists belonging on the third tier of the hierarchy of needs, one may argue that the sense of belonging, along with love and affection, could be the foundation of the pyramid of needs. When we explore the possibilities and actions that people take for love, it is clear how powerful it can be. For example, parents who are willing to risk their lives or die in the place of their child would be putting their belonging needs over their physiological need of safety. The motivation to express and feel love may overpower any physiological need that humans have.\n\n\n== Types of love ==\nHumans come across different types of love as they reach different levels of maturity in their life, such as the love a mother feels for their child, the love that involves the instant attraction to a person, and the love that comes from years of being together. The love humans share for their family and friends can be viewed as \"slow love\". This love is based on finding shared interests and lifestyles that connect people to each other.: 11  It is a love that can be carried out because of the common interests that bind them together. It is more of a mental attraction than a physical attraction. Visually, we make interpretations of love based on the way a person looks. \"Harmonism\" and \"echoism\" are the ways a face is constructed that make one physically attractive: the distance between the forehead and nose, the distance between the mouth and chin, how close the eyes are together, and the sweep of one's eyebrows.: 10  The biochemical level fluctuation of a person can also explain the question \"Who We Love\". People who have expressive traits, such as curiosity and liveliness, tend to be drawn to people who have similar personalities. People who are cautious and socially conforming are attracted to their same kind as well. However, people who are foremost with expressive traits of sex hormones tend to be enchanted by their opposite kinds. People with a relatively high testosterone hormone are analytical and tough-minded. They tend to choose people with a relatively high estrogen hormone who are empathetic and pro-social. Besides the biochemical level explanation, there are also a few other elements that affect people's choices of mates. Another factor that influences who people choose to love is timing. Love can happen when one least expects it. Furthermore, people more easily fall in love when they are emotionally aroused, especially in a hard and lonely time. This is because such a mental state is associated with arousal mechanisms in the brain and elevated levels of stress hormones, both of which increase the level of the romantic passion hormone: dopamine. Distance is another element that influences people's love choices: people tend to choose to fall in love with those close to them. Childhood experience also influences mate choices. By the teenage years, people gradually construct a catalog of aptitudes and mannerisms they are looking for in a mate. Subtle differences in their experiences shape romantic tastes. Physical looks matter as well. From an anthropological point of view, a male tends to choose a female with a visual sign of youth and beauty, which indicates her high oestrogen level and strong reproductive ability. However, a female with a more pragmatic and realistic goal, tends to choose a male with education, ambition, wealth, respect, status and masculine appearance.\nAnother reason why we love who we love has to do with culture and history.: 371  Take incest, for example. In some Western cultures, falling in love with one's first cousin could be seen as possibly 'taboo' and therefore morally and lawfully wrong. However, it is legal to marry one's cousin in many Western countries, e.g. the UK. Similarly, in some Muslim tribes, it is perfectly acceptable to fall in love with one's cousin. In the past, kissing cousins in Western societies were not uncommon. In addition, in the past, mixed-race marriages were illegal in the United States. This led to people only marrying people of the same race. However, now that the society of the United States has changed drastically, it is common and completely acceptable to find couples of different races.\nAnother type of love people come across in their life is sexual love. As an individual crosses over from a child to a teen to an adult, this type of love becomes more relevant in their life. According to Milligan, \"Sexualized intimate love is delusional and requires an overestimation of the person we love.\": 2  A sexual love is a misconception of the person's beauty, intelligence, or charm. This type of love can reveal a lot about the person who's feeling such strong passionate feelings. It gives more insight into the lover than it gives about the loved one. Sexual love is not love at first sight – it is basic human instinct and hormonal responses.: 20 \n\n\n== Attachment theory of love ==\nPsychiatrist and psychologist John Bowlby was the first to develop the attachment theory of love in Western culture. It focuses on the relationships or attachments that form between people. It starts with attachments made in infancy, stating that it is important for children to have a relationship with their primary caregivers in order to experience normal development. Though the underlying concepts originated in Mary Ainsworth's Strange Situation research, Bowlby organized the concepts into a more comprehensive theory. There are three tenets of this theory:\n\nThe creation of bonds is an intrinsic need.\nEmotions and fear need to be regulated to increase vitality.\nAdaptiveness and growth need to be encouraged.\nAccording to this theory, one person in the relationship uses the other person as a \"secure base\", exploring the world from this person and using them as a safe place to return to when stressed or experiencing perceived danger. Bowlby's theory was extended from infants to adults by Cindy Hazan and Phillip Shaver. There is a transition of this attachment from the parent to a peer in adulthood. It is thought that proximity-seeking behavior is the first thing needed for this transition to occur. Much like the attachment styles identified in infants, there were four attachment styles identified for adults. These styles are secure, anxious -preoccupied, dismissive-avoidant, and fearful-avoidant. These attachment theories can influence adults differently in their romantic lives.\n\n\n=== Secure-attachment ===\nAdults who have a secure attachment style will be good at conflict resolution, be flexible in their thinking, communicate effectively, not be manipulative, have no fear of being enmeshed, hold the belief that they can positively impact their relationship, and care for their partner in the way that they wish to be cared for. They understand that there are a multitude of potential partners that could fulfill their needs and, therefore, feel confident leaving a partner that does not meet their needs. Research suggests that only one partner with a secure attachment style is necessary for a relationship to function in a healthy manner.\n\n\n=== Anxious-preoccupied attachment ===\nAdults who have an anxious-preoccupied attachment style tend to become overly dependent on their partners. They typically have trust issues, lower self-esteem, and higher levels of worry in their relationships. It is believed that these individuals may not have been able to develop the necessary defenses against separation anxiety and this leads to an emotional reaction to the perceived threat of separation. This thought pattern can lead these individuals to self-sabotage, causing them to tend to go after partners with a dismissive-avoidant style.\n\n\n=== Dismissive-avoidant attachment ===\nAdults with a dismissive-avoidant attachment style want to be independent. This desire for independence can lead these individuals to avoid relationships. They often have a hard time trusting other people and also view themselves highly. Their high self-esteem is supported by over-emphasizing their competency and achievements. It is thought that this attachment style stems from trying to avoid being rejected or truly having no interest in being close to other people.\n\n\n=== Fearful-avoidant attachment ===\nLastly, adults with a fearful-avoidant attachment style are not sure how they feel about intimate relationships. They have conflicting feelings of wanting emotional intimacy and feeling uncomfortable with it. They have trouble trusting others. They often feel that they are unworthy of affection. They also tend to avoid intimacy, or at least do not seek it out.\n\n\n=== Criticism ===\nThere are still areas of this theory that have not been explored, such as contextual attachment within relationships. There has also been criticism for this theory. This includes criticism over Bowlby's wording of \"partial deprivation\" to describe a relationship with a caregiver that is unsatisfying. Critics claim that this wording was too vague and allowed people to over-extend this to any issues within the parent-child relationship. Other criticism stems from Hilda Lewis’ research which was not able to show a connection between separation from the mother and behavior. There have also been some calls to remove attachment disorder from clinical psychology because some critics believe that there is no professional consensus on what \"attachment\" means and how it should be utilized in the clinical setting.\n\n\n== Vertical and horizontal structure of love ==\n\n\n=== Vertical structure ===\nSocial psychologist, Philips Shaver, and colleagues found that attachment processes could be represented in a hierarchy. By collecting data about males' and females' cognition of \"love\", researchers used a prototype approach to investigate the concept of love. \"Love\" is a basic level that concept includes super-ordinate categories of emotions: affection, adoration, fondness, liking, attraction, caring, tenderness, compassion, arousal, desire, passion, and longing. Love contains large sub-clusters that designate generic forms of love: friendship, sibling relationship, marital relationship etc. Such as, \"affection\", similar to \"companionate love\" in social psychology field, is the term most strongly co-occurs with terms in its generic sub-cluster and not with other terms in other sub-cluster groups: \"Affection\" for example contrasts significantly with \"passionate love\", which belongs to the second large sub-cluster – \"lust\".\n\n\n=== Horizontal structure ===\nLove can also be examined along a horizontal dimension with a prototype approach. Psychologists Beverley, Fehr and James Russell designed and conducted six experiments to examine the concept of love horizontally: free listing of subtypes of love; rating the goodness of love examples; reaction time to verify love category memberships; the fuzzy border of love definition; the sustainability of the subcategory of love; love subcategory family resemblances. For example, Beverly Fehr and James Russell examined the concept of love by carrying out the fifth experiment, the Sustainability of the Subcategory. They selected 10 sentences that defined \"love\" written by one group of participants and 10 definitions of \"love\" from textbooks. They asked other groups of participants to judge how weird or natural those sentences sounded when the word \"love\" in those definitions was substituted by targeted sub-category terms. When a prototypical sub-type substituted, such as friendship, the sentence sounded subjectively natural. However, when a peripheral sub-type, such as infatuation, took the place of \"love\" in the definitions, it yielded subjectively peculiar results. \"In sum, Fehr identified a set of features of love that appear to have a clear prototype structure in terms of some features being better and some being poorer exemplars of the concept of love, and this difference appears to affect other aspects of the way love-related phenomena are processed.\"\nLater Arthur Aron and Lori Westbay expanded the underlying structure of love prototype of Fehr's research. To understand the way people deal with love-related information, Aron and Westbay examined the latent structure and individual differences within Fehr's subgroup structure with three validation tests. They concluded that people generally understand the concept of love centralizing around three dimensions (passion, intimacy and commitment) which correspond to Sternberg's triangular theory of love. An individual's prototype of love limits his or her experience of a relationship, but the degree of these three dimensions that the individual emphasizes on depends on circumstances of that relationship.\n\n\n== Love in the 21st century ==\nToday, love is still highly valued in the Western society. Love is viewed as important and special. It is put on a pedestal, making it almost impossible to fulfill all the expectations that people have for their relationships and marriages. For example, with the rising of \"promposals\", which are extravagant ways of asking someone to prom, the ways that the expectations of romance are increasing are illustrated. Today, sex lives are commonly flaunted rather than hidden as they used to be. Compared to the past, people are more open to sexuality, promiscuity, and divorce. As the world continues to change the views on love, its significance will continue to modify as the minds of people change.\n\n\n== See also ==\nArranged marriage\nBiological basis of love\n\n\n== References ==",
  "links": {
    "Abraham Maslow": "",
    "Agape": "",
    "Anti-miscegenation laws": "",
    "Arranged marriage in the Indian subcontinent": "",
    "Attachment theory": "",
    "Biological basis of love": "",
    "Broken heart": "",
    "Casual sex": "",
    "Cecilia L. Ridgeway": "",
    "Color wheel theory of love": ""
  },
  "url": "https://en.wikipedia.org/wiki/Theories_of_love"
}