{
  "title": "Tree of life (Kabbalah)",
  "content": "The tree of life (Hebrew: עֵץ חַיִּים, romanized: ʿēṣ ḥayyim or no: אִילָן‎, romanized: ʾilān, lit. 'tree') is a diagram used in Rabbinical Judaism in kabbalah and other mystical traditions derived from it. It is usually referred to as the \"kabbalistic tree of life\" to distinguish it from the tree of life that appears alongside the tree of the knowledge of good and evil in the Genesis creation narrative and well as the archetypal tree of life found in many cultures.\nSimo Parpola asserted that the concept of a tree of life with different spheres encompassing aspects of reality traces its origins back to the Neo-Assyrian Empire in the ninth century BCE. The Assyrians assigned moral values and specific numbers to Mesopotamian deities similar to those used in Kabbalah and claims that the state tied these to sacred tree images as a model of the king parallel to the idea of Adam Kadmon. However, J. H. Chajes states that the ilan should be regarded as primarily indebted to the Porphyrian tree and maps of the celestial spheres rather than to any speculative ancient sources, Assyrian or otherwise.\nKabbalah's beginnings date to the Middle Ages, originating in the Bahir and the Zohar. Although the earliest extant Hebrew kabbalistic manuscripts dating to the late 13th century contain diagrams, including one labelled \"Tree of Wisdom,\" the now-iconic tree of life emerged during the fourteenth century.\nThe iconic representation first appeared in print on the cover of the Latin translation of Gates of Light in the year 1516. Scholars have traced the origin of the art in the Porta Lucis cover to Johann Reuchlin.\n\n\n== Description ==\nThe tree of life usually consists of 10 or 11 nodes symbolizing different archetypes and 22 paths connecting the nodes. The nodes are often arranged into three columns to represent that they belong to a common category.\nIn kabbalah, the nodes are called sefirot. They are usually represented as circles and the paths (Hebrew: צִנּוֹר, romanized: ṣinnoroṯ) are usually represented as lines. The nodes usually represent encompassing aspects of existence, God, or the human psyche. The paths usually represent the relationship between the concepts ascribed to the spheres or a symbolic description of the requirements to go from one sphere to another. The columns are usually symbolized as pillars. These usually represent different kinds of moral values, electric charges, or types of ceremonial magic.\nThe sefirot are the ten spheres on the Tree of Life. Each sefirah (singular of sefirot) represents a different aspect of the Divine, as well as aspects of human consciousness and existence. These are, from top to bottom:\n\nKeter (crown)\nHokhmah (wisdom)\nBinah (intelligence)\nHesed (mercy)\nGevurah (judgement)\nTiferet (beauty)\nNetsah (lasting endurance)\nHod (majesty)\nYesod (foundation of the world)\nMalkuth (kingdom)\nAn eleventh sefirah, Da'at, appears in some diagrams of the tree halfway between Keter (node 1) and Tiferet (node 6).\nThe diagram is also used in Christian Kabbalah, Hermetic Qabalah, and Theosophy. The nodes are also associated with deities, angels, celestial bodies, moral values, single colors or combinations of them, and specific numbers.\n\n\n== History ==\nPaolo Riccio's son, Jerome/Hieronymus, actively exchanged letters and shared his father's work with Reuchlin before publication. Thus, in the year 1516, Reuchlin's diagram came to appear on the cover of the Paolo Riccio's Latin translation of Joseph ben Abraham Gikatilla's Gates of Light. The diagram only had 17 paths and, at the time, the concepts of 10 spheres and 22 letters were still distinct in the literature. In 1573, a version sketched by Franciscus Zillettus appeared in Cesare Evoli, De divinis attributis.\nThis version introduced several innovations that would reappear in later versions: all the spheres were of the same size, the lines became wide paths, the spheres were aligned into 3 distinct columns, Malkuth was connected to three spheres, and astrological symbols for the known celestial bodies were used in conjunction with the Hebrew names to label the spheres. However, it also had only 17 paths, albeit distributed differently. Reuchlin's version was reprinted in Johann Pistorius' compilation of 1587. Finally, several versions from unknown artists introducing 21 and 22 paths appeared in the posthumous print editions of Moses Cordovero's Pardes Rimonim between 1592 and 1609. However, the diagrams with 22 paths lacked consistency with each other and none of them had the 22 letters. Between 1652 and 1654, Athanasius Kircher published his version of the tree in Oedipus Aegyptiacus. According to 20th-century occult writer Aleister Crowley, Kircher designed his diagram in a syncretic attempt to reconcile several distinct ideas. This heavily annotated version, self-termed Sefirotic System, introduced more innovations: abstract concepts, divine names, the 22 Hebrew letters for each path, and new astrological symbols.\nBetween 1677 and 1684, Christian Knorr von Rosenroth published Kabbala denudata. The first volume concluded with an apparatus featuring five ilanot, or kabbalistic trees, representing various aspects of Lurianic cosmology. Four of these were based on ilanot that had been designed by Jewish kabbalists over the preceding half century; one (his figures 8–12) was designed by Knorr based on his reading of select passages of Naftali Hertz ben Yaakov Elchanan's 1648 Emek ha-melekh.\nConsequently, according to contemporary students of Western esotericism (rather than to scholars of Jewish Kabbalah), two versions are now widely circulated: one where Malkuth has 1 path, owing to Reuchlin's original; and another where Malkuth has three paths, owing to several later versions; both having 22 paths in total, corresponding each to a Hebrew letter, owing to Kircher's syncretism. With the resurgence of occultism in the 19th century, many new versions appeared, but without major innovations.\n\n\n== In Chabad ==\n\nAccording to a Chabad source, the tree of life is to be interpreted in the following way:\nThe tree represents a series of divine emanations of God's creation itself ex nihilo, the nature of revealed divinity, the human soul, and the spiritual path of ascent by man. In this way, Kabbalists developed the symbol into a full model of reality, using the tree to depict a map of creation.\nThe symbolic configuration is made of ten spiritual principles, but eleven can be shown, since Keter and Da'at are interchangeable.\nThe tree of the knowledge of good and evil is equivalent to the ten spheres seen from the last sphere of the diagram, Malkuth, and the original tree of life is equivalent to the ten spheres seen from the middle sphere of the diagram, Tiferet.\nKabbalists believe the tree of life to be a diagrammatic representation of the process by which the universe came into being.\nOn the tree of life, the beginning of the universe is placed in a space above the first sphere (named \"Keter\" or \"crown\" in English). It is not always pictured in reproductions of the tree of life, but is referred to universally as Ohr Ein Sof (Hebrew: אֵין סוֹף אוֹר, romanized: endless light).\nTo Kabbalists, it symbolizes that point beyond which our comprehension of the origins of being cannot go. It is considered to be an infinite nothingness out of which the first \"thing\", usually understood by Kabbalists to be something approximating \"energy\", exploded to create a universe of multiple things.\nKabbalists also do not envision time and space as preexisting and place them at the next three stages on the tree of life.\nFirst is \"Keter\", which is thought of as the product of the contraction of \"Ein Sof\" into a singularity of infinite energy or limitless light. In the Kabbalah, it is the primordial energy out of which all things are created.\nThe next stage is \"Chokmah\" (or \"wisdom\" in English), which is considered to be a stage at which the infinitely hot and contracted singularity expanded forth into space and time. It is often thought of as pure dynamic energy of an infinite intensity forever propelled forth at a speed faster than light.\nNext comes \"Binah\" (or \"understanding\" in English), which is thought of as the primordial feminine energy, the supernal mother of the universe which receives the energy of \"Chokmah\", cooling and nourishing it into the multitudinous forms present throughout the whole cosmos. It is also seen as the beginning of time itself.\nNumbers are very important to Kabbalists, and the Hebrew letters of the alphabet also have a numerical value. Each stage of the emanation of the universe on the tree of life is numbered meaningfully from one (\"Keter\") to ten (\"Malkuth\"). Each number is thought to express the nature of its sphere.\nThe first three spheres, called the \"supernal\" spheres, are considered to be the primordial energies of the universe. The next stages of evolution on the tree of life are considered to exist beyond a space on the tree, called the \"Abyss\", between the \"supernals\" and the other spheres, because their levels of being are so distinct from each other that they appear to exist in two totally different realities. The \"supernal\" spheres exist on a plane of divine energy. This is why another correspondence for \"Binah\" is the idea of suffering because the \"supernal\" maternal energy gives birth to a world that is inherently excluded from that divine union.\nAfter \"Binah\", the universe begins building the materials it will need to fulfill its evolution and it creates new combinations of those materials until it is so dense that, by the stage of \"Malkuth\", the initial pure limitless energy has solidified into the physical universe.\nSince its energies are the basis of all creation, the tree of life can potentially be applied to any area of life, especially the inner world of man, from the subconscious all the way to what Kabbalists call the higher self.\nThe tree of life speaks not only of the origins of the physical universe out of the unimaginable but also of humanity's place in it. Since man is invested with a mind, consciousness in the Kabbalah is thought of as the fruit of the physical world, through whom the original infinite energy can experience and express itself as a finite entity.\nAfter the energy of creation has condensed into matter, it is thought to reverse its course back up the tree until it is once again united with its true nature, Keter. Thus the Kabbalist seeks to know himself and the universe as an expression of God and to make the journey of return using the stages charted by the spheres, until he has come to the realization he sought.\n\n\n== In Hermetic Qabalah ==\n\nIn Hermetic Qabalah, the Tree of Life is a fundamental concept and symbol that represents the structure of the universe and the spiritual and metaphysical path to enlightenment. It is often depicted as a diagram composed of ten interconnected spheres (called sephiroth) and 22 connecting paths, which together form a pattern resembling a tree.\n\nThe list of sefirot with their usual translations in Hermetic Qabalah is:\n\nKether \"Crown\"\nChokmah \"Wisdom\"\nBinah \"Understanding\"\nChesed \"Mercy\"\nGeburah \"Severity\"\nTiphareth \"Beauty\"\nNetsach \"Victory\"\nHod \"Splendour\"\nYesod \"Foundation\"\nMalkuth \"Kingdom\"\n\n\n=== Paths ===\n\nThe 22 connecting paths on the Tree of Life represent the connections between the sephiroth. Each path is associated with a specific Hebrew letter, Tarot card, and a range of meanings and correspondences. Hermetic Qabalists see the cards of the tarot as keys to the Tree of Life. The 22 cards including the 21 Trumps plus the Fool or Zero card are often called the \"Major Arcana\" or \"Greater Mysteries\" and are seen as corresponding to the 22 Hebrew letters and the 22 paths of the Tree; the ace to ten in each suit correspond to the ten sephiroth in the four Qabalistic worlds; and the sixteen court cards relate to the classical elements in the four worlds. While the sephiroth describe the nature of divinity, the paths between them describe ways of knowing the Divine.\n\n\n==== Path of the flaming sword ====\n\nThe path of the flaming sword (Hebrew: נתיב החרב הבוערת) refers to the flaming sword which God put to guard the Garden of Eden after Adam and Eve were cast out. It is a concept in Kabbalah which represents the order in which the ten sefirot were created. The path emanates from the Ein Sof, the boundless source of divinity, begins at Kether (the crown) and ends at Malkuth (the kingdom), where the physical world manifests, and symbolizes \"the logos which unifies them.\"\n\n\n== See also ==\nAtziluth\nBoaz and Jachin\nFlower of life\nQlippoth\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Works cited ===\n\n\n== Further reading ==\n\n\n== External links ==\n\nThe Tree of Life in Kabbalah by Rodurago Cypheron\nIlanot: Maps of God — a searchable descriptive catalogue of kabbalistic diagrams in manuscripts and books from Medieval Age to the 20th century, by J. H. Chajes",
  "links": {
    "613 commandments": "",
    "777 and Other Qabalistic Writings of Aleister Crowley": "",
    "Abbey of Thelema": "",
    "Abrahadabra": "",
    "Abraham Abulafia": "",
    "Abraham Azulai": "",
    "Abraham Isaac Kook": "",
    "Abramelin oil": "",
    "Abyss (Thelema)": "",
    "Adam Kadmon": ""
  },
  "url": "https://en.wikipedia.org/wiki/Tree_of_life_(Kabbalah)"
}