{
  "title": "Universal mind",
  "content": "The universal mind, or universal consciousness, is a metaphysical concept suggesting an underlying essence of all beings and becoming in the universe. It includes the being and becoming that occurred in the universe prior to the emergence of the concept of mind, a term that more appropriately refers to the organic, human aspect of universal consciousness. It addresses inorganic being and becoming and the interactions that occur in that process without specific reference to the physical and chemical laws that try to describe those interactions. Those interactions have occurred, do occur, and continue to occur. Universal consciousness is the source that underlies those interactions and the awareness and knowledge they imply.\n\n\n== Introduction ==\nThe concept of the universal mind was presented by Anaxagoras, a pre-Socratic philosopher who arrived in Athens some time after 480 BC. He taught that the growth of living things depends on the power of mind within the organisms that enables them to extract nourishment from surrounding substances. For this concept of mind, Anaxagoras was commended by Aristotle. Both Plato and Aristotle, however, objected that his notion of mind did not include a view that mind acts ethically, i.e., acts for the “best interests” of the universe.\nThe most original aspect of Anaxagoras's system was his doctrine of nous (\"mind\" or \"reason\"). A different Greek word, gnósi (knowledge), better reflects what is observed in the wider world of organic and inorganic beings than just the human world.\nChu Ch’an says, “The universal mind, therefore, is something to which nothing can be attributed. Being absolute goes beyond attributes. If, for example, it were to be described as infinite, that would exclude from it whatever is finite, but the whole argument of the book is that the universal mind is the only reality and that everything we apprehend through our senses is nothing else but this mind. Even to think of it in terms of existence or non-existence is to misapprehend it entirely.” pp. 8–9\nThe term surfaced again in later philosophy, as in the writings of Hegel. - Hegel writes:\n\n¤ 377  The knowledge of Mind is the highest and hardest, just because it is the most 'concrete' of sciences. The significance of that 'absolute' commandment, Know thyself − whether we look at it in itself or under the historical circumstances of its first utterance − is not  to promote mere self−knowledge in respect of the particular capacities, character, propensities, and foibles of the single self. The knowledge it commands means that of man's genuine reality − of what is  essentially and ultimately true and real − of mind as the true and  essential being.” [4]\n\n\n== Descriptions ==\nThere are no definitions of the Universal Mind, but two authors within the New Thought movement offer vague descriptions in superlatives such as omnipotence.\nErnest Holmes, the founder of the Science of Mind movement: \n\nThe Universal Mind contains any knowledge. It is the potential ultimate of any thing. To it things are possible.\nNew Thought author Charles Haanel said of the universal mind and its relationship to humans:\n\nThe Universal Mind has unlimited resources at its command, and when we remember that it is also omnipresent, we cannot escape the conclusion that we must be a manifestation of that Mind.\nThe nature of the universal mind is said to be omnipresent.\n\n\n== See also ==\nPanpsychism\nMana (Mandaeism)\n\n\n== References ==\n\n\n== Sources ==\nAnaxagoras. (2013). Encyclopædia Britannica. Encyclopædia Britannica Deluxe Edition.  Chicago: Encyclopædia Britannica.\nBlofeld., J., under pseudonym Chu Ch'an,1947 \"The Huang Po Doctrine of Universal Mind\"\nGeorg Wilhelm Friedric Hegel, The Phenomenology of Mind\nRobert Anthony, Beyond Positive Thinking: A No-Nonsense Formula for Getting the Results You Want\nMartin E Moore, The Universal Mind & I: Intelligent Spiritual Philosophy\nCharles Haanel, \"Master Key System\"\n\n\n== External links ==\nThe Huang Po Doctrine of Universal Mind",
  "links": {
    "A. K. Mozumdar": "",
    "Affiliated New Thought Network": "",
    "Affirmative prayer": "",
    "Agape International Spiritual Center": "",
    "Anaxagoras": "",
    "Annetta Seabury Dresser": "",
    "Aristotle": "",
    "Association for Global New Thought": "",
    "Byron Katie": "",
    "Caroline Myss": ""
  },
  "url": "https://en.wikipedia.org/wiki/Universal_mind"
}